#!/usr/bin/env python
# _*_ coding=utf-8 _*_
from enum import Enum
import random


class WordDict(Enum):
    a_1 = [('ā', '阿'), ('ā', '啊'), ('ā', '腌'), ('ā', '吖'), ('ā', '锕'), ('ā', '錒')]
    a_2 = [('á', '嗄')]
    a_3 = [('a', '呵')]
    ai_1 = [('āi', '哀'), ('āi', '埃'), ('āi', '唉'), ('āi', '挨'), ('āi', '哎'), ('āi', '娭'), ('āi', '溾'), ('āi', '銰'),
            ('āi', '锿'), ('āi', '諰'), ('āi', '鎄')]
    ai_2 = [('ái', '癌'), ('ái', '捱'), ('ái', '皑'), ('ái', '啀'), ('ái', '凒'), ('ái', '隑'), ('ái', '嵦'), ('ái', '溰'),
            ('ái', '嘊'), ('ái', '敱'), ('ái', '敳'), ('ái', '皚'), ('ái', '磑'), ('ái', '㱯'), ('ái', '䶣')]
    ai_3 = [('ǎi', '矮'), ('ǎi', '嗳'), ('ǎi', '蔼'), ('ǎi', '霭'), ('ǎi', '毐'), ('ǎi', '昹'), ('ǎi', '娾'), ('ǎi', '欸'),
            ('ǎi', '絠'), ('ǎi', '躷'), ('ǎi', '噯'), ('ǎi', '濭'), ('ǎi', '藹'), ('ǎi', '譪'), ('ǎi', '靄'), ('ǎi', '㢊'),
            ('ǎi', '㑸'), ('ǎi', '㗨'), ('ǎi', '䑂'), ('ǎi', '䨠')]
    ai_4 = [('ài', '爱'), ('ài', '艾'), ('ài', '碍'), ('ài', '暧'), ('ài', '隘'), ('ài', '嫒'), ('ài', '瑷'), ('ài', '伌'),
            ('ài', '欬'), ('ài', '砹'), ('ài', '硋'), ('ài', '堨'), ('ài', '焥'), ('ài', '嗌'), ('ài', '塧'), ('ài', '愛'),
            ('ài', '叆'), ('ài', '僾'), ('ài', '壒'), ('ài', '嬡'), ('ài', '懓'), ('ài', '薆'), ('ài', '鴱'), ('ài', '懝'),
            ('ài', '曖'), ('ài', '璦'), ('ài', '賹'), ('ài', '餲'), ('ài', '皧'), ('ài', '瞹'), ('ài', '馤'), ('ài', '礙'),
            ('ài', '譺'), ('ài', '鑀'), ('ài', '鱫'), ('ài', '靉'), ('ài', '㘷'), ('ài', '㝶'), ('ài', '㤅'), ('ài', '㕌'),
            ('ài', '㗒'), ('ài', '䀳'), ('ài', '䬵'), ('ài', '䅬'), ('ài', '䔽'), ('ài', '䝽'), ('ài', '㿄')]
    an_1 = [('ān', '安'), ('ān', '广'), ('ān', '厂'), ('ān', '庵'), ('ān', '鞍'), ('ān', '谙'), ('ān', '氨'), ('ān', '鹌'),
            ('ān', '侒'), ('ān', '峖'), ('ān', '桉'), ('ān', '偣'), ('ān', '菴'), ('ān', '啽'), ('ān', '媕'), ('ān', '萻'),
            ('ān', '葊'), ('ān', '痷'), ('ān', '腤'), ('ān', '裺'), ('ān', '蓭'), ('ān', '誝'), ('ān', '鞌'), ('ān', '盦'),
            ('ān', '諳'), ('ān', '馣'), ('ān', '鮟'), ('ān', '盫'), ('ān', '鵪'), ('ān', '韽'), ('ān', '鶕'), ('ān', '䨄')]
    an_2 = [('án', '玵'), ('án', '雸'), ('án', '儑'), ('án', '䜙')]
    an_3 = [('ǎn', '俺'), ('ǎn', '垵'), ('ǎn', '唵'), ('ǎn', '埯'), ('ǎn', '铵'), ('ǎn', '揞'), ('ǎn', '罯'), ('ǎn', '銨'),
            ('ǎn', '㽢'), ('ǎn', '䁆'), ('ǎn', '䅖'), ('ǎn', '㜝')]
    an_4 = [('àn', '暗'), ('àn', '案'), ('àn', '按'), ('àn', '岸'), ('àn', '黯'), ('àn', '闇'), ('àn', '胺'), ('àn', '厈'),
            ('àn', '屵'), ('àn', '屽'), ('àn', '犴'), ('àn', '咹'), ('àn', '洝'), ('àn', '荌'), ('àn', '豻'), ('àn', '堓'),
            ('àn', '隌'), ('àn', '晻'), ('àn', '貋'), ('àn', '錌'), ('àn', '㸩'), ('àn', '㟁'), ('àn', '䅁'), ('àn', '䎏'),
            ('àn', '䎨'), ('àn', '㱘'), ('àn', '䬓'), ('àn', '䮗'), ('àn', '䯥')]
    ang_1 = [('āng', '肮'), ('āng', '骯')]
    ang_2 = [('áng', '仰'), ('áng', '昂'), ('áng', '卬'), ('áng', '岇'), ('áng', '昻'), ('áng', '䒢'), ('áng', '䀚'),
             ('áng', '㭿'), ('áng', '䩕'), ('áng', '䭹'), ('áng', '䭺')]
    ang_3 = [('ǎng', '䍩'), ('ǎng', '䬓')]
    ang_4 = [('àng', '盎'), ('àng', '枊'), ('àng', '醠'), ('àng', '㼜'), ('àng', '㦹')]
    ao_1 = [('āo', '熬'), ('āo', '凹'), ('āo', '泑'), ('āo', '柪'), ('āo', '眑'), ('āo', '梎'), ('āo', '軪'), ('āo', '熝'),
            ('āo', '爊')]
    ao_2 = [('áo', '敖'), ('áo', '翱'), ('áo', '鳌'), ('áo', '遨'), ('áo', '嗷'), ('áo', '骜'), ('áo', '鏖'), ('áo', '厫'),
            ('áo', '隞'), ('áo', '嗸'), ('áo', '嶅'), ('áo', '廒'), ('áo', '滶'), ('áo', '獓'), ('áo', '蔜'), ('áo', '摮'),
            ('áo', '獒'), ('áo', '璈'), ('áo', '磝'), ('áo', '墽'), ('áo', '聱'), ('áo', '螯'), ('áo', '翶'), ('áo', '謷'),
            ('áo', '謸'), ('áo', '翺'), ('áo', '鏕'), ('áo', '鰲'), ('áo', '鷔'), ('áo', '鼇'), ('áo', '㿰'), ('áo', '㟼'),
            ('áo', '㠂'), ('áo', '䐿'), ('áo', '䦋'), ('áo', '䚫'), ('áo', '䥝'), ('áo', '䵅')]
    ao_3 = [('ǎo', '袄'), ('ǎo', '拗'), ('ǎo', '媪'), ('ǎo', '艹'), ('ǎo', '抝'), ('ǎo', '芺'), ('ǎo', '郩'), ('ǎo', '镺'),
            ('ǎo', '媼'), ('ǎo', '襖'), ('ǎo', '㑃'), ('ǎo', '㤇'), ('ǎo', '䞝'), ('ǎo', '䯠'), ('ǎo', '䴈')]
    ao_4 = [('ào', '奥'), ('ào', '傲'), ('ào', '澳'), ('ào', '懊'), ('ào', '坳'), ('ào', '岙'), ('ào', '扷'), ('ào', '垇'),
            ('ào', '岰'), ('ào', '奡'), ('ào', '奧'), ('ào', '嫯'), ('ào', '慠'), ('ào', '澚'), ('ào', '隩'), ('ào', '墺'),
            ('ào', '嶴'), ('ào', '擙'), ('ào', '鏊'), ('ào', '驁'), ('ào', '㕭'), ('ào', '㘬'), ('ào', '㘭'), ('ào', '㜜'),
            ('ào', '㥿'), ('ào', '㜩'), ('ào', '㠗'), ('ào', '䁱'), ('ào', '䜒'), ('ào', '䫨'), ('ào', '䮯')]
    ba_1 = [('bā', '吧'), ('bā', '八'), ('bā', '巴'), ('bā', '叭'), ('bā', '疤'), ('bā', '芭'), ('bā', '扒'), ('bā', '笆'),
            ('bā', '粑'), ('bā', '丷'), ('bā', '仈'), ('bā', '朳'), ('bā', '玐'), ('bā', '夿'), ('bā', '岜'), ('bā', '扷'),
            ('bā', '峇'), ('bā', '柭'), ('bā', '哱'), ('bā', '哵'), ('bā', '捌'), ('bā', '羓'), ('bā', '蚆'), ('bā', '釟'),
            ('bā', '豝'), ('bā', '鲃'), ('bā', '魞'), ('bā', '䰾')]
    ba_2 = [('bá', '拔'), ('bá', '跋'), ('bá', '叐'), ('bá', '犮'), ('bá', '抜'), ('bá', '妭'), ('bá', '茇'), ('bá', '炦'),
            ('bá', '癹'), ('bá', '胈'), ('bá', '菝'), ('bá', '詙'), ('bá', '軷'), ('bá', '颰'), ('bá', '魃'), ('bá', '鼥'),
            ('bá', '㧊'), ('bá', '㔜'), ('bá', '䟦'), ('bá', '䳁'), ('bá', '䳊')]
    ba_3 = [('bǎ', '把'), ('bǎ', '靶'), ('bǎ', '钯'), ('bǎ', '鈀'), ('bǎ', '㞎')]
    ba_4 = [('bà', '罢'), ('bà', '伯'), ('bà', '爸'), ('bà', '霸'), ('bà', '坝'), ('bà', '耙'), ('bà', '灞'), ('bà', '弝'),
            ('bà', '皅'), ('bà', '垻'), ('bà', '跁'), ('bà', '鲅'), ('bà', '鲌'), ('bà', '罷'), ('bà', '鮁'), ('bà', '鮊'),
            ('bà', '覇'), ('bà', '矲'), ('bà', '壩'), ('bà', '欛'), ('bà', '㖠'), ('bà', '䇑'), ('bà', '䩗'), ('bà', '䎬'),
            ('bà', '䩻'), ('bà', '䱝'), ('bà', '䆉'), ('bà', '䎱'), ('bà', '㶚'), ('bà', '䥯'), ('bà', '䃻')]
    ba_5 = []
    bai_1 = [('bāi', '掰'), ('bāi', '擘'), ('bāi', '挀'), ('bāi', '㓦')]
    bai_2 = [('bái', '白'), ('bái', '㼟'), ('bái', '㿟'), ('bái', '䳆')]
    bai_3 = [('bǎi', '百'), ('bǎi', '伯'), ('bǎi', '摆'), ('bǎi', '柏'), ('bǎi', '佰'), ('bǎi', '栢'), ('bǎi', '瓸'),
             ('bǎi', '捭'), ('bǎi', '竡'), ('bǎi', '粨'), ('bǎi', '絔'), ('bǎi', '擺'), ('bǎi', '襬'), ('bǎi', '㼣'),
             ('bǎi', '㧳'), ('bǎi', '㗗'), ('bǎi', '䙓')]
    bai_4 = [('bài', '拜'), ('bài', '败'), ('bài', '呗'), ('bài', '稗'), ('bài', '庍'), ('bài', '拝'), ('bài', '唄'),
             ('bài', '敗'), ('bài', '猈'), ('bài', '粺'), ('bài', '薭'), ('bài', '贁'), ('bài', '韛'), ('bài', '䒔'),
             ('bài', '䢙'), ('bài', '㗑'), ('bài', '㠔'), ('bài', '䴽'), ('bài', '䥯')]
    ban_1 = [('bān', '般'), ('bān', '班'), ('bān', '搬'), ('bān', '斑'), ('bān', '颁'), ('bān', '扳'), ('bān', '瘢'),
             ('bān', '攽'), ('bān', '朌'), ('bān', '肦'), ('bān', '斒'), ('bān', '頒'), ('bān', '搫'), ('bān', '鳻'),
             ('bān', '螌'), ('bān', '褩'), ('bān', '癍'), ('bān', '辬')]
    ban_2 = [('bǎn', '板'), ('bǎn', '版'), ('bǎn', '坂'), ('bǎn', '阪'), ('bǎn', '岅'), ('bǎn', '昄'), ('bǎn', '瓪'),
             ('bǎn', '钣'), ('bǎn', '粄'), ('bǎn', '舨'), ('bǎn', '鈑'), ('bǎn', '蝂'), ('bǎn', '魬'), ('bǎn', '闆'),
             ('bǎn', '㸞'), ('bǎn', '䉽'), ('bǎn', '䬳'), ('bǎn', '㩯')]
    ban_3 = [('bàn', '半'), ('bàn', '办'), ('bàn', '伴'), ('bàn', '扮'), ('bàn', '瓣'), ('bàn', '绊'), ('bàn', '拌'),
             ('bàn', '坢'), ('bàn', '姅'), ('bàn', '怑'), ('bàn', '柈'), ('bàn', '秚'), ('bàn', '湴'), ('bàn', '絆'),
             ('bàn', '跘'), ('bàn', '鉡'), ('bàn', '靽'), ('bàn', '辦'), ('bàn', '㚘'), ('bàn', '㪵'), ('bàn', '䕰')]
    bang_1 = [('bāng', '帮'), ('bāng', '邦'), ('bāng', '彭'), ('bāng', '梆'), ('bāng', '浜'), ('bāng', '垹'), ('bāng', '捠'),
              ('bāng', '邫'), ('bāng', '幇'), ('bāng', '幚'), ('bāng', '縍'), ('bāng', '幫'), ('bāng', '鞤')]
    bang_2 = [('bǎng', '膀'), ('bǎng', '绑'), ('bǎng', '榜'), ('bǎng', '綁'), ('bǎng', '牓'), ('bǎng', '髈'), ('bǎng', '㔙'),
              ('bǎng', '㮄'), ('bǎng', '䟺')]
    bang_3 = [('bàng', '旁'), ('bàng', '棒'), ('bàng', '傍'), ('bàng', '镑'), ('bàng', '谤'), ('bàng', '磅'), ('bàng', '蚌'),
              ('bàng', '玤'), ('bàng', '挷'), ('bàng', '蚄'), ('bàng', '棓'), ('bàng', '硥'), ('bàng', '塝'), ('bàng', '搒'),
              ('bàng', '稖'), ('bàng', '蒡'), ('bàng', '蛖'), ('bàng', '蜯'), ('bàng', '艕'), ('bàng', '謗'), ('bàng', '鎊'),
              ('bàng', '㭋'), ('bàng', '䂜'), ('bàng', '䖫'), ('bàng', '䧛'), ('bàng', '㾦'), ('bàng', '㯁'), ('bàng', '䎧'),
              ('bàng', '䰷')]
    bao_1 = [('bāo', '包'), ('bāo', '炮'), ('bāo', '胞'), ('bāo', '剥'), ('bāo', '苞'), ('bāo', '褒'), ('bāo', '勹'),
             ('bāo', '佨'), ('bāo', '孢'), ('bāo', '枹'), ('bāo', '剝'), ('bāo', '笣'), ('bāo', '煲'), ('bāo', '龅'),
             ('bāo', '裦'), ('bāo', '蕔'), ('bāo', '襃'), ('bāo', '闁'), ('bāo', '齙')]
    bao_2 = [('báo', '薄'), ('báo', '雹'), ('báo', '窇'), ('báo', '䨌'), ('báo', '䪨'), ('báo', '䨔'), ('báo', '䈏'),
             ('báo', '㵡'), ('báo', '㿺'), ('báo', '䥤')]
    bao_3 = [('bǎo', '保'), ('bǎo', '宝'), ('bǎo', '堡'), ('bǎo', '饱'), ('bǎo', '鸨'), ('bǎo', '葆'), ('bǎo', '褓'),
             ('bǎo', '怉'), ('bǎo', '宲'), ('bǎo', '珤'), ('bǎo', '堢'), ('bǎo', '媬'), ('bǎo', '寚'), ('bǎo', '飹'),
             ('bǎo', '飽'), ('bǎo', '駂'), ('bǎo', '鳵'), ('bǎo', '緥'), ('bǎo', '鴇'), ('bǎo', '賲'), ('bǎo', '藵'),
             ('bǎo', '寳'), ('bǎo', '寶'), ('bǎo', '靌'), ('bǎo', '㲏'), ('bǎo', '㙅'), ('bǎo', '㻄'), ('bǎo', '䎂'),
             ('bǎo', '䳈'), ('bǎo', '䭋'), ('bǎo', '䳰'), ('bǎo', '䴐')]
    bao_4 = [('bào', '报'), ('bào', '抱'), ('bào', '爆'), ('bào', '鲍'), ('bào', '暴'), ('bào', '豹'), ('bào', '瀑'),
             ('bào', '曝'), ('bào', '刨'), ('bào', '勽'), ('bào', '犳'), ('bào', '趵'), ('bào', '铇'), ('bào', '菢'),
             ('bào', '蚫'), ('bào', '袌'), ('bào', '報'), ('bào', '鉋'), ('bào', '骲'), ('bào', '髱'), ('bào', '虣'),
             ('bào', '鮑'), ('bào', '儤'), ('bào', '曓'), ('bào', '嚗'), ('bào', '犦'), ('bào', '忁'), ('bào', '鑤'),
             ('bào', '㲒'), ('bào', '㫧'), ('bào', '㙸'), ('bào', '䤖')]
    bei_1 = [('bēi', '杯'), ('bēi', '悲'), ('bēi', '卑'), ('bēi', '碑'), ('bēi', '陂'), ('bēi', '柸'), ('bēi', '盃'),
             ('bēi', '庳'), ('bēi', '桮'), ('bēi', '揹'), ('bēi', '椑'), ('bēi', '鹎'), ('bēi', '箄'), ('bēi', '諀'),
             ('bēi', '鞞'), ('bēi', '藣'), ('bēi', '鵯'), ('bēi', '㽡'), ('bēi', '䎬'), ('bēi', '䎱'), ('bēi', '䥯')]
    bei_2 = [('běi', '北'), ('běi', '鉳'), ('běi', '㤳')]
    bei_3 = [('bèi', '被'), ('bèi', '备'), ('bèi', '背'), ('bèi', '辈'), ('bèi', '贝'), ('bèi', '倍'), ('bèi', '勃'),
             ('bèi', '蓓'), ('bèi', '狈'), ('bèi', '惫'), ('bèi', '悖'), ('bèi', '孛'), ('bèi', '焙'), ('bèi', '碚'),
             ('bèi', '褙'), ('bèi', '貝'), ('bèi', '邶'), ('bèi', '昁'), ('bèi', '杮'), ('bèi', '牬'), ('bèi', '苝'),
             ('bèi', '郥'), ('bèi', '钡'), ('bèi', '俻'), ('bèi', '狽'), ('bèi', '偝'), ('bèi', '偹'), ('bèi', '梖'),
             ('bèi', '珼'), ('bèi', '鄁'), ('bèi', '備'), ('bèi', '僃'), ('bèi', '棑'), ('bèi', '棓'), ('bèi', '琲'),
             ('bèi', '軰'), ('bèi', '愂'), ('bèi', '禙'), ('bèi', '蛽'), ('bèi', '犕'), ('bèi', '誖'), ('bèi', '鞁'),
             ('bèi', '骳'), ('bèi', '輩'), ('bèi', '鋇'), ('bèi', '憊'), ('bèi', '糒'), ('bèi', '鞴'), ('bèi', '鐾'),
             ('bèi', '㓈'), ('bèi', '㸬'), ('bèi', '㛝'), ('bèi', '㔨'), ('bèi', '㸽'), ('bèi', '㼎'), ('bèi', '㣁'),
             ('bèi', '㻗'), ('bèi', '䁅'), ('bèi', '䔒'), ('bèi', '㸢'), ('bèi', '㾱'), ('bèi', '䟺'), ('bèi', '䋳'),
             ('bèi', '䩀'), ('bèi', '䰽'), ('bèi', '㷶'), ('bèi', '䠙'), ('bèi', '㰆'), ('bèi', '䡶'), ('bèi', '㶔')]
    bei_4 = [('bei', '臂'), ('bei', '呗'), ('bei', '唄')]
    ben_1 = [('bēn', '奔'), ('bēn', '贲'), ('bēn', '泍'), ('bēn', '栟'), ('bēn', '喯'), ('bēn', '犇'), ('bēn', '賁'),
             ('bēn', '锛'), ('bēn', '漰'), ('bēn', '錛'), ('bēn', '蟦')]
    ben_2 = [('běn', '本'), ('běn', '苯'), ('běn', '夲'), ('běn', '奙'), ('běn', '畚'), ('běn', '翉'), ('běn', '楍'),
             ('běn', '㡷'), ('běn', '㮺')]
    ben_3 = [('bèn', '笨'), ('bèn', '夯'), ('bèn', '坋'), ('bèn', '坌'), ('bèn', '炃'), ('bèn', '倴'), ('bèn', '捹'),
             ('bèn', '桳'), ('bèn', '渀'), ('bèn', '逩'), ('bèn', '撪'), ('bèn', '㤓'), ('bèn', '㨧'), ('bèn', '䬱'),
             ('bèn', '㱵')]
    beng_1 = [('bēng', '崩'), ('bēng', '绷'), ('bēng', '伻'), ('bēng', '祊'), ('bēng', '奟'), ('bēng', '絣'), ('bēng', '閍'),
              ('bēng', '嗙'), ('bēng', '嵭'), ('bēng', '痭'), ('bēng', '嘣'), ('bēng', '綳'), ('bēng', '繃')]
    beng_2 = [('béng', '甭'), ('béng', '甮')]
    beng_3 = [('běng', '埄'), ('běng', '埲'), ('běng', '菶'), ('běng', '琣'), ('běng', '琫'), ('běng', '鞛'), ('běng', '㑟'),
              ('běng', '䙀'), ('běng', '䋽'), ('běng', '䩬'), ('běng', '䭰'), ('běng', '䳞')]
    beng_4 = [('bèng', '迸'), ('bèng', '蹦'), ('bèng', '蚌'), ('bèng', '泵'), ('bèng', '堋'), ('bèng', '逬'), ('bèng', '揼'),
              ('bèng', '跰'), ('bèng', '塴'), ('bèng', '甏'), ('bèng', '镚'), ('bèng', '鏰'), ('bèng', '㛝'), ('bèng', '㷯'),
              ('bèng', '㱶'), ('bèng', '䨻')]
    bi_1 = [('bī', '逼'), ('bī', '皀'), ('bī', '屄'), ('bī', '偪'), ('bī', '毴'), ('bī', '楅'), ('bī', '榌'), ('bī', '豍'),
            ('bī', '螕'), ('bī', '鵖'), ('bī', '鲾'), ('bī', '鎞'), ('bī', '鰏'), ('bī', '㗊'), ('bī', '㡙'), ('bī', '䫾')]
    bi_2 = [('bí', '鼻'), ('bí', '荸'), ('bí', '嬶'), ('bí', '㮰'), ('bí', '䨆'), ('bí', '䵄')]
    bi_3 = [('bǐ', '比'), ('bǐ', '笔'), ('bǐ', '彼'), ('bǐ', '鄙'), ('bǐ', '匕'), ('bǐ', '俾'), ('bǐ', '纰'), ('bǐ', '夶'),
            ('bǐ', '朼'), ('bǐ', '佊'), ('bǐ', '吡'), ('bǐ', '妣'), ('bǐ', '沘'), ('bǐ', '疕'), ('bǐ', '毞'), ('bǐ', '肶'),
            ('bǐ', '柀'), ('bǐ', '秕'), ('bǐ', '娝'), ('bǐ', '粃'), ('bǐ', '紕'), ('bǐ', '舭'), ('bǐ', '啚'), ('bǐ', '崥'),
            ('bǐ', '筆'), ('bǐ', '聛'), ('bǐ', '貏'), ('bǐ', '㠲'), ('bǐ', '㚰'), ('bǐ', '䃾'), ('bǐ', '䏢'), ('bǐ', '䣥'),
            ('bǐ', '䘡'), ('bǐ', '㪏'), ('bǐ', '䇷'), ('bǐ', '䠋'), ('bǐ', '㻶')]
    bi_4 = [('bì', '必'), ('bì', '佛'), ('bì', '毕'), ('bì', '秘'), ('bì', '避'), ('bì', '闭'), ('bì', '壁'), ('bì', '臂'),
            ('bì', '碧'), ('bì', '币'), ('bì', '婢'), ('bì', '拂'), ('bì', '辟'), ('bì', '陛'), ('bì', '蔽'), ('bì', '敝'),
            ('bì', '毙'), ('bì', '弊'), ('bì', '璧'), ('bì', '庇'), ('bì', '弼'), ('bì', '泌'), ('bì', '贲'), ('bì', '痹'),
            ('bì', '裨'), ('bì', '畀'), ('bì', '哔'), ('bì', '愎'), ('bì', '睥'), ('bì', '嬖'), ('bì', '篦'), ('bì', '薜'),
            ('bì', '髀'), ('bì', '闬'), ('bì', '佖'), ('bì', '坒'), ('bì', '芘'), ('bì', '诐'), ('bì', '邲'), ('bì', '咇'),
            ('bì', '妼'), ('bì', '怭'), ('bì', '怶'), ('bì', '畁'), ('bì', '苾'), ('bì', '柲'), ('bì', '毖'), ('bì', '珌'),
            ('bì', '畐'), ('bì', '疪'), ('bì', '祕'), ('bì', '胇'), ('bì', '荜'), ('bì', '狴'), ('bì', '畢'), ('bì', '笓'),
            ('bì', '粊'), ('bì', '袐'), ('bì', '铋'), ('bì', '旇'), ('bì', '梐'), ('bì', '紴'), ('bì', '翍'), ('bì', '萆'),
            ('bì', '萞'), ('bì', '閇'), ('bì', '閈'), ('bì', '閉'), ('bì', '堛'), ('bì', '弻'), ('bì', '愊'), ('bì', '湢'),
            ('bì', '皕'), ('bì', '禆'), ('bì', '筚'), ('bì', '詖'), ('bì', '貱'), ('bì', '賁'), ('bì', '赑'), ('bì', '嗶'),
            ('bì', '彃'), ('bì', '滗'), ('bì', '滭'), ('bì', '煏'), ('bì', '痺'), ('bì', '睤'), ('bì', '腷'), ('bì', '蓖'),
            ('bì', '蓽'), ('bì', '蜌'), ('bì', '跸'), ('bì', '鉍'), ('bì', '閟'), ('bì', '飶'), ('bì', '幣'), ('bì', '熚'),
            ('bì', '獙'), ('bì', '稫'), ('bì', '箅'), ('bì', '箆'), ('bì', '綼'), ('bì', '鄪'), ('bì', '馝'), ('bì', '幤'),
            ('bì', '潷'), ('bì', '獘'), ('bì', '罼'), ('bì', '襅'), ('bì', '駜'), ('bì', '髲'), ('bì', '廦'), ('bì', '篳'),
            ('bì', '縪'), ('bì', '觱'), ('bì', '鮅'), ('bì', '斃'), ('bì', '濞'), ('bì', '蹕'), ('bì', '鞞'), ('bì', '奰'),
            ('bì', '鄨'), ('bì', '鏎'), ('bì', '饆'), ('bì', '繴'), ('bì', '襞'), ('bì', '襣'), ('bì', '鞸'), ('bì', '韠'),
            ('bì', '魓'), ('bì', '躃'), ('bì', '躄'), ('bì', '驆'), ('bì', '鶝'), ('bì', '朇'), ('bì', '贔'), ('bì', '鐴'),
            ('bì', '鷝'), ('bì', '鷩'), ('bì', '鼊'), ('bì', '㕭'), ('bì', '㘩'), ('bì', '㘠'), ('bì', '㚕'), ('bì', '㢰'),
            ('bì', '㧙'), ('bì', '㡀'), ('bì', '㢶'), ('bì', '㿫'), ('bì', '㙄'), ('bì', '㢸'), ('bì', '䀣'), ('bì', '䄶'),
            ('bì', '䉾'), ('bì', '䋔'), ('bì', '䎵'), ('bì', '䏶'), ('bì', '䖩'), ('bì', '䧗'), ('bì', '㓖'), ('bì', '㗉'),
            ('bì', '㮄'), ('bì', '㳼'), ('bì', '㹃'), ('bì', '䟤'), ('bì', '䁅'), ('bì', '㪤'), ('bì', '㮿'), ('bì', '㻫'),
            ('bì', '䦘'), ('bì', '䩛'), ('bì', '䪐'), ('bì', '㯇'), ('bì', '䫁'), ('bì', '㵥'), ('bì', '㷶'), ('bì', '䯗'),
            ('bì', '㱸'), ('bì', '㵨'), ('bì', '䕗'), ('bì', '䟆'), ('bì', '䁹'), ('bì', '䊧'), ('bì', '䌟'), ('bì', '䬛'),
            ('bì', '䭮'), ('bì', '䮡')]
    bian_1 = [('biān', '边'), ('biān', '编'), ('biān', '鞭'), ('biān', '蝙'), ('biān', '砭'), ('biān', '笾'), ('biān', '辺'),
              ('biān', '炞'), ('biān', '猵'), ('biān', '萹'), ('biān', '煸'), ('biān', '牑'), ('biān', '甂'), ('biān', '箯'),
              ('biān', '糄'), ('biān', '編'), ('biān', '臱'), ('biān', '鞕'), ('biān', '獱'), ('biān', '邉'), ('biān', '鍽'),
              ('biān', '鳊'), ('biān', '邊'), ('biān', '鯾'), ('biān', '鯿'), ('biān', '籓'), ('biān', '籩')]
    bian_2 = [('biǎn', '扁'), ('biǎn', '贬'), ('biǎn', '匾'), ('biǎn', '褊'), ('biǎn', '疺'), ('biǎn', '窆'), ('biǎn', '貶'),
              ('biǎn', '惼'), ('biǎn', '揙'), ('biǎn', '碥'), ('biǎn', '稨'), ('biǎn', '鴘'), ('biǎn', '藊'), ('biǎn', '覵'),
              ('biǎn', '鶣'), ('biǎn', '㦚'), ('biǎn', '䁵')]
    bian_3 = [('biàn', '便'), ('biàn', '变'), ('biàn', '遍'), ('biàn', '辩'), ('biàn', '辨'), ('biàn', '辫'), ('biàn', '卞'),
              ('biàn', '弁'), ('biàn', '汴'), ('biàn', '釆'), ('biàn', '忭'), ('biàn', '抃'), ('biàn', '汳'), ('biàn', '苄'),
              ('biàn', '峅'), ('biàn', '玣'), ('biàn', '変'), ('biàn', '昪'), ('biàn', '覍'), ('biàn', '徧'), ('biàn', '缏'),
              ('biàn', '閞'), ('biàn', '辡'), ('biàn', '緶'), ('biàn', '艑'), ('biàn', '諚'), ('biàn', '辧'), ('biàn', '辮'),
              ('biàn', '辯'), ('biàn', '變'), ('biàn', '㳎'), ('biàn', '䒪'), ('biàn', '㭓'), ('biàn', '㺹'), ('biàn', '㝸'),
              ('biàn', '㣐'), ('biàn', '㴜'), ('biàn', '䛒'), ('biàn', '㲢'), ('biàn', '㻞'), ('biàn', '䪻'), ('biàn', '䡢'),
              ('biàn', '㵷'), ('biàn', '䉸')]
    biao_1 = [('biāo', '标'), ('biāo', '镖'), ('biāo', '彪'), ('biāo', '飙'), ('biāo', '骠'), ('biāo', '膘'), ('biāo', '镳'),
              ('biāo', '杓'), ('biāo', '飚'), ('biāo', '灬'), ('biāo', '飑'), ('biāo', '骉'), ('biāo', '髟'), ('biāo', '淲'),
              ('biāo', '猋'), ('biāo', '脿'), ('biāo', '颩'), ('biāo', '僄'), ('biāo', '墂'), ('biāo', '幖'), ('biāo', '滮'),
              ('biāo', '蔈'), ('biāo', '颮'), ('biāo', '標'), ('biāo', '熛'), ('biāo', '膔'), ('biāo', '麃'), ('biāo', '瘭'),
              ('biāo', '磦'), ('biāo', '儦'), ('biāo', '檦'), ('biāo', '篻'), ('biāo', '颷'), ('biāo', '瀌'), ('biāo', '藨'),
              ('biāo', '謤'), ('biāo', '爂'), ('biāo', '臕'), ('biāo', '贆'), ('biāo', '鏢'), ('biāo', '穮'), ('biāo', '飆'),
              ('biāo', '飇'), ('biāo', '飈'), ('biāo', '飊'), ('biāo', '鑣'), ('biāo', '驫')]
    biao_2 = [('biáo', '嫑')]
    biao_3 = [('biǎo', '表'), ('biǎo', '婊'), ('biǎo', '裱'), ('biǎo', '諘'), ('biǎo', '褾'), ('biǎo', '錶'), ('biǎo', '㟽'),
              ('biǎo', '䔸'), ('biǎo', '㠒'), ('biǎo', '㯱'), ('biǎo', '㯹')]
    biao_4 = [('biào', '俵'), ('biào', '摽'), ('biào', '鳔'), ('biào', '㧼'), ('biào', '䞄')]
    bie_1 = [('biē', '憋'), ('biē', '瘪'), ('biē', '鳖'), ('biē', '柭'), ('biē', '蟞'), ('biē', '癟'), ('biē', '鱉'),
             ('biē', '鼈'), ('biē', '虌'), ('biē', '龞')]
    bie_2 = [('bié', '别'), ('bié', '蹩'), ('bié', '別'), ('bié', '柲'), ('bié', '莂'), ('bié', '蛂'), ('bié', '徶'),
             ('bié', '襒'), ('bié', '㓖'), ('bié', '㲢'), ('bié', '䇷'), ('bié', '䭱'), ('bié', '㱸'), ('bié', '䠥')]
    bie_3 = [('biě', '㿜')]
    bie_4 = [('biè', '彆'), ('biè', '䏟'), ('biè', '㢼'), ('biè', '䋢'), ('biè', '䉲')]
    bin_1 = [('bīn', '份'), ('bīn', '频'), ('bīn', '宾'), ('bīn', '滨'), ('bīn', '斌'), ('bīn', '彬'), ('bīn', '槟'),
             ('bīn', '缤'), ('bīn', '濒'), ('bīn', '傧'), ('bīn', '邠'), ('bīn', '玢'), ('bīn', '汃'), ('bīn', '砏'),
             ('bīn', '梹'), ('bīn', '椕'), ('bīn', '瑸'), ('bīn', '豩'), ('bīn', '賓'), ('bīn', '賔'), ('bīn', '镔'),
             ('bīn', '儐'), ('bīn', '頻'), ('bīn', '濱'), ('bīn', '濵'), ('bīn', '虨'), ('bīn', '豳'), ('bīn', '檳'),
             ('bīn', '璸'), ('bīn', '瀕'), ('bīn', '霦'), ('bīn', '繽'), ('bīn', '鑌'), ('bīn', '顮')]
    bin_2 = [('bǐn', '䳁')]
    bin_3 = [('bìn', '鬓'), ('bìn', '殡'), ('bìn', '摈'), ('bìn', '膑'), ('bìn', '髩'), ('bìn', '擯'), ('bìn', '鬂'),
             ('bìn', '殯'), ('bìn', '臏'), ('bìn', '髌'), ('bìn', '髕'), ('bìn', '鬢'), ('bìn', '䐔'), ('bìn', '䚔')]
    bing_1 = [('bīng', '兵'), ('bīng', '冰'), ('bīng', '槟'), ('bīng', '冫'), ('bīng', '仌'), ('bīng', '仒'), ('bīng', '氷'),
              ('bīng', '栟'), ('bīng', '掤'), ('bīng', '梹'), ('bīng', '蛃'), ('bīng', '絣'), ('bīng', '鋲'), ('bīng', '檳')]
    bing_2 = [('bǐng', '屏'), ('bǐng', '柄'), ('bǐng', '禀'), ('bǐng', '饼'), ('bǐng', '秉'), ('bǐng', '丙'), ('bǐng', '炳'),
              ('bǐng', '邴'), ('bǐng', '陃'), ('bǐng', '怲'), ('bǐng', '抦'), ('bǐng', '苪'), ('bǐng', '昞'), ('bǐng', '昺'),
              ('bǐng', '眪'), ('bǐng', '偋'), ('bǐng', '屛'), ('bǐng', '寎'), ('bǐng', '棅'), ('bǐng', '琕'), ('bǐng', '稟'),
              ('bǐng', '鈵'), ('bǐng', '鉼'), ('bǐng', '鞆'), ('bǐng', '餅'), ('bǐng', '餠'), ('bǐng', '鞞'), ('bǐng', '鞸'),
              ('bǐng', '䓑'), ('bǐng', '㨀'), ('bǐng', '䋑'), ('bǐng', '䴵')]
    bing_3 = [('bìng', '并'), ('bìng', '病'), ('bìng', '摒'), ('bìng', '幷'), ('bìng', '並'), ('bìng', '併'), ('bìng', '枋'),
              ('bìng', '垪'), ('bìng', '庰'), ('bìng', '倂'), ('bìng', '栤'), ('bìng', '窉'), ('bìng', '竝'), ('bìng', '傡'),
              ('bìng', '誁'), ('bìng', '鮩'), ('bìng', '靐'), ('bìng', '㓈'), ('bìng', '䈂'), ('bìng', '䗒')]
    bo_1 = [('bō', '波'), ('bō', '播'), ('bō', '拨'), ('bō', '玻'), ('bō', '剥'), ('bō', '钵'), ('bō', '饽'), ('bō', '菠'),
            ('bō', '磻'), ('bō', '癶'), ('bō', '癷'), ('bō', '剝'), ('bō', '哱'), ('bō', '盋'), ('bō', '砵'), ('bō', '趵'),
            ('bō', '紴'), ('bō', '缽'), ('bō', '袰'), ('bō', '溊'), ('bō', '碆'), ('bō', '鉢'), ('bō', '僠'), ('bō', '嶓'),
            ('bō', '撥'), ('bō', '餑'), ('bō', '礡'), ('bō', '蹳'), ('bō', '皪'), ('bō', '驋'), ('bō', '鱍')]
    bo_2 = [('bó', '伯'), ('bó', '佛'), ('bó', '博'), ('bó', '薄'), ('bó', '柏'), ('bó', '勃'), ('bó', '脖'), ('bó', '泊'),
            ('bó', '驳'), ('bó', '搏'), ('bó', '膊'), ('bó', '簿'), ('bó', '帛'), ('bó', '舶'), ('bó', '钹'), ('bó', '渤'),
            ('bó', '箔'), ('bó', '亳'), ('bó', '踣'), ('bó', '礴'), ('bó', '仢'), ('bó', '彴'), ('bó', '肑'), ('bó', '狛'),
            ('bó', '瓝'), ('bó', '苩'), ('bó', '侼'), ('bó', '柭'), ('bó', '胉'), ('bó', '郣'), ('bó', '挬'), ('bó', '浡'),
            ('bó', '瓟'), ('bó', '秡'), ('bó', '袯'), ('bó', '铂'), ('bó', '桲'), ('bó', '淿'), ('bó', '萡'), ('bó', '袹'),
            ('bó', '殕'), ('bó', '葧'), ('bó', '鹁'), ('bó', '愽'), ('bó', '猼'), ('bó', '鈸'), ('bó', '鉑'), ('bó', '馎'),
            ('bó', '鲌'), ('bó', '僰'), ('bó', '榑'), ('bó', '煿'), ('bó', '牔'), ('bó', '艊'), ('bó', '誖'), ('bó', '馛'),
            ('bó', '駁'), ('bó', '鋍'), ('bó', '镈'), ('bó', '壆'), ('bó', '馞'), ('bó', '駮'), ('bó', '鮊'), ('bó', '穛'),
            ('bó', '襏'), ('bó', '謈'), ('bó', '嚗'), ('bó', '懪'), ('bó', '簙'), ('bó', '鎛'), ('bó', '餺'), ('bó', '鵓'),
            ('bó', '糪'), ('bó', '髆'), ('bó', '髉'), ('bó', '欂'), ('bó', '襮'), ('bó', '鑮'), ('bó', '䢌'), ('bó', '㝿'),
            ('bó', '㑟'), ('bó', '㔜'), ('bó', '㱟'), ('bó', '㟑'), ('bó', '㼣'), ('bó', '䊿'), ('bó', '䍨'), ('bó', '㧳'),
            ('bó', '㪍'), ('bó', '㶿'), ('bó', '㹀'), ('bó', '㼎'), ('bó', '䟛'), ('bó', '䟦'), ('bó', '䨌'), ('bó', '䬪'),
            ('bó', '㗘'), ('bó', '㬍'), ('bó', '㴾'), ('bó', '䭯'), ('bó', '䯋'), ('bó', '䙏'), ('bó', '䞳'), ('bó', '䢪'),
            ('bó', '䮀'), ('bó', '䮂'), ('bó', '䰷'), ('bó', '䍸'), ('bó', '䗚'), ('bó', '䪬'), ('bó', '䫊'), ('bó', '䳁'),
            ('bó', '㙸'), ('bó', '䒄'), ('bó', '䟆'), ('bó', '㩧'), ('bó', '㬧'), ('bó', '㩭'), ('bó', '䑈'), ('bó', '䂍'),
            ('bó', '䰊'), ('bó', '䥬'), ('bó', '䵗'), ('bó', '䪇'), ('bó', '䶈'), ('bó', '䭦'), ('bó', '䵄')]
    bo_3 = [('bǒ', '跛'), ('bǒ', '蚾')]
    bo_4 = [('bò', '簸'), ('bò', '擘'), ('bò', '孹'), ('bò', '擗'), ('bò', '檗'), ('bò', '檘'), ('bò', '譒'), ('bò', '蘗'),
            ('bò', '㖕')]
    bo_5 = [('bo', '卜'), ('bo', '啵'), ('bo', '蔔'), ('bo', '噃')]
    bu_1 = [('bū', '逋'), ('bū', '峬'), ('bū', '庯'), ('bū', '钸'), ('bū', '晡'), ('bū', '鈽'), ('bū', '誧'), ('bū', '餔'),
            ('bū', '錻'), ('bū', '鯆'), ('bū', '鵏')]
    bu_2 = [('bú', '鳪'), ('bú', '轐'), ('bú', '醭')]
    bu_3 = [('bǔ', '补'), ('bǔ', '堡'), ('bǔ', '捕'), ('bǔ', '卜'), ('bǔ', '哺'), ('bǔ', '卟'), ('bǔ', '捬'), ('bǔ', '補'),
            ('bǔ', '鸔'), ('bǔ', '㨐'), ('bǔ', '䀯'), ('bǔ', '㙛'), ('bǔ', '䋠'), ('bǔ', '䪔'), ('bǔ', '䒈'), ('bǔ', '䪁')]
    bu_4 = [('bù', '不'), ('bù', '部'), ('bù', '步'), ('bù', '布'), ('bù', '怖'), ('bù', '簿'), ('bù', '埔'), ('bù', '埠'),
            ('bù', '佈'), ('bù', '吥'), ('bù', '咘'), ('bù', '抪'), ('bù', '歨'), ('bù', '歩'), ('bù', '柨'), ('bù', '钚'),
            ('bù', '勏'), ('bù', '埗'), ('bù', '悑'), ('bù', '捗'), ('bù', '荹'), ('bù', '婄'), ('bù', '瓿'), ('bù', '鈈'),
            ('bù', '廍'), ('bù', '蔀'), ('bù', '箁'), ('bù', '踄'), ('bù', '郶'), ('bù', '篰'), ('bù', '餢'), ('bù', '㘵'),
            ('bù', '㚴'), ('bù', '㳍'), ('bù', '㻉'), ('bù', '㾟'), ('bù', '䏽'), ('bù', '䊇'), ('bù', '䑰'), ('bù', '䍌'),
            ('bù', '䝵'), ('bù', '䬏'), ('bù', '䳝'), ('bù', '䴺'), ('bù', '䴝')]
    ca_1 = [('cā', '擦'), ('cā', '拆'), ('cā', '嚓'), ('cā', '攃')]
    ca_2 = [('cǎ', '礤'), ('cǎ', '礸')]
    ca_3 = [('cà', '遪'), ('cà', '囃'), ('cà', '䟃'), ('cà', '䵽')]
    cai_1 = [('cāi', '猜'), ('cāi', '偲'), ('cāi', '䞗')]
    cai_2 = [('cái', '才'), ('cái', '财'), ('cái', '材'), ('cái', '裁'), ('cái', '扐'), ('cái', '財'), ('cái', '纔'),
             ('cái', '㒲'), ('cái', '䴭')]
    cai_3 = [('cǎi', '采'), ('cǎi', '彩'), ('cǎi', '踩'), ('cǎi', '睬'), ('cǎi', '毝'), ('cǎi', '倸'), ('cǎi', '啋'),
             ('cǎi', '埰'), ('cǎi', '婇'), ('cǎi', '寀'), ('cǎi', '採'), ('cǎi', '棌'), ('cǎi', '跴'), ('cǎi', '綵'),
             ('cǎi', '䣋'), ('cǎi', '㥒'), ('cǎi', '䌽'), ('cǎi', '䐆'), ('cǎi', '䴺')]
    cai_4 = [('cài', '菜'), ('cài', '蔡'), ('cài', '縩'), ('cài', '䰂'), ('cài', '䌨')]
    can_1 = [('cān', '参'), ('cān', '餐'), ('cān', '骖'), ('cān', '參'), ('cān', '叄'), ('cān', '飡'), ('cān', '叅'),
             ('cān', '喰'), ('cān', '湌'), ('cān', '傪'), ('cān', '嬠'), ('cān', '爘'), ('cān', '驂'), ('cān', '囋'),
             ('cān', '㕘')]
    can_2 = [('cán', '残'), ('cán', '惭'), ('cán', '蚕'), ('cán', '殘'), ('cán', '慚'), ('cán', '摲'), ('cán', '蝅'),
             ('cán', '慙'), ('cán', '蠶'), ('cán', '蠺'), ('cán', '㱚'), ('cán', '㥇'), ('cán', '䏼'), ('cán', '䙁'),
             ('cán', '㺑'), ('cán', '䑶'), ('cán', '䝳'), ('cán', '䣟'), ('cán', '㨻'), ('cán', '䗝'), ('cán', '䗞'),
             ('cán', '䍼'), ('cán', '䫮'), ('cán', '䘉'), ('cán', '䳻')]
    can_3 = [('cǎn', '惨'), ('cǎn', '朁'), ('cǎn', '慘'), ('cǎn', '憯'), ('cǎn', '穇'), ('cǎn', '篸'), ('cǎn', '黪'),
             ('cǎn', '黲'), ('cǎn', '䅟'), ('cǎn', '䬫'), ('cǎn', '㜗'), ('cǎn', '㿊'), ('cǎn', '㦧'), ('cǎn', '㘔')]
    can_4 = [('càn', '灿'), ('càn', '掺'), ('càn', '粲'), ('càn', '璨'), ('càn', '孱'), ('càn', '嘇'), ('càn', '摻'),
             ('càn', '儏'), ('càn', '澯'), ('càn', '薒'), ('càn', '燦'), ('càn', '謲'), ('càn', '鏒'), ('càn', '㛑'),
             ('càn', '㻮'), ('càn', '㣓'), ('càn', '㽩'), ('càn', '䛹')]
    cang_1 = [('cāng', '苍'), ('cāng', '仓'), ('cāng', '舱'), ('cāng', '沧'), ('cāng', '伧'), ('cāng', '仺'), ('cāng', '玱'),
              ('cāng', '鸧'), ('cāng', '倉'), ('cāng', '傖'), ('cāng', '凔'), ('cāng', '嵢'), ('cāng', '滄'), ('cāng', '獊'),
              ('cāng', '蒼'), ('cāng', '瑲'), ('cāng', '濸'), ('cāng', '篬'), ('cāng', '艙'), ('cāng', '螥'), ('cāng', '鶬')]
    cang_2 = [('cáng', '藏'), ('cáng', '臧'), ('cáng', '匨'), ('cáng', '欌'), ('cáng', '鑶'), ('cáng', '㵴'), ('cáng', '㶓')]
    cang_3 = [('càng', '賶'), ('càng', '䢢'), ('càng', '䅮')]
    cao_1 = [('cāo', '操'), ('cāo', '糙'), ('cāo', '撡'), ('cāo', '㿷'), ('cāo', '䎭')]
    cao_2 = [('cáo', '曹'), ('cáo', '槽'), ('cáo', '嘈'), ('cáo', '漕'), ('cáo', '曺'), ('cáo', '傮'), ('cáo', '嶆'),
             ('cáo', '慒'), ('cáo', '蓸'), ('cáo', '褿'), ('cáo', '艚'), ('cáo', '螬'), ('cáo', '鏪'), ('cáo', '㜖'),
             ('cáo', '䄚'), ('cáo', '䐬'), ('cáo', '㯥'), ('cáo', '䏆')]
    cao_3 = [('cǎo', '草'), ('cǎo', '屮'), ('cǎo', '艸'), ('cǎo', '愺'), ('cǎo', '慅'), ('cǎo', '懆'), ('cǎo', '騲'),
             ('cǎo', '䒑')]
    cao_4 = [('cào', '肏'), ('cào', '鄵'), ('cào', '襙'), ('cào', '鼜'), ('cào', '㽩')]
    ce_1 = [('cè', '策'), ('cè', '测'), ('cè', '侧'), ('cè', '册'), ('cè', '栅'), ('cè', '厕'), ('cè', '恻'), ('cè', '夨'),
            ('cè', '冊'), ('cè', '拺'), ('cè', '荝'), ('cè', '敇'), ('cè', '畟'), ('cè', '側'), ('cè', '厠'), ('cè', '笧'),
            ('cè', '粣'), ('cè', '萗'), ('cè', '廁'), ('cè', '惻'), ('cè', '測'), ('cè', '萴'), ('cè', '筞'), ('cè', '筴'),
            ('cè', '蓛'), ('cè', '箣'), ('cè', '憡'), ('cè', '簎'), ('cè', '䇲'), ('cè', '䊂'), ('cè', '㨲'), ('cè', '㥽'),
            ('cè', '㩍'), ('cè', '䈟'), ('cè', '䔴'), ('cè', '䜺')]
    cen_1 = [('cēn', '参'), ('cēn', '參'), ('cēn', '叄'), ('cēn', '叅'), ('cēn', '嵾'), ('cēn', '穇'), ('cēn', '篸')]
    cen_2 = [('cén', '岑'), ('cén', '涔'), ('cén', '汵'), ('cén', '埁'), ('cén', '笒'), ('cén', '㞥'), ('cén', '䨙'),
             ('cén', '䯔'), ('cén', '㻸'), ('cén', '䤁'), ('cén', '䫈'), ('cén', '䃡'), ('cén', '䅾'), ('cén', '䲋')]
    ceng_1 = [('cēng', '噌')]
    ceng_2 = [('céng', '曾'), ('céng', '层'), ('céng', '曽'), ('céng', '層'), ('céng', '嶒'), ('céng', '橧'), ('céng', '竲'),
              ('céng', '驓'), ('céng', '㬝'), ('céng', '䁬'), ('céng', '䉕')]
    ceng_3 = [('cèng', '蹭'), ('cèng', '㣒')]
    cha_1 = [('chā', '插'), ('chā', '叉'), ('chā', '喳'), ('chā', '嚓'), ('chā', '杈'), ('chā', '扠'), ('chā', '扱'),
             ('chā', '芆'), ('chā', '臿'), ('chā', '挿'), ('chā', '偛'), ('chā', '嗏'), ('chā', '揷'), ('chā', '馇'),
             ('chā', '銟'), ('chā', '锸'), ('chā', '艖'), ('chā', '疀'), ('chā', '鍤'), ('chā', '鎈'), ('chā', '餷'),
             ('chā', '䑡'), ('chā', '㛼')]
    cha_2 = [('chá', '查'), ('chá', '察'), ('chá', '茶'), ('chá', '搽'), ('chá', '碴'), ('chá', '茬'), ('chá', '苴'),
             ('chá', '楂'), ('chá', '槎'), ('chá', '秅'), ('chá', '垞'), ('chá', '査'), ('chá', '捈'), ('chá', '梌'),
             ('chá', '嵖'), ('chá', '猹'), ('chá', '靫'), ('chá', '詧'), ('chá', '摖'), ('chá', '檫'), ('chá', '㪯'),
             ('chá', '㫅'), ('chá', '㢉'), ('chá', '䆛'), ('chá', '㢒'), ('chá', '䁟'), ('chá', '䤩'), ('chá', '䲦'),
             ('chá', '䑘'), ('chá', '䕓'), ('chá', '䶪')]
    cha_3 = [('chǎ', '蹅'), ('chǎ', '镲'), ('chǎ', '鑔'), ('chǎ', '䰈')]
    cha_4 = [('chà', '差'), ('chà', '刹'), ('chà', '诧'), ('chà', '岔'), ('chà', '姹'), ('chà', '仛'), ('chà', '奼'),
             ('chà', '汊'), ('chà', '侘'), ('chà', '衩'), ('chà', '剎'), ('chà', '紁'), ('chà', '詫'), ('chà', '㣾'),
             ('chà', '㤞'), ('chà', '䒲'), ('chà', '䟕'), ('chà', '䓭'), ('chà', '㛳'), ('chà', '㢎'), ('chà', '䡨'),
             ('chà', '䊬')]
    chai_1 = [('chāi', '差'), ('chāi', '拆'), ('chāi', '钗'), ('chāi', '芆'), ('chāi', '肞'), ('chāi', '釵'), ('chāi', '㼮')]
    chai_2 = [('chái', '柴'), ('chái', '豺'), ('chái', '侪'), ('chái', '犲'), ('chái', '祡'), ('chái', '喍'), ('chái', '儕'),
              ('chái', '㑪'), ('chái', '䓱'), ('chái', '㾹'), ('chái', '䡨')]
    chai_3 = [('chǎi', '茝')]
    chai_4 = [('chài', '虿'), ('chài', '袃'), ('chài', '訍'), ('chài', '瘥'), ('chài', '蠆'), ('chài', '囆'), ('chài', '㳗'),
              ('chài', '䘍')]
    chan_1 = [('chān', '搀'), ('chān', '掺'), ('chān', '觇'), ('chān', '辿'), ('chān', '梴'), ('chān', '覘'), ('chān', '裧'),
              ('chān', '摻'), ('chān', '緂'), ('chān', '鋓'), ('chān', '幨'), ('chān', '襜'), ('chān', '攙'), ('chān', '㚲')]
    chan_2 = [('chán', '单'), ('chán', '缠'), ('chán', '禅'), ('chán', '蝉'), ('chán', '崭'), ('chán', '婵'), ('chán', '谗'),
              ('chán', '馋'), ('chán', '潺'), ('chán', '蟾'), ('chán', '孱'), ('chán', '廛'), ('chán', '苂'), ('chán', '單'),
              ('chán', '棎'), ('chán', '湹'), ('chán', '煘'), ('chán', '僝'), ('chán', '嶃'), ('chán', '嶄'), ('chán', '獑'),
              ('chán', '誗'), ('chán', '鋋'), ('chán', '儃'), ('chán', '嬋'), ('chán', '潹'), ('chán', '緾'), ('chán', '澶'),
              ('chán', '磛'), ('chán', '禪'), ('chán', '毚'), ('chán', '螹'), ('chán', '蟐'), ('chán', '鄽'), ('chán', '瀍'),
              ('chán', '蟬'), ('chán', '儳'), ('chán', '劖'), ('chán', '繵'), ('chán', '酁'), ('chán', '嚵'), ('chán', '壥'),
              ('chán', '巉'), ('chán', '瀺'), ('chán', '欃'), ('chán', '纏'), ('chán', '纒'), ('chán', '躔'), ('chán', '镵'),
              ('chán', '艬'), ('chán', '讒'), ('chán', '鑱'), ('chán', '饞'), ('chán', '㶣'), ('chán', '㢆'), ('chán', '䣑'),
              ('chán', '䤫'), ('chán', '䡪'), ('chán', '㙻'), ('chán', '䡲'), ('chán', '䧯'), ('chán', '㺥'), ('chán', '㸥'),
              ('chán', '䜛'), ('chán', '䂁'), ('chán', '䳻')]
    chan_3 = [('chǎn', '产'), ('chǎn', '阐'), ('chǎn', '铲'), ('chǎn', '谄'), ('chǎn', '刬'), ('chǎn', '旵'), ('chǎn', '丳'),
              ('chǎn', '斺'), ('chǎn', '浐'), ('chǎn', '剗'), ('chǎn', '啴'), ('chǎn', '產'), ('chǎn', '産'), ('chǎn', '蒇'),
              ('chǎn', '剷'), ('chǎn', '嵼'), ('chǎn', '摌'), ('chǎn', '滻'), ('chǎn', '嘽'), ('chǎn', '幝'), ('chǎn', '蕆'),
              ('chǎn', '諂'), ('chǎn', '閳'), ('chǎn', '骣'), ('chǎn', '燀'), ('chǎn', '簅'), ('chǎn', '冁'), ('chǎn', '繟'),
              ('chǎn', '醦'), ('chǎn', '譂'), ('chǎn', '鏟'), ('chǎn', '闡'), ('chǎn', '囅'), ('chǎn', '灛'), ('chǎn', '讇'),
              ('chǎn', '㢟'), ('chǎn', '㹽'), ('chǎn', '㦃'), ('chǎn', '㯆'), ('chǎn', '㹌'), ('chǎn', '䐮'), ('chǎn', '䥀'),
              ('chǎn', '䩶'), ('chǎn', '䴼'), ('chǎn', '䑎'), ('chǎn', '䊲'), ('chǎn', '䵐'), ('chǎn', '䤘')]
    chan_4 = [('chàn', '颤'), ('chàn', '忏'), ('chàn', '硟'), ('chàn', '摲'), ('chàn', '懴'), ('chàn', '懺'), ('chàn', '羼'),
              ('chàn', '韂'), ('chàn', '顫'), ('chàn', '䀡'), ('chàn', '㬄'), ('chàn', '㵌'), ('chàn', '㙴'), ('chàn', '䴺'),
              ('chàn', '䠨'), ('chàn', '䪜'), ('chàn', '䱿')]
    chang_1 = [('chāng', '昌'), ('chāng', '娼'), ('chāng', '猖'), ('chāng', '伥'), ('chāng', '阊'), ('chāng', '倀'),
               ('chāng', '淐'), ('chāng', '菖'), ('chāng', '椙'), ('chāng', '琩'), ('chāng', '裮'), ('chāng', '锠'),
               ('chāng', '錩'), ('chāng', '閶'), ('chāng', '鲳'), ('chāng', '闛'), ('chāng', '鯧'), ('chāng', '鼚')]
    chang_2 = [('cháng', '长'), ('cháng', '常'), ('cháng', '场'), ('cháng', '尝'), ('cháng', '倘'), ('cháng', '肠'),
               ('cháng', '偿'), ('cháng', '裳'), ('cháng', '嫦'), ('cháng', '苌'), ('cháng', '徜'), ('cháng', '仧'),
               ('cháng', '仩'), ('cháng', '兏'), ('cháng', '镸'), ('cháng', '長'), ('cháng', '瓺'), ('cháng', '萇'),
               ('cháng', '場'), ('cháng', '甞'), ('cháng', '腸'), ('cháng', '嘗'), ('cháng', '塲'), ('cháng', '瑺'),
               ('cháng', '膓'), ('cháng', '償'), ('cháng', '嚐'), ('cháng', '鲿'), ('cháng', '鱨'), ('cháng', '㙊'),
               ('cháng', '䗅'), ('cháng', '䯴'), ('cháng', '㦂'), ('cháng', '䠆'), ('cháng', '补')]
    chang_3 = [('chǎng', '厂'), ('chǎng', '敞'), ('chǎng', '淌'), ('chǎng', '昶'), ('chǎng', '氅'), ('chǎng', '惝'),
               ('chǎng', '僘'), ('chǎng', '厰'), ('chǎng', '廠'), ('chǎng', '鋹'), ('chǎng', '㫤'), ('chǎng', '䠀'),
               ('chǎng', '䕋')]
    chang_4 = [('chàng', '唱'), ('chàng', '畅'), ('chàng', '倡'), ('chàng', '怅'), ('chàng', '玚'), ('chàng', '鬯'),
               ('chàng', '悵'), ('chàng', '焻'), ('chàng', '瑒'), ('chàng', '暢'), ('chàng', '畼'), ('chàng', '誯'),
               ('chàng', '韔'), ('chàng', '䩨')]
    chao_1 = [('chāo', '超'), ('chāo', '抄'), ('chāo', '钞'), ('chāo', '绰'), ('chāo', '弨'), ('chāo', '剿'), ('chāo', '焯'),
              ('chāo', '怊'), ('chāo', '欩'), ('chāo', '訬'), ('chāo', '鈔'), ('chāo', '勦'), ('chāo', '摷'), ('chāo', '綽'),
              ('chāo', '劋'), ('chāo', '窼')]
    chao_2 = [('cháo', '朝'), ('cháo', '潮'), ('cháo', '嘲'), ('cháo', '晁'), ('cháo', '巢'), ('cháo', '牊'), ('cháo', '巣'),
              ('cháo', '鄛'), ('cháo', '鼌'), ('cháo', '漅'), ('cháo', '樔'), ('cháo', '窲'), ('cháo', '罺'), ('cháo', '鼂'),
              ('cháo', '轈'), ('cháo', '謿'), ('cháo', '䄻'), ('cháo', '䬤'), ('cháo', '䰫')]
    chao_3 = [('chǎo', '吵'), ('chǎo', '炒'), ('chǎo', '眧'), ('chǎo', '粆'), ('chǎo', '焣'), ('chǎo', '煼'), ('chǎo', '槱'),
              ('chǎo', '麨'), ('chǎo', '巐'), ('chǎo', '㶤'), ('chǎo', '䏚'), ('chǎo', '㷅'), ('chǎo', '䎐')]
    chao_4 = [('chào', '仦'), ('chào', '仯'), ('chào', '耖'), ('chào', '觘')]
    che_1 = [('chē', '车'), ('chē', '伡'), ('chē', '車'), ('chē', '俥'), ('chē', '砗'), ('chē', '唓'), ('chē', '莗'),
             ('chē', '硨'), ('chē', '蛼')]
    che_2 = []
    che_3 = [('chě', '尺'), ('chě', '扯'), ('chě', '偖'), ('chě', '撦'), ('chě', '奲'), ('chě', '㨋'), ('chě', '䞣'),
             ('chě', '㵔'), ('chě', '䋲'), ('chě', '䰩')]
    che_4 = [('chè', '彻'), ('chè', '撤'), ('chè', '掣'), ('chè', '澈'), ('chè', '屮'), ('chè', '呫'), ('chè', '坼'),
             ('chè', '迠'), ('chè', '烢'), ('chè', '烲'), ('chè', '焎'), ('chè', '聅'), ('chè', '揊'), ('chè', '硩'),
             ('chè', '頙'), ('chè', '徹'), ('chè', '摰'), ('chè', '勶'), ('chè', '瞮'), ('chè', '爡'), ('chè', '㿭'),
             ('chè', '㔭'), ('chè', '㥉'), ('chè', '㾝'), ('chè', '䑲'), ('chè', '䛸'), ('chè', '䧪'), ('chè', '㬚'),
             ('chè', '㯙'), ('chè', '䁤'), ('chè', '䚢'), ('chè', '䤁'), ('chè', '䨁'), ('chè', '䒆'), ('chè', '㒤'),
             ('chè', '㱌'), ('chè', '䜠')]
    chen_1 = [('chēn', '琛'), ('chēn', '嗔'), ('chēn', '郴'), ('chēn', '肜'), ('chēn', '抻'), ('chēn', '捵'), ('chēn', '棽'),
              ('chēn', '綝'), ('chēn', '瘨'), ('chēn', '瞋'), ('chēn', '諃'), ('chēn', '賝'), ('chēn', '謓'), ('chēn', '䑣'),
              ('chēn', '䐜')]
    chen_2 = [('chén', '沉'), ('chén', '陈'), ('chén', '臣'), ('chén', '沈'), ('chén', '尘'), ('chén', '晨'), ('chén', '辰'),
              ('chén', '忱'), ('chén', '宸'), ('chén', '谌'), ('chén', '迧'), ('chén', '茞'), ('chén', '栕'), ('chén', '莀'),
              ('chén', '莐'), ('chén', '陳'), ('chén', '敐'), ('chén', '桭'), ('chén', '梣'), ('chén', '訦'), ('chén', '軙'),
              ('chén', '愖'), ('chén', '跈'), ('chén', '鈂'), ('chén', '煁'), ('chén', '蔯'), ('chén', '塵'), ('chén', '敶'),
              ('chén', '樄'), ('chén', '瘎'), ('chén', '霃'), ('chén', '螴'), ('chén', '諶'), ('chén', '薼'), ('chén', '麎'),
              ('chén', '曟'), ('chén', '鷐'), ('chén', '㕴'), ('chén', '䒞'), ('chén', '䢻'), ('chén', '㽸'), ('chén', '䣅'),
              ('chén', '㫳'), ('chén', '㲀'), ('chén', '䆣'), ('chén', '䟢'), ('chén', '䤟'), ('chén', '㴴'), ('chén', '䚘'),
              ('chén', '䢅'), ('chén', '䢈'), ('chén', '䜟')]
    chen_3 = [('chěn', '碜'), ('chěn', '趻'), ('chěn', '硶'), ('chěn', '墋'), ('chěn', '夦'), ('chěn', '磣'), ('chěn', '踸'),
              ('chěn', '鍖'), ('chěn', '贂'), ('chěn', '醦'), ('chěn', '䗞'), ('chěn', '䫖')]
    chen_4 = [('chèn', '称'), ('chèn', '趁'), ('chèn', '衬'), ('chèn', '谶'), ('chèn', '爯'), ('chèn', '疢'), ('chèn', '龀'),
              ('chèn', '偁'), ('chèn', '趂'), ('chèn', '榇'), ('chèn', '稱'), ('chèn', '齓'), ('chèn', '齔'), ('chèn', '儭'),
              ('chèn', '嚫'), ('chèn', '穪'), ('chèn', '櫬'), ('chèn', '襯'), ('chèn', '讖'), ('chèn', '㧱'), ('chèn', '䞋')]
    chen_5 = [('chen', '伧'), ('chen', '傖')]
    cheng_1 = [('chēng', '称'), ('chēng', '抢'), ('chēng', '净'), ('chēng', '撑'), ('chēng', '铛'), ('chēng', '瞠'),
               ('chēng', '阷'), ('chēng', '泟'), ('chēng', '柽'), ('chēng', '爯'), ('chēng', '凈'), ('chēng', '棦'),
               ('chēng', '浾'), ('chēng', '琤'), ('chēng', '偁'), ('chēng', '淨'), ('chēng', '碀'), ('chēng', '蛏'),
               ('chēng', '晿'), ('chēng', '牚'), ('chēng', '搶'), ('chēng', '赪'), ('chēng', '僜'), ('chēng', '憆'),
               ('chēng', '摚'), ('chēng', '稱'), ('chēng', '靗'), ('chēng', '撐'), ('chēng', '緽'), ('chēng', '橕'),
               ('chēng', '橖'), ('chēng', '赬'), ('chēng', '頳'), ('chēng', '檉'), ('chēng', '竀'), ('chēng', '罉'),
               ('chēng', '鎗'), ('chēng', '矃'), ('chēng', '穪'), ('chēng', '蟶'), ('chēng', '鏿'), ('chēng', '鐣'),
               ('chēng', '饓'), ('chēng', '鐺'), ('chēng', '䞓')]
    cheng_2 = [('chéng', '成'), ('chéng', '程'), ('chéng', '城'), ('chéng', '承'), ('chéng', '盛'), ('chéng', '诚'),
               ('chéng', '乘'), ('chéng', '呈'), ('chéng', '丞'), ('chéng', '澄'), ('chéng', '惩'), ('chéng', '橙'),
               ('chéng', '晟'), ('chéng', '氶'), ('chéng', '朾'), ('chéng', '枨'), ('chéng', '郕'), ('chéng', '乗'),
               ('chéng', '埩'), ('chéng', '娍'), ('chéng', '宬'), ('chéng', '峸'), ('chéng', '洆'), ('chéng', '荿'),
               ('chéng', '埕'), ('chéng', '挰'), ('chéng', '浧'), ('chéng', '珹'), ('chéng', '掁'), ('chéng', '珵'),
               ('chéng', '窚'), ('chéng', '脭'), ('chéng', '铖'), ('chéng', '堘'), ('chéng', '揨'), ('chéng', '棖'),
               ('chéng', '椉'), ('chéng', '筬'), ('chéng', '絾'), ('chéng', '裎'), ('chéng', '塍'), ('chéng', '塖'),
               ('chéng', '溗'), ('chéng', '誠'), ('chéng', '畻'), ('chéng', '酲'), ('chéng', '鋮'), ('chéng', '憕'),
               ('chéng', '撜'), ('chéng', '澂'), ('chéng', '檙'), ('chéng', '鯎'), ('chéng', '瀓'), ('chéng', '懲'),
               ('chéng', '騬'), ('chéng', '䆑'), ('chéng', '㞼'), ('chéng', '㼩'), ('chéng', '䧕'), ('chéng', '㨃'),
               ('chéng', '䄇'), ('chéng', '㲂'), ('chéng', '䇸'), ('chéng', '䚘'), ('chéng', '䁎'), ('chéng', '䗊'),
               ('chéng', '䔲'), ('chéng', '䫆'), ('chéng', '䆵'), ('chéng', '䆸'), ('chéng', '䮪')]
    cheng_3 = [('chěng', '逞'), ('chěng', '骋'), ('chěng', '侱'), ('chěng', '徎'), ('chěng', '悜'), ('chěng', '庱'),
               ('chěng', '睈'), ('chěng', '騁'), ('chěng', '䩶')]
    cheng_4 = [('chèng', '秤'), ('chèng', '㐼'), ('chèng', '䀕'), ('chèng', '䁤')]
    chi_1 = [('chī', '吃'), ('chī', '痴'), ('chī', '嗤'), ('chī', '哧'), ('chī', '蚩'), ('chī', '鸱'), ('chī', '笞'),
             ('chī', '螭'), ('chī', '魑'), ('chī', '妛'), ('chī', '彨'), ('chī', '胵'), ('chī', '瓻'), ('chī', '眵'),
             ('chī', '粚'), ('chī', '喫'), ('chī', '訵'), ('chī', '媸'), ('chī', '摛'), ('chī', '絺'), ('chī', '樆'),
             ('chī', '噄'), ('chī', '殦'), ('chī', '瞝'), ('chī', '誺'), ('chī', '噭'), ('chī', '鴟'), ('chī', '鵄'),
             ('chī', '癡'), ('chī', '齝'), ('chī', '攡'), ('chī', '彲'), ('chī', '黐'), ('chī', '䇪'), ('chī', '䧝'),
             ('chī', '㺈'), ('chī', '䄜'), ('chī', '䬜')]
    chi_2 = [('chí', '持'), ('chí', '迟'), ('chí', '池'), ('chí', '驰'), ('chí', '匙'), ('chí', '弛'), ('chí', '墀'),
             ('chí', '柢'), ('chí', '坻'), ('chí', '沶'), ('chí', '狋'), ('chí', '茌'), ('chí', '迡'), ('chí', '竾'),
             ('chí', '荎'), ('chí', '俿'), ('chí', '歭'), ('chí', '耛'), ('chí', '菭'), ('chí', '蚳'), ('chí', '赿'),
             ('chí', '筂'), ('chí', '貾'), ('chí', '遅'), ('chí', '跢'), ('chí', '遟'), ('chí', '馳'), ('chí', '箈'),
             ('chí', '箎'), ('chí', '徲'), ('chí', '漦'), ('chí', '踟'), ('chí', '遲'), ('chí', '篪'), ('chí', '謘'),
             ('chí', '鍉'), ('chí', '邌'), ('chí', '鶗'), ('chí', '鶙'), ('chí', '㞴'), ('chí', '㢮'), ('chí', '㔭'),
             ('chí', '䛂'), ('chí', '䪧'), ('chí', '㙜'), ('chí', '㮛'), ('chí', '䐤'), ('chí', '㓾'), ('chí', '䔟'),
             ('chí', '䈕'), ('chí', '䮈'), ('chí', '䙙'), ('chí', '䞾'), ('chí', '䶔'), ('chí', '䜄'), ('chí', '䶵')]
    chi_3 = [('chǐ', '尺'), ('chǐ', '齿'), ('chǐ', '耻'), ('chǐ', '侈'), ('chǐ', '呎'), ('chǐ', '叺'), ('chǐ', '伬'),
             ('chǐ', '扡'), ('chǐ', '肔'), ('chǐ', '卶'), ('chǐ', '垑'), ('chǐ', '奓'), ('chǐ', '拸'), ('chǐ', '胣'),
             ('chǐ', '恥'), ('chǐ', '蚇'), ('chǐ', '袳'), ('chǐ', '豉'), ('chǐ', '欼'), ('chǐ', '歯'), ('chǐ', '袲'),
             ('chǐ', '裭'), ('chǐ', '誃'), ('chǐ', '鉹'), ('chǐ', '褫'), ('chǐ', '齒'), ('chǐ', '㟂'), ('chǐ', '㳏'),
             ('chǐ', '㢁'), ('chǐ', '㶴'), ('chǐ', '䊼'), ('chǐ', '㢋'), ('chǐ', '䑛'), ('chǐ', '䜵'), ('chǐ', '㱀'),
             ('chǐ', '䜻'), ('chǐ', '䰩'), ('chǐ', '㘜')]
    chi_4 = [('chì', '赤'), ('chì', '斥'), ('chì', '叱'), ('chì', '翅'), ('chì', '炽'), ('chì', '敕'), ('chì', '啻'),
             ('chì', '饬'), ('chì', '彳'), ('chì', '佁'), ('chì', '杘'), ('chì', '灻'), ('chì', '侙'), ('chì', '抶'),
             ('chì', '勅'), ('chì', '恜'), ('chì', '柅'), ('chì', '勑'), ('chì', '捇'), ('chì', '眙'), ('chì', '翄'),
             ('chì', '烾'), ('chì', '湁'), ('chì', '飭'), ('chì', '傺'), ('chì', '痸'), ('chì', '腟'), ('chì', '鉓'),
             ('chì', '雴'), ('chì', '憏'), ('chì', '瘈'), ('chì', '翤'), ('chì', '遫'), ('chì', '銐'), ('chì', '慗'),
             ('chì', '慸'), ('chì', '瘛'), ('chì', '翨'), ('chì', '熾'), ('chì', '懘'), ('chì', '趩'), ('chì', '鶒'),
             ('chì', '鷘'), ('chì', '㞿'), ('chì', '㑜'), ('chì', '㡿'), ('chì', '㽚'), ('chì', '㥉'), ('chì', '㓼'),
             ('chì', '䇼'), ('chì', '㒆'), ('chì', '䟷'), ('chì', '䰡'), ('chì', '䤲'), ('chì', '㔑'), ('chì', '䠠'),
             ('chì', '䳵'), ('chì', '䮻')]
    chi_5 = [('chi', '麶')]
    chong_1 = [('chōng', '冲'), ('chōng', '充'), ('chōng', '涌'), ('chōng', '忡'), ('chōng', '憧'), ('chōng', '舂'),
               ('chōng', '沖'), ('chōng', '茺'), ('chōng', '浺'), ('chōng', '珫'), ('chōng', '翀'), ('chōng', '嘃'),
               ('chōng', '摏'), ('chōng', '徸'), ('chōng', '憃'), ('chōng', '衝'), ('chōng', '罿'), ('chōng', '艟'),
               ('chōng', '蹖'), ('chōng', '㳘'), ('chōng', '䡴')]
    chong_2 = [('chóng', '种'), ('chóng', '重'), ('chóng', '虫'), ('chóng', '崇'), ('chóng', '崈'), ('chóng', '痋'),
               ('chóng', '隀'), ('chóng', '漴'), ('chóng', '褈'), ('chóng', '緟'), ('chóng', '蝩'), ('chóng', '蟲'),
               ('chóng', '爞'), ('chóng', '䖝'), ('chóng', '㓽'), ('chóng', '㹐'), ('chóng', '䳯'), ('chóng', '䌬')]
    chong_3 = [('chǒng', '宠'), ('chǒng', '埫'), ('chǒng', '寵')]
    chong_4 = [('chòng', '铳'), ('chòng', '揰'), ('chòng', '銃'), ('chòng', '㧤'), ('chòng', '㓼')]
    chou_1 = [('chōu', '抽'), ('chōu', '瘳'), ('chōu', '牰'), ('chōu', '婤'), ('chōu', '掫'), ('chōu', '紬'), ('chōu', '搊'),
              ('chōu', '跾'), ('chōu', '篘'), ('chōu', '醔'), ('chōu', '犨'), ('chōu', '犫'), ('chōu', '䌷'), ('chōu', '䀺'),
              ('chōu', '㩅')]
    chou_2 = [('chóu', '仇'), ('chóu', '愁'), ('chóu', '筹'), ('chóu', '酬'), ('chóu', '绸'), ('chóu', '踌'), ('chóu', '畴'),
              ('chóu', '惆'), ('chóu', '稠'), ('chóu', '雠'), ('chóu', '俦'), ('chóu', '畤'), ('chóu', '怞'), ('chóu', '诪'),
              ('chóu', '帱'), ('chóu', '栦'), ('chóu', '梼'), ('chóu', '菗'), ('chóu', '椆'), ('chóu', '絒'), ('chóu', '皗'),
              ('chóu', '裯'), ('chóu', '詶'), ('chóu', '酧'), ('chóu', '綢'), ('chóu', '儔'), ('chóu', '雔'), ('chóu', '嚋'),
              ('chóu', '嬦'), ('chóu', '幬'), ('chóu', '懤'), ('chóu', '盩'), ('chóu', '薵'), ('chóu', '檮'), ('chóu', '燽'),
              ('chóu', '疇'), ('chóu', '籌'), ('chóu', '躊'), ('chóu', '醻'), ('chóu', '讎'), ('chóu', '讐'), ('chóu', '雦'),
              ('chóu', '㐜'), ('chóu', '㤽'), ('chóu', '䓓'), ('chóu', '㛶'), ('chóu', '䇺'), ('chóu', '㨶'), ('chóu', '㵞'),
              ('chóu', '㦞'), ('chóu', '㿧'), ('chóu', '䊭'), ('chóu', '䌧'), ('chóu', '䲖'), ('chóu', '㘜')]
    chou_3 = [('chǒu', '丑'), ('chǒu', '瞅'), ('chǒu', '丒'), ('chǒu', '吜'), ('chǒu', '杻'), ('chǒu', '杽'), ('chǒu', '偢'),
              ('chǒu', '醜'), ('chǒu', '矁'), ('chǒu', '魗'), ('chǒu', '䪮')]
    chou_4 = [('chòu', '臭'), ('chòu', '臰'), ('chòu', '遚'), ('chòu', '殠'), ('chòu', '䔏')]
    chou_5 = [('chou', '鮘')]
    chu_1 = [('chū', '出'), ('chū', '初'), ('chū', '樗'), ('chū', '岀'), ('chū', '榋'), ('chū', '摢'), ('chū', '摴'),
             ('chū', '貙'), ('chū', '櫖'), ('chū', '齣'), ('chū', '䢺'), ('chū', '㯉')]
    chu_2 = [('chú', '除'), ('chú', '助'), ('chú', '厨'), ('chú', '橱'), ('chú', '躇'), ('chú', '雏'), ('chú', '锄'),
             ('chú', '刍'), ('chú', '滁'), ('chú', '蜍'), ('chú', '蹰'), ('chú', '芻'), ('chú', '耝'), ('chú', '蒢'),
             ('chú', '豠'), ('chú', '媰'), ('chú', '耡'), ('chú', '蒭'), ('chú', '趎'), ('chú', '鉏'), ('chú', '犓'),
             ('chú', '廚'), ('chú', '篨'), ('chú', '鋤'), ('chú', '幮'), ('chú', '櫉'), ('chú', '藸'), ('chú', '蟵'),
             ('chú', '雛'), ('chú', '櫥'), ('chú', '鶵'), ('chú', '躕'), ('chú', '㼥'), ('chú', '䟞'), ('chú', '䎝'),
             ('chú', '㕏'), ('chú', '㗙'), ('chú', '䎤'), ('chú', '㕑'), ('chú', '㜗'), ('chú', '㡡'), ('chú', '䅳'),
             ('chú', '䠂'), ('chú', '㐥'), ('chú', '㶆'), ('chú', '䠧')]
    chu_3 = [('chǔ', '处'), ('chǔ', '楚'), ('chǔ', '础'), ('chǔ', '储'), ('chǔ', '褚'), ('chǔ', '杵'), ('chǔ', '楮'),
             ('chǔ', '禇'), ('chǔ', '椘'), ('chǔ', '處'), ('chǔ', '濋'), ('chǔ', '儲'), ('chǔ', '檚'), ('chǔ', '璴'),
             ('chǔ', '礎'), ('chǔ', '齭'), ('chǔ', '齼'), ('chǔ', '㹼'), ('chǔ', '䖏'), ('chǔ', '䙘'), ('chǔ', '䊰')]
    chu_4 = [('chù', '触'), ('chù', '畜'), ('chù', '矗'), ('chù', '搐'), ('chù', '黜'), ('chù', '怵'), ('chù', '绌'),
             ('chù', '亍'), ('chù', '処'), ('chù', '竌'), ('chù', '泏'), ('chù', '豖'), ('chù', '欪'), ('chù', '炪'),
             ('chù', '竐'), ('chù', '俶'), ('chù', '敊'), ('chù', '埱'), ('chù', '珿'), ('chù', '絀'), ('chù', '菆'),
             ('chù', '傗'), ('chù', '鄐'), ('chù', '慉'), ('chù', '滀'), ('chù', '閦'), ('chù', '儊'), ('chù', '嘼'),
             ('chù', '諔'), ('chù', '憷'), ('chù', '斶'), ('chù', '歜'), ('chù', '臅'), ('chù', '觸'), ('chù', '㔘'),
             ('chù', '䧁'), ('chù', '㤕'), ('chù', '㤘'), ('chù', '㙇'), ('chù', '䜴'), ('chù', '䦌'), ('chù', '䟣'),
             ('chù', '㗰'), ('chù', '䙕'), ('chù', '䮞'), ('chù', '㘜')]
    chu_5 = [('chu', '橻')]
    chua_1 = [('chuā', '欻'), ('chuā', '䵵')]
    chua_2 = []
    chua_3 = [('chuà', '䫄')]
    chuai_1 = [('chuāi', '搋')]
    chuai_2 = [('chuái', '膗'), ('chuái', '㪓')]
    chuai_3 = [('chuǎi', '揣'), ('chuǎi', '㪜')]
    chuai_4 = [('chuài', '啜'), ('chuài', '踹'), ('chuài', '欼'), ('chuài', '膪'), ('chuài', '䦷'), ('chuài', '㱀'),
               ('chuài', '䦟'), ('chuài', '䦤'), ('chuài', '䴝')]
    chuan_1 = [('chuān', '穿'), ('chuān', '川'), ('chuān', '巛'), ('chuān', '氚'), ('chuān', '瑏')]
    chuan_2 = [('chuán', '传'), ('chuán', '船'), ('chuán', '椽'), ('chuán', '舡'), ('chuán', '舩'), ('chuán', '剶'),
               ('chuán', '圌'), ('chuán', '遄'), ('chuán', '傳'), ('chuán', '椯'), ('chuán', '暷'), ('chuán', '篅'),
               ('chuán', '膞'), ('chuán', '輲'), ('chuán', '㼷'), ('chuán', '㯌'), ('chuán', '䁣')]
    chuan_3 = [('chuǎn', '喘'), ('chuǎn', '舛'), ('chuǎn', '荈'), ('chuǎn', '堾'), ('chuǎn', '歂'), ('chuǎn', '僢'),
               ('chuǎn', '踳'), ('chuǎn', '㱛')]
    chuan_4 = [('chuàn', '串'), ('chuàn', '钏'), ('chuàn', '汌'), ('chuàn', '玔'), ('chuàn', '釧'), ('chuàn', '猭'),
               ('chuàn', '賗'), ('chuàn', '鶨')]
    chuang_1 = [('chuāng', '窗'), ('chuāng', '疮'), ('chuāng', '刅'), ('chuāng', '窓'), ('chuāng', '牎'), ('chuāng', '摐'),
                ('chuāng', '牕'), ('chuāng', '瘡'), ('chuāng', '窻'), ('chuāng', '䚎')]
    chuang_2 = [('chuáng', '床'), ('chuáng', '幢'), ('chuáng', '牀'), ('chuáng', '喠'), ('chuáng', '噇'), ('chuáng', '朣'),
                ('chuáng', '橦'), ('chuáng', '㡖'), ('chuáng', '䃥'), ('chuáng', '䚒'), ('chuáng', '䡴'), ('chuáng', '䭚')]
    chuang_3 = [('chuǎng', '闯'), ('chuǎng', '傸'), ('chuǎng', '磢'), ('chuǎng', '闖'), ('chuǎng', '䇬'), ('chuǎng', '㵂'),
                ('chuǎng', '㼽')]
    chuang_4 = [('chuàng', '创'), ('chuàng', '怆'), ('chuàng', '刱'), ('chuàng', '剏'), ('chuàng', '剙'), ('chuàng', '創'),
                ('chuàng', '愴'), ('chuàng', '䎫')]
    chui_1 = [('chuī', '吹'), ('chuī', '炊'), ('chuī', '龡'), ('chuī', '䶴')]
    chui_2 = [('chuí', '垂'), ('chuí', '锤'), ('chuí', '捶'), ('chuí', '椎'), ('chuí', '槌'), ('chuí', '陲'), ('chuí', '棰'),
              ('chuí', '倕'), ('chuí', '埀'), ('chuí', '桘'), ('chuí', '菙'), ('chuí', '圌'), ('chuí', '搥'), ('chuí', '腄'),
              ('chuí', '硾'), ('chuí', '箠'), ('chuí', '錘'), ('chuí', '鎚'), ('chuí', '顀'), ('chuí', '㝽'), ('chuí', '䄲'),
              ('chuí', '㓃'), ('chuí', '㩾'), ('chuí', '㥨'), ('chuí', '䍋'), ('chuí', '䳠')]
    chui_3 = [('chuǐ', '䞼')]
    chui_4 = [('chuì', '惙'), ('chuì', '䕓')]
    chun_1 = [('chūn', '春'), ('chūn', '椿'), ('chūn', '芚'), ('chūn', '旾'), ('chūn', '杶'), ('chūn', '萅'), ('chūn', '媋'),
              ('chūn', '暙'), ('chūn', '槆'), ('chūn', '瑃'), ('chūn', '箺'), ('chūn', '蝽'), ('chūn', '橁'), ('chūn', '輴'),
              ('chūn', '櫄'), ('chūn', '鰆'), ('chūn', '鶞'), ('chūn', '䡅')]
    chun_2 = [('chún', '唇'), ('chún', '纯'), ('chún', '淳'), ('chún', '醇'), ('chún', '鹑'), ('chún', '莼'), ('chún', '肫'),
              ('chún', '陙'), ('chún', '浱'), ('chún', '純'), ('chún', '脣'), ('chún', '湻'), ('chún', '犉'), ('chún', '滣'),
              ('chún', '蒓'), ('chún', '漘'), ('chún', '蓴'), ('chún', '膞'), ('chún', '醕'), ('chún', '錞'), ('chún', '鯙'),
              ('chún', '鶉'), ('chún', '㸪'), ('chún', '䏝'), ('chún', '䓐'), ('chún', '䣨'), ('chún', '䣩'), ('chún', '㝄'),
              ('chún', '䐇'), ('chún', '䔚'), ('chún', '㵮'), ('chún', '㝇'), ('chún', '䫃'), ('chún', '䥎')]
    chun_3 = [('chǔn', '蠢'), ('chǔn', '朐'), ('chǔn', '偆'), ('chǔn', '萶'), ('chǔn', '惷'), ('chǔn', '睶'), ('chǔn', '賰'),
              ('chǔn', '䏛'), ('chǔn', '䏰'), ('chǔn', '㖺'), ('chǔn', '䐏'), ('chǔn', '䞐'), ('chǔn', '㿤'), ('chǔn', '䄝'),
              ('chǔn', '䦮'), ('chǔn', '䮞')]
    chuo_1 = [('chuō', '戳'), ('chuō', '逴'), ('chuō', '趠'), ('chuō', '踔'), ('chuō', '繛')]
    chuo_2 = [('chuò', '绰'), ('chuò', '啜'), ('chuò', '辍'), ('chuò', '龊'), ('chuò', '辶'), ('chuò', '淖'), ('chuò', '吷'),
              ('chuò', '辵'), ('chuò', '拺'), ('chuò', '哾'), ('chuò', '娕'), ('chuò', '娖'), ('chuò', '婥'), ('chuò', '婼'),
              ('chuò', '惙'), ('chuò', '涰'), ('chuò', '酫'), ('chuò', '綽'), ('chuò', '踀'), ('chuò', '箹'), ('chuò', '輟'),
              ('chuò', '鋜'), ('chuò', '擉'), ('chuò', '磭'), ('chuò', '餟'), ('chuò', '歠'), ('chuò', '鏃'), ('chuò', '嚽'),
              ('chuò', '齪'), ('chuò', '鑡'), ('chuò', '孎'), ('chuò', '䄪'), ('chuò', '㲋'), ('chuò', '䂐'), ('chuò', '䓎'),
              ('chuò', '㚟'), ('chuò', '䇍'), ('chuò', '䋘'), ('chuò', '䍳'), ('chuò', '䃗'), ('chuò', '䆯'), ('chuò', '䮕')]
    ci_1 = [('cī', '差'), ('cī', '疵'), ('cī', '呰'), ('cī', '呲'), ('cī', '玼'), ('cī', '趀'), ('cī', '偨'), ('cī', '跐'),
            ('cī', '縒'), ('cī', '骴'), ('cī', '髊'), ('cī', '蠀'), ('cī', '齹')]
    ci_2 = [('cí', '词'), ('cí', '辞'), ('cí', '慈'), ('cí', '兹'), ('cí', '磁'), ('cí', '茨'), ('cí', '祠'), ('cí', '瓷'),
            ('cí', '雌'), ('cí', '珁'), ('cí', '垐'), ('cí', '柌'), ('cí', '粢'), ('cí', '詞'), ('cí', '辝'), ('cí', '甆'),
            ('cí', '鹚'), ('cí', '糍'), ('cí', '辤'), ('cí', '飺'), ('cí', '餈'), ('cí', '嬨'), ('cí', '濨'), ('cí', '薋'),
            ('cí', '鴜'), ('cí', '礠'), ('cí', '辭'), ('cí', '鶿'), ('cí', '鷀'), ('cí', '㓨'), ('cí', '㘹'), ('cí', '㤵'),
            ('cí', '䂣'), ('cí', '䖪'), ('cí', '䛐'), ('cí', '䧳'), ('cí', '䨏'), ('cí', '䈘'), ('cí', '㘂'), ('cí', '䲿'),
            ('cí', '䳄'), ('cí', '䆅'), ('cí', '䭣')]
    ci_3 = [('cǐ', '此'), ('cǐ', '泚'), ('cǐ', '佌'), ('cǐ', '皉'), ('cǐ', '啙'), ('cǐ', '鮆'), ('cǐ', '㠿')]
    ci_4 = [('cì', '次'), ('cì', '刺'), ('cì', '赐'), ('cì', '伺'), ('cì', '朿'), ('cì', '佽'), ('cì', '刾'), ('cì', '庛'),
            ('cì', '茦'), ('cì', '栨'), ('cì', '莿'), ('cì', '絘'), ('cì', '蛓'), ('cì', '螆'), ('cì', '賜'), ('cì', '䦻'),
            ('cì', '㡹'), ('cì', '㞖'), ('cì', '㢀'), ('cì', '䓧'), ('cì', '㹂'), ('cì', '䯸'), ('cì', '㩞'), ('cì', '䳐'),
            ('cì', '䗹'), ('cì', '䰍')]
    cong_1 = [('cōng', '匆'), ('cōng', '聪'), ('cōng', '葱'), ('cōng', '囱'), ('cōng', '枞'), ('cōng', '骢'), ('cōng', '囪'),
              ('cōng', '苁'), ('cōng', '忩'), ('cōng', '茐'), ('cōng', '怱'), ('cōng', '悤'), ('cōng', '棇'), ('cōng', '焧'),
              ('cōng', '楤'), ('cōng', '漗'), ('cōng', '聡'), ('cōng', '蓯'), ('cōng', '蔥'), ('cōng', '暰'), ('cōng', '樅'),
              ('cōng', '樬'), ('cōng', '潨'), ('cōng', '熜'), ('cōng', '瑽'), ('cōng', '璁'), ('cōng', '聦'), ('cōng', '瞛'),
              ('cōng', '篵'), ('cōng', '聰'), ('cōng', '蟌'), ('cōng', '鍯'), ('cōng', '繱'), ('cōng', '鏓'), ('cōng', '鏦'),
              ('cōng', '騘'), ('cōng', '驄')]
    cong_2 = [('cóng', '从'), ('cóng', '丛'), ('cóng', '琮'), ('cóng', '悰'), ('cóng', '淙'), ('cóng', '徔'), ('cóng', '従'),
              ('cóng', '婃'), ('cóng', '孮'), ('cóng', '徖'), ('cóng', '從'), ('cóng', '碂'), ('cóng', '慒'), ('cóng', '漎'),
              ('cóng', '潀'), ('cóng', '潈'), ('cóng', '誴'), ('cóng', '賨'), ('cóng', '賩'), ('cóng', '樷'), ('cóng', '錝'),
              ('cóng', '藂'), ('cóng', '叢'), ('cóng', '灇'), ('cóng', '欉'), ('cóng', '爜'), ('cóng', '㗰'), ('cóng', '㼻'),
              ('cóng', '䉘'), ('cóng', '䕺'), ('cóng', '䳷')]
    cong_3 = []
    cong_4 = [('còng', '愡'), ('còng', '憁'), ('còng', '謥'), ('còng', '䟲')]
    cou_1 = []
    cou_2 = []
    cou_3 = [('cǒu', '㫶')]
    cou_4 = [('còu', '凑'), ('còu', '辏'), ('còu', '湊'), ('còu', '傶'), ('còu', '楱'), ('còu', '腠'), ('còu', '輳')]
    cu_1 = [('cū', '粗'), ('cū', '麤'), ('cū', '怚'), ('cū', '觕'), ('cū', '麁'), ('cū', '麄'), ('cū', '橻'), ('cū', '麆')]
    cu_2 = [('cú', '徂'), ('cú', '殂'), ('cú', '䢐'), ('cú', '䓚')]
    cu_3 = [('cǔ', '皻')]
    cu_4 = [('cù', '趣'), ('cù', '促'), ('cù', '趋'), ('cù', '卒'), ('cù', '簇'), ('cù', '醋'), ('cù', '蹙'), ('cù', '猝'),
            ('cù', '蹴'), ('cù', '脨'), ('cù', '媨'), ('cù', '瘄'), ('cù', '蔟'), ('cù', '誎'), ('cù', '趗'), ('cù', '噈'),
            ('cù', '憱'), ('cù', '踧'), ('cù', '瘯'), ('cù', '踿'), ('cù', '縬'), ('cù', '趨'), ('cù', '鼀'), ('cù', '蹵'),
            ('cù', '顣'), ('cù', '㤘'), ('cù', '䟟'), ('cù', '䬨'), ('cù', '䎌'), ('cù', '㗤'), ('cù', '䛤'), ('cù', '䃚'),
            ('cù', '䠓'), ('cù', '䠞'), ('cù', '䥄'), ('cù', '䥘'), ('cù', '㰗'), ('cù', '䙯')]
    cuan_1 = [('cuān', '蹿'), ('cuān', '撺'), ('cuān', '汆'), ('cuān', '鋑'), ('cuān', '镩'), ('cuān', '攛'), ('cuān', '躥'),
              ('cuān', '鑹')]
    cuan_2 = [('cuán', '攒'), ('cuán', '濽'), ('cuán', '櫕'), ('cuán', '巑'), ('cuán', '攢'), ('cuán', '灒'), ('cuán', '欑'),
              ('cuán', '穳'), ('cuán', '䆘'), ('cuán', '㭫'), ('cuán', '㠝'), ('cuán', '䰖')]
    cuan_3 = [('cuàn', '窜'), ('cuàn', '篡'), ('cuàn', '爨'), ('cuàn', '殩'), ('cuàn', '熶'), ('cuàn', '窽'), ('cuàn', '窾'),
              ('cuàn', '簒'), ('cuàn', '竄'), ('cuàn', '㵀'), ('cuàn', '䞼'), ('cuàn', '㸑')]
    cui_1 = [('cuī', '崔'), ('cuī', '催'), ('cuī', '衰'), ('cuī', '摧'), ('cuī', '隹'), ('cuī', '脺'), ('cuī', '凗'),
             ('cuī', '嵟'), ('cuī', '缞'), ('cuī', '墔'), ('cuī', '慛'), ('cuī', '榱'), ('cuī', '槯'), ('cuī', '磪'),
             ('cuī', '縗'), ('cuī', '鏙')]
    cui_2 = [('cuǐ', '璀'), ('cuǐ', '漼'), ('cuǐ', '熣'), ('cuǐ', '趡'), ('cuǐ', '皠'), ('cuǐ', '㷃'), ('cuǐ', '㵏'),
             ('cuǐ', '䧽'), ('cuǐ', '䊫')]
    cui_3 = [('cuì', '翠'), ('cuì', '脆'), ('cuì', '粹'), ('cuì', '悴'), ('cuì', '啐'), ('cuì', '萃'), ('cuì', '瘁'),
             ('cuì', '淬'), ('cuì', '伜'), ('cuì', '忰'), ('cuì', '疩'), ('cuì', '倅'), ('cuì', '粋'), ('cuì', '紣'),
             ('cuì', '翆'), ('cuì', '脃'), ('cuì', '啛'), ('cuì', '崒'), ('cuì', '椊'), ('cuì', '毳'), ('cuì', '焠'),
             ('cuì', '琗'), ('cuì', '綷'), ('cuì', '膵'), ('cuì', '膬'), ('cuì', '濢'), ('cuì', '竁'), ('cuì', '襊'),
             ('cuì', '顇'), ('cuì', '臎'), ('cuì', '㳃'), ('cuì', '㧘'), ('cuì', '㥞'), ('cuì', '㱖'), ('cuì', '䂱'),
             ('cuì', '䃀'), ('cuì', '㷪'), ('cuì', '㝮'), ('cuì', '㯜'), ('cuì', '䔴'), ('cuì', '䢪'), ('cuì', '㯔'),
             ('cuì', '䄟'), ('cuì', '䆊')]
    cun_1 = [('cūn', '村'), ('cūn', '邨'), ('cūn', '皴'), ('cūn', '踆'), ('cūn', '澊'), ('cūn', '竴'), ('cūn', '膥')]
    cun_2 = [('cún', '存'), ('cún', '侟'), ('cún', '拵'), ('cún', '壿')]
    cun_3 = [('cǔn', '忖'), ('cǔn', '刌')]
    cun_4 = [('cùn', '寸'), ('cùn', '吋'), ('cùn', '籿'), ('cùn', '䍎')]
    cuo_1 = [('cuō', '搓'), ('cuō', '磋'), ('cuō', '撮'), ('cuō', '蹉'), ('cuō', '瑳'), ('cuō', '遳'), ('cuō', '醝'),
             ('cuō', '鎈')]
    cuo_2 = [('cuó', '嵯'), ('cuó', '虘'), ('cuó', '嵳'), ('cuó', '痤'), ('cuó', '睉'), ('cuó', '矬'), ('cuó', '蒫'),
             ('cuó', '瘥'), ('cuó', '蔖'), ('cuó', '鹾'), ('cuó', '酂'), ('cuó', '鹺'), ('cuó', '酇'), ('cuó', '㟇'),
             ('cuó', '㭫'), ('cuó', '䐤'), ('cuó', '䣜'), ('cuó', '㽨'), ('cuó', '㿷'), ('cuó', '䑘'), ('cuó', '䠡'),
             ('cuó', '䰈'), ('cuó', '䴾')]
    cuo_3 = [('cuǒ', '脞'), ('cuǒ', '䂳')]
    cuo_4 = [('cuò', '错'), ('cuò', '措'), ('cuò', '挫'), ('cuò', '厝'), ('cuò', '锉'), ('cuò', '剉'), ('cuò', '剒'),
             ('cuò', '夎'), ('cuò', '莝'), ('cuò', '莡'), ('cuò', '庴'), ('cuò', '逪'), ('cuò', '蓌'), ('cuò', '縒'),
             ('cuò', '諎'), ('cuò', '銼'), ('cuò', '錯'), ('cuò', '䐣'), ('cuò', '䟶'), ('cuò', '䱜'), ('cuò', '䥘')]
    da_1 = [('dā', '搭'), ('dā', '嗒'), ('dā', '哒'), ('dā', '耷'), ('dā', '褡'), ('dā', '咑'), ('dā', '笚'), ('dā', '噠'),
            ('dā', '墶'), ('dā', '撘'), ('dā', '鎝'), ('dā', '鎉'), ('dā', '䪏'), ('dā', '䐛'), ('dā', '㙮')]
    da_2 = [('dá', '达'), ('dá', '答'), ('dá', '妲'), ('dá', '惮'), ('dá', '瘩'), ('dá', '沓'), ('dá', '鞑'), ('dá', '怛'),
            ('dá', '靼'), ('dá', '迏'), ('dá', '迖'), ('dá', '迚'), ('dá', '呾'), ('dá', '垯'), ('dá', '炟'), ('dá', '羍'),
            ('dá', '荅'), ('dá', '荙'), ('dá', '畗'), ('dá', '剳'), ('dá', '匒'), ('dá', '畣'), ('dá', '笪'), ('dá', '逹'),
            ('dá', '溚'), ('dá', '詚'), ('dá', '達'), ('dá', '跶'), ('dá', '憚'), ('dá', '薘'), ('dá', '燵'), ('dá', '蟽'),
            ('dá', '鐽'), ('dá', '韃'), ('dá', '龖'), ('dá', '龘'), ('dá', '㾑'), ('dá', '㿯'), ('dá', '㜓'), ('dá', '䐊'),
            ('dá', '㯚'), ('dá', '䑽'), ('dá', '䩢'), ('dá', '䃮'), ('dá', '䵣'), ('dá', '䳴')]
    da_3 = [('dǎ', '打')]
    da_4 = [('dà', '大'), ('dà', '亣'), ('dà', '汏'), ('dà', '眔')]
    da_5 = [('da', '繨'), ('da', '㟷')]
    dai_1 = [('dāi', '呆'), ('dāi', '呔'), ('dāi', '獃'), ('dāi', '懛')]
    dai_2 = [('dǎi', '歹'), ('dǎi', '傣'), ('dǎi', '䚞'), ('dǎi', '䚟')]
    dai_3 = [('dài', '大'), ('dài', '带'), ('dài', '代'), ('dài', '待'), ('dài', '毒'), ('dài', '戴'), ('dài', '袋'),
             ('dài', '黛'), ('dài', '贷'), ('dài', '逮'), ('dài', '怠'), ('dài', '殆'), ('dài', '岱'), ('dài', '棣'),
             ('dài', '迨'), ('dài', '玳'), ('dài', '诒'), ('dài', '绐'), ('dài', '轪'), ('dài', '侢'), ('dài', '垈'),
             ('dài', '帒'), ('dài', '甙'), ('dài', '柋'), ('dài', '帯'), ('dài', '貣'), ('dài', '軑'), ('dài', '埭'),
             ('dài', '帶'), ('dài', '紿'), ('dài', '蚮'), ('dài', '軚'), ('dài', '釱'), ('dài', '詒'), ('dài', '貸'),
             ('dài', '軩'), ('dài', '瑇'), ('dài', '跢'), ('dài', '廗'), ('dài', '箉'), ('dài', '叇'), ('dài', '曃'),
             ('dài', '緿'), ('dài', '蝳'), ('dài', '駘'), ('dài', '鮘'), ('dài', '鴏'), ('dài', '艜'), ('dài', '簤'),
             ('dài', '蹛'), ('dài', '瀻'), ('dài', '霴'), ('dài', '襶'), ('dài', '黱'), ('dài', '靆'), ('dài', '㐲'),
             ('dài', '㞭'), ('dài', '㶡'), ('dài', '䒫'), ('dài', '㫹'), ('dài', '㻖'), ('dài', '䈆'), ('dài', '䲦'),
             ('dài', '㯂'), ('dài', '㿃')]
    dan_1 = [('dān', '单'), ('dān', '担'), ('dān', '丹'), ('dān', '耽'), ('dān', '眈'), ('dān', '郸'), ('dān', '聃'),
             ('dān', '殚'), ('dān', '箪'), ('dān', '儋'), ('dān', '妉'), ('dān', '単'), ('dān', '砃'), ('dān', '耼'),
             ('dān', '躭'), ('dān', '酖'), ('dān', '單'), ('dān', '媅'), ('dān', '愖'), ('dān', '匰'), ('dān', '褝'),
             ('dān', '鄲'), ('dān', '頕'), ('dān', '勯'), ('dān', '擔'), ('dān', '殫'), ('dān', '甔'), ('dān', '襌'),
             ('dān', '簞'), ('dān', '聸'), ('dān', '㴷')]
    dan_2 = [('dǎn', '胆'), ('dǎn', '掸'), ('dǎn', '疸'), ('dǎn', '亶'), ('dǎn', '伔'), ('dǎn', '刐'), ('dǎn', '抌'),
             ('dǎn', '玬'), ('dǎn', '瓭'), ('dǎn', '衴'), ('dǎn', '紞'), ('dǎn', '赕'), ('dǎn', '馾'), ('dǎn', '撢'),
             ('dǎn', '撣'), ('dǎn', '賧'), ('dǎn', '燀'), ('dǎn', '黕'), ('dǎn', '膽'), ('dǎn', '皽'), ('dǎn', '黵'),
             ('dǎn', '㕪'), ('dǎn', '㽎'), ('dǎn', '㔊'), ('dǎn', '䱋'), ('dǎn', '䃫'), ('dǎn', '䉞')]
    dan_3 = [('dàn', '但'), ('dàn', '石'), ('dàn', '淡'), ('dàn', '弹'), ('dàn', '旦'), ('dàn', '蛋'), ('dàn', '诞'),
             ('dàn', '惮'), ('dàn', '啖'), ('dàn', '澹'), ('dàn', '氮'), ('dàn', '膻'), ('dàn', '帎'), ('dàn', '呾'),
             ('dàn', '沊'), ('dàn', '泹'), ('dàn', '狚'), ('dàn', '唌'), ('dàn', '柦'), ('dàn', '疍'), ('dàn', '訑'),
             ('dàn', '啗'), ('dàn', '惔'), ('dàn', '萏'), ('dàn', '啿'), ('dàn', '弾'), ('dàn', '腅'), ('dàn', '蜑'),
             ('dàn', '觛'), ('dàn', '瘅'), ('dàn', '窞'), ('dàn', '蓞'), ('dàn', '誕'), ('dàn', '僤'), ('dàn', '噉'),
             ('dàn', '髧'), ('dàn', '嘾'), ('dàn', '彈'), ('dàn', '憚'), ('dàn', '醈'), ('dàn', '憺'), ('dàn', '禫'),
             ('dàn', '餤'), ('dàn', '駳'), ('dàn', '鴠'), ('dàn', '癉'), ('dàn', '癚'), ('dàn', '嚪'), ('dàn', '繵'),
             ('dàn', '贉'), ('dàn', '霮'), ('dàn', '饏'), ('dàn', '黮'), ('dàn', '㡺'), ('dàn', '㱽'), ('dàn', '㫜'),
             ('dàn', '䄷'), ('dàn', '㗖'), ('dàn', '㵅'), ('dàn', '㺗'), ('dàn', '䩥'), ('dàn', '㲷'), ('dàn', '䳉'),
             ('dàn', '䨢'), ('dàn', '䭛'), ('dàn', '䨵'), ('dàn', '䉷')]
    dang_1 = [('dāng', '当'), ('dāng', '铛'), ('dāng', '珰'), ('dāng', '裆'), ('dāng', '噹'), ('dāng', '筜'), ('dāng', '當'),
              ('dāng', '儅'), ('dāng', '澢'), ('dāng', '璫'), ('dāng', '襠'), ('dāng', '簹'), ('dāng', '艡'), ('dāng', '蟷'),
              ('dāng', '鐺'), ('dāng', '闣'), ('dāng', '㜭')]
    dang_2 = [('dǎng', '党'), ('dǎng', '挡'), ('dǎng', '谠'), ('dǎng', '擋'), ('dǎng', '譡'), ('dǎng', '黨'), ('dǎng', '攩'),
              ('dǎng', '灙'), ('dǎng', '欓'), ('dǎng', '讜'), ('dǎng', '䣊'), ('dǎng', '䣣')]
    dang_3 = [('dàng', '荡'), ('dàng', '档'), ('dàng', '宕'), ('dàng', '砀'), ('dàng', '氹'), ('dàng', '凼'), ('dàng', '圵'),
              ('dàng', '垱'), ('dàng', '偒'), ('dàng', '菪'), ('dàng', '婸'), ('dàng', '崵'), ('dàng', '愓'), ('dàng', '瓽'),
              ('dàng', '逿'), ('dàng', '嵣'), ('dàng', '雼'), ('dàng', '潒'), ('dàng', '碭'), ('dàng', '瞊'), ('dàng', '蕩'),
              ('dàng', '趤'), ('dàng', '壋'), ('dàng', '檔'), ('dàng', '璗'), ('dàng', '盪'), ('dàng', '礑'), ('dàng', '簜'),
              ('dàng', '蘯'), ('dàng', '䦒'), ('dàng', '䑗')]
    dao_1 = [('dāo', '刀'), ('dāo', '叨'), ('dāo', '刂'), ('dāo', '忉'), ('dāo', '朷'), ('dāo', '氘'), ('dāo', '舠'),
             ('dāo', '釖'), ('dāo', '鱽'), ('dāo', '裯'), ('dāo', '魛'), ('dāo', '螩'), ('dāo', '㧅')]
    dao_2 = [('dáo', '捯')]
    dao_3 = [('dǎo', '倒'), ('dǎo', '导'), ('dǎo', '岛'), ('dǎo', '祷'), ('dǎo', '蹈'), ('dǎo', '捣'), ('dǎo', '陦'),
             ('dǎo', '島'), ('dǎo', '禂'), ('dǎo', '搗'), ('dǎo', '隝'), ('dǎo', '嘄'), ('dǎo', '嶋'), ('dǎo', '嶌'),
             ('dǎo', '槝'), ('dǎo', '導'), ('dǎo', '隯'), ('dǎo', '壔'), ('dǎo', '嶹'), ('dǎo', '擣'), ('dǎo', '檮'),
             ('dǎo', '禱'), ('dǎo', '㠀'), ('dǎo', '㨶'), ('dǎo', '䲽'), ('dǎo', '䆃'), ('dǎo', '㿒'), ('dǎo', '䌦'),
             ('dǎo', '䮻'), ('dǎo', '兼')]
    dao_4 = [('dào', '道'), ('dào', '到'), ('dào', '盗'), ('dào', '稻'), ('dào', '悼'), ('dào', '纛'), ('dào', '辺'),
             ('dào', '帱'), ('dào', '梼'), ('dào', '焘'), ('dào', '菿'), ('dào', '椡'), ('dào', '盜'), ('dào', '絩'),
             ('dào', '稲'), ('dào', '箌'), ('dào', '翢'), ('dào', '噵'), ('dào', '艔'), ('dào', '衜'), ('dào', '檤'),
             ('dào', '衟'), ('dào', '幬'), ('dào', '燾'), ('dào', '翿'), ('dào', '軇'), ('dào', '瓙'), ('dào', '䧂'),
             ('dào', '㔑'), ('dào', '䊭'), ('dào', '䣣')]
    de_1 = [('dē', '嘚')]
    de_2 = [('dé', '得'), ('dé', '德'), ('dé', '恴'), ('dé', '淂'), ('dé', '蚮'), ('dé', '悳'), ('dé', '惪'), ('dé', '棏'),
            ('dé', '锝'), ('dé', '徳'), ('dé', '鍀'), ('dé', '㝵'), ('dé', '㝶'), ('dé', '㤫'), ('dé', '䙷'), ('dé', '䙸'),
            ('dé', '㥀'), ('dé', '㥁'), ('dé', '㯖')]
    de_3 = [('de', '的'), ('de', '地'), ('de', '底'), ('de', '旳')]
    dei_1 = [('dēi', '嘚')]
    dei_2 = [('děi', '得'), ('děi', '䮻')]
    den_1 = [('dèn', '扥'), ('dèn', '扽'), ('dèn', '㩐')]
    deng_1 = [('dēng', '灯'), ('dēng', '登'), ('dēng', '蹬'), ('dēng', '噔'), ('dēng', '豋'), ('dēng', '僜'), ('dēng', '嬁'),
              ('dēng', '燈'), ('dēng', '璒'), ('dēng', '竳'), ('dēng', '簦'), ('dēng', '艠'), ('dēng', '㲪')]
    deng_2 = [('děng', '等'), ('děng', '戥'), ('děng', '䒭')]
    deng_3 = [('dèng', '邓'), ('dèng', '瞪'), ('dèng', '澄'), ('dèng', '凳'), ('dèng', '镫'), ('dèng', '磴'), ('dèng', '鄧'),
              ('dèng', '隥'), ('dèng', '墱'), ('dèng', '嶝'), ('dèng', '憕'), ('dèng', '櫈'), ('dèng', '瀓'), ('dèng', '覴'),
              ('dèng', '鐙'), ('dèng', '䠬'), ('dèng', '䮴')]
    di_1 = [('dī', '提'), ('dī', '低'), ('dī', '滴'), ('dī', '堤'), ('dī', '氐'), ('dī', '仾'), ('dī', '奃'), ('dī', '岻'),
            ('dī', '彽'), ('dī', '秪'), ('dī', '袛'), ('dī', '啲'), ('dī', '埞'), ('dī', '羝'), ('dī', '隄'), ('dī', '渧'),
            ('dī', '趆'), ('dī', '碮'), ('dī', '樀'), ('dī', '磾'), ('dī', '鞮')]
    di_2 = [('dí', '的'), ('dí', '敌'), ('dí', '狄'), ('dí', '迪'), ('dí', '笛'), ('dí', '嘀'), ('dí', '翟'), ('dí', '涤'),
            ('dí', '嫡'), ('dí', '荻'), ('dí', '籴'), ('dí', '觌'), ('dí', '扚'), ('dí', '廸'), ('dí', '肑'), ('dí', '苖'),
            ('dí', '唙'), ('dí', '浟'), ('dí', '啇'), ('dí', '梑'), ('dí', '靮'), ('dí', '滌'), ('dí', '蓧'), ('dí', '馰'),
            ('dí', '髢'), ('dí', '蔋'), ('dí', '蔐'), ('dí', '頔'), ('dí', '敵'), ('dí', '篴'), ('dí', '镝'), ('dí', '嚁'),
            ('dí', '藡'), ('dí', '豴'), ('dí', '蹢'), ('dí', '鏑'), ('dí', '糴'), ('dí', '覿'), ('dí', '鸐'), ('dí', '㣙'),
            ('dí', '㹍'), ('dí', '䵠'), ('dí', '䨀'), ('dí', '䨤'), ('dí', '䨢'), ('dí', '䯼'), ('dí', '㰅'), ('dí', '䊮'),
            ('dí', '䮤'), ('dí', '䴞')]
    di_3 = [('dǐ', '底'), ('dǐ', '抵'), ('dǐ', '邸'), ('dǐ', '诋'), ('dǐ', '砥'), ('dǐ', '柢'), ('dǐ', '厎'), ('dǐ', '坘'),
            ('dǐ', '阺'), ('dǐ', '呧'), ('dǐ', '坻'), ('dǐ', '弤'), ('dǐ', '拞'), ('dǐ', '枑'), ('dǐ', '牴'), ('dǐ', '掋'),
            ('dǐ', '菧'), ('dǐ', '觝'), ('dǐ', '詆'), ('dǐ', '軧'), ('dǐ', '聜'), ('dǐ', '骶'), ('dǐ', '鯳'), ('dǐ', '㡳'),
            ('dǐ', '䢑'), ('dǐ', '㪆'), ('dǐ', '䂡'), ('dǐ', '䍕'), ('dǐ', '䣌'), ('dǐ', '㭽'), ('dǐ', '䱃')]
    di_4 = [('dì', '地'), ('dì', '第'), ('dì', '弟'), ('dì', '帝'), ('dì', '递'), ('dì', '蒂'), ('dì', '缔'), ('dì', '谛'),
            ('dì', '棣'), ('dì', '睇'), ('dì', '娣'), ('dì', '坔'), ('dì', '旳'), ('dì', '杕'), ('dì', '玓'), ('dì', '怟'),
            ('dì', '枤'), ('dì', '苐'), ('dì', '俤'), ('dì', '哋'), ('dì', '埅'), ('dì', '埊'), ('dì', '逓'), ('dì', '偙'),
            ('dì', '梊'), ('dì', '焍'), ('dì', '珶'), ('dì', '眱'), ('dì', '祶'), ('dì', '菂'), ('dì', '釱'), ('dì', '媂'),
            ('dì', '揥'), ('dì', '遆'), ('dì', '僀'), ('dì', '楴'), ('dì', '禘'), ('dì', '腣'), ('dì', '遞'), ('dì', '鉪'),
            ('dì', '墆'), ('dì', '墑'), ('dì', '墬'), ('dì', '嵽'), ('dì', '摕'), ('dì', '疐'), ('dì', '碲'), ('dì', '蔕'),
            ('dì', '蝃'), ('dì', '遰'), ('dì', '慸'), ('dì', '甋'), ('dì', '締'), ('dì', '蝭'), ('dì', '嶳'), ('dì', '諟'),
            ('dì', '諦'), ('dì', '踶'), ('dì', '螮'), ('dì', '㢩'), ('dì', '䏑'), ('dì', '䀸'), ('dì', '䀿'), ('dì', '䑭'),
            ('dì', '䟡'), ('dì', '㼵'), ('dì', '䑯'), ('dì', '䩘'), ('dì', '㦅'), ('dì', '䩚'), ('dì', '䲦'), ('dì', '䗖'),
            ('dì', '䞶'), ('dì', '䱱'), ('dì', '䶍')]
    dia_1 = [('diǎ', '嗲')]
    dian_1 = [('diān', '颠'), ('diān', '癫'), ('diān', '巅'), ('diān', '掂'), ('diān', '滇'), ('diān', '佔'), ('diān', '敁'),
              ('diān', '傎'), ('diān', '厧'), ('diān', '嵮'), ('diān', '槇'), ('diān', '槙'), ('diān', '瘨'), ('diān', '窴'),
              ('diān', '蹎'), ('diān', '顚'), ('diān', '顛'), ('diān', '巓'), ('diān', '攧'), ('diān', '巔'), ('diān', '癲'),
              ('diān', '齻'), ('diān', '㒹')]
    dian_2 = [('dián', '䟍')]
    dian_3 = [('diǎn', '点'), ('diǎn', '典'), ('diǎn', '碘'), ('diǎn', '踮'), ('diǎn', '奌'), ('diǎn', '婰'), ('diǎn', '敟'),
              ('diǎn', '椣'), ('diǎn', '跕'), ('diǎn', '蒧'), ('diǎn', '蕇'), ('diǎn', '點'), ('diǎn', '嚸'), ('diǎn', '㚲'),
              ('diǎn', '䍄'), ('diǎn', '䓦'), ('diǎn', '㸃')]
    dian_4 = [('diàn', '电'), ('diàn', '店'), ('diàn', '殿'), ('diàn', '垫'), ('diàn', '奠'), ('diàn', '甸'), ('diàn', '惦'),
              ('diàn', '玷'), ('diàn', '淀'), ('diàn', '佃'), ('diàn', '钿'), ('diàn', '靛'), ('diàn', '簟'), ('diàn', '阽'),
              ('diàn', '坫'), ('diàn', '扂'), ('diàn', '痁'), ('diàn', '婝'), ('diàn', '琔'), ('diàn', '痶'), ('diàn', '蜔'),
              ('diàn', '鈿'), ('diàn', '電'), ('diàn', '墊'), ('diàn', '壂'), ('diàn', '橂'), ('diàn', '橝'), ('diàn', '澱'),
              ('diàn', '磹'), ('diàn', '癜'), ('diàn', '驔'), ('diàn', '㓠'), ('diàn', '䧃'), ('diàn', '㥆'), ('diàn', '㼭'),
              ('diàn', '㝪'), ('diàn', '䩚'), ('diàn', '㞟'), ('diàn', '㵤'), ('diàn', '㶘')]
    diao_1 = [('diāo', '雕'), ('diāo', '刁'), ('diāo', '凋'), ('diāo', '貂'), ('diāo', '叼'), ('diāo', '碉'), ('diāo', '汈'),
              ('diāo', '刟'), ('diāo', '虭'), ('diāo', '奝'), ('diāo', '弴'), ('diāo', '彫'), ('diāo', '蛁'), ('diāo', '椆'),
              ('diāo', '琱'), ('diāo', '鳭'), ('diāo', '瞗'), ('diāo', '錭'), ('diāo', '鮉'), ('diāo', '鲷'), ('diāo', '簓'),
              ('diāo', '鼦'), ('diāo', '鯛'), ('diāo', '鵰'), ('diāo', '䘟')]
    diao_2 = [('diǎo', '扚'), ('diǎo', '屌'), ('diǎo', '鳥'), ('diǎo', '䄪'), ('diǎo', '䄷'), ('diǎo', '㹿'), ('diǎo', '䉆')]
    diao_3 = [('diào', '调'), ('diào', '掉'), ('diào', '吊'), ('diào', '钓'), ('diào', '弔'), ('diào', '伄'), ('diào', '盄'),
              ('diào', '窎'), ('diào', '訋'), ('diào', '釣'), ('diào', '铞'), ('diào', '铫'), ('diào', '絩'), ('diào', '鈟'),
              ('diào', '竨'), ('diào', '蓧'), ('diào', '誂'), ('diào', '銚'), ('diào', '銱'), ('diào', '雿'), ('diào', '魡'),
              ('diào', '調'), ('diào', '瘹'), ('diào', '窵'), ('diào', '鋽'), ('diào', '藋'), ('diào', '鑃'), ('diào', '䂪'),
              ('diào', '㪕'), ('diào', '䂽'), ('diào', '䔙'), ('diào', '㒛'), ('diào', '䠼'), ('diào', '䳝'), ('diào', '䵲')]
    die_1 = [('diē', '爹'), ('diē', '跌'), ('diē', '褺'), ('diē', '㦅')]
    die_2 = [('dié', '蝶'), ('dié', '叠'), ('dié', '迭'), ('dié', '碟'), ('dié', '谍'), ('dié', '喋'), ('dié', '牒'),
             ('dié', '佚'), ('dié', '绖'), ('dié', '堞'), ('dié', '怢'), ('dié', '泆'), ('dié', '苵'), ('dié', '咥'),
             ('dié', '垤'), ('dié', '峌'), ('dié', '恎'), ('dié', '挕'), ('dié', '昳'), ('dié', '柣'), ('dié', '胅'),
             ('dié', '瓞'), ('dié', '眣'), ('dié', '耊'), ('dié', '啑'), ('dié', '戜'), ('dié', '眰'), ('dié', '崼'),
             ('dié', '幉'), ('dié', '惵'), ('dié', '揲'), ('dié', '畳'), ('dié', '絰'), ('dié', '耋'), ('dié', '臷'),
             ('dié', '詄'), ('dié', '趃'), ('dié', '跕'), ('dié', '軼'), ('dié', '镻'), ('dié', '楪'), ('dié', '殜'),
             ('dié', '牃'), ('dié', '跮'), ('dié', '嵽'), ('dié', '蜨'), ('dié', '褋'), ('dié', '槢'), ('dié', '艓'),
             ('dié', '疂'), ('dié', '諜'), ('dié', '蹀'), ('dié', '鴩'), ('dié', '螲'), ('dié', '鲽'), ('dié', '鞢'),
             ('dié', '曡'), ('dié', '疉'), ('dié', '鰈'), ('dié', '疊'), ('dié', '氎'), ('dié', '㑙'), ('dié', '㦶'),
             ('dié', '㲳'), ('dié', '㭯'), ('dié', '䏲'), ('dié', '䘭'), ('dié', '㥈'), ('dié', '㫼'), ('dié', '㻡'),
             ('dié', '㷸'), ('dié', '㩹'), ('dié', '䳀'), ('dié', '㲲'), ('dié', '䙝'), ('dié', '㬪'), ('dié', '䞇'),
             ('dié', '䠟'), ('dié', '䮢'), ('dié', '䞕'), ('dié', '䲀'), ('dié', '䳻'), ('dié', '䴑'), ('dié', '㩸')]
    die_3 = []
    die_4 = [('diè', '哋')]
    ding_1 = [('dīng', '丁'), ('dīng', '盯'), ('dīng', '钉'), ('dīng', '叮'), ('dīng', '町'), ('dīng', '酊'), ('dīng', '仃'),
              ('dīng', '帄'), ('dīng', '玎'), ('dīng', '甼'), ('dīng', '疔'), ('dīng', '耵'), ('dīng', '虰'), ('dīng', '釘'),
              ('dīng', '靪'), ('dīng', '㐉'), ('dīng', '䦺')]
    ding_2 = [('dǐng', '顶'), ('dǐng', '鼎'), ('dǐng', '奵'), ('dǐng', '艼'), ('dǐng', '頂'), ('dǐng', '嵿'), ('dǐng', '鼑'),
              ('dǐng', '濎'), ('dǐng', '薡'), ('dǐng', '鐤'), ('dǐng', '㼗'), ('dǐng', '㫀'), ('dǐng', '㝪'), ('dǐng', '㴿')]
    ding_3 = [('dìng', '定'), ('dìng', '订'), ('dìng', '锭'), ('dìng', '铤'), ('dìng', '忊'), ('dìng', '饤'), ('dìng', '矴'),
              ('dìng', '訂'), ('dìng', '飣'), ('dìng', '啶'), ('dìng', '掟'), ('dìng', '萣'), ('dìng', '椗'), ('dìng', '腚'),
              ('dìng', '碇'), ('dìng', '碠'), ('dìng', '聢'), ('dìng', '蝊'), ('dìng', '鋌'), ('dìng', '錠'), ('dìng', '磸'),
              ('dìng', '顁'), ('dìng', '㝎')]
    diu_1 = [('diū', '丢'), ('diū', '丟'), ('diū', '铥'), ('diū', '颩'), ('diū', '銩')]
    dong_1 = [('dōng', '东'), ('dōng', '冬'), ('dōng', '咚'), ('dōng', '岽'), ('dōng', '東'), ('dōng', '苳'), ('dōng', '昸'),
              ('dōng', '氡'), ('dōng', '倲'), ('dōng', '鸫'), ('dōng', '埬'), ('dōng', '娻'), ('dōng', '崠'), ('dōng', '崬'),
              ('dōng', '涷'), ('dōng', '笗'), ('dōng', '菄'), ('dōng', '徚'), ('dōng', '氭'), ('dōng', '蝀'), ('dōng', '鮗'),
              ('dōng', '鼕'), ('dōng', '鯟'), ('dōng', '鶇'), ('dōng', '鶫'), ('dōng', '㐑'), ('dōng', '䳉')]
    dong_2 = [('dǒng', '懂'), ('dǒng', '董'), ('dǒng', '揰'), ('dǒng', '墥'), ('dǒng', '嬞'), ('dǒng', '箽'), ('dǒng', '蕫'),
              ('dǒng', '諌'), ('dǒng', '䂢'), ('dǒng', '㖦'), ('dǒng', '㨂'), ('dǒng', '䵔')]
    dong_3 = [('dòng', '动'), ('dòng', '洞'), ('dòng', '冻'), ('dòng', '栋'), ('dòng', '峒'), ('dòng', '侗'), ('dòng', '恫'),
              ('dòng', '胴'), ('dòng', '垌'), ('dòng', '姛'), ('dòng', '挏'), ('dòng', '狪'), ('dòng', '胨'), ('dòng', '迵'),
              ('dòng', '凍'), ('dòng', '戙'), ('dòng', '烔'), ('dòng', '動'), ('dòng', '硐'), ('dòng', '棟'), ('dòng', '湩'),
              ('dòng', '絧'), ('dòng', '腖'), ('dòng', '働'), ('dòng', '勭'), ('dòng', '燑'), ('dòng', '駧'), ('dòng', '霘'),
              ('dòng', '㑈'), ('dòng', '㓊'), ('dòng', '㢥'), ('dòng', '䅍'), ('dòng', '㼯'), ('dòng', '䞒'), ('dòng', '㗢'),
              ('dòng', '䍶'), ('dòng', '㜱')]
    dou_1 = [('dōu', '都'), ('dōu', '兜'), ('dōu', '吺'), ('dōu', '枓'), ('dōu', '侸'), ('dōu', '唗'), ('dōu', '兠'),
             ('dōu', '蔸'), ('dōu', '橷'), ('dōu', '瞗'), ('dōu', '篼'), ('dōu', '㨮')]
    dou_2 = [('dóu', '唞')]
    dou_3 = [('dǒu', '斗'), ('dǒu', '抖'), ('dǒu', '陡'), ('dǒu', '蚪'), ('dǒu', '乧'), ('dǒu', '阧'), ('dǒu', '钭'),
             ('dǒu', '鈄'), ('dǒu', '㞳'), ('dǒu', '㪷'), ('dǒu', '䕱')]
    dou_4 = [('dòu', '读'), ('dòu', '豆'), ('dòu', '逗'), ('dòu', '窦'), ('dòu', '渎'), ('dòu', '痘'), ('dòu', '吋'),
             ('dòu', '郖'), ('dòu', '浢'), ('dòu', '狵'), ('dòu', '荳'), ('dòu', '饾'), ('dòu', '鬥'), ('dòu', '梪'),
             ('dòu', '毭'), ('dòu', '脰'), ('dòu', '酘'), ('dòu', '閗'), ('dòu', '鬦'), ('dòu', '鋀'), ('dòu', '餖'),
             ('dòu', '斣'), ('dòu', '瀆'), ('dòu', '闘'), ('dòu', '竇'), ('dòu', '鬪'), ('dòu', '鬬'), ('dòu', '鬭'),
             ('dòu', '㐙'), ('dòu', '㛒'), ('dòu', '㢄'), ('dòu', '䄈'), ('dòu', '㷆'), ('dòu', '䬦'), ('dòu', '䇺'),
             ('dòu', '䛠'), ('dòu', '䕆')]
    du_1 = [('dū', '都'), ('dū', '督'), ('dū', '嘟'), ('dū', '厾'), ('dū', '剢'), ('dū', '阇'), ('dū', '醏'), ('dū', '闍')]
    du_2 = [('dú', '独'), ('dú', '读'), ('dú', '毒'), ('dú', '渎'), ('dú', '犊'), ('dú', '牍'), ('dú', '髑'), ('dú', '涜'),
            ('dú', '椟'), ('dú', '裻'), ('dú', '読'), ('dú', '獨'), ('dú', '錖'), ('dú', '凟'), ('dú', '匵'), ('dú', '嬻'),
            ('dú', '瀆'), ('dú', '櫝'), ('dú', '殰'), ('dú', '牘'), ('dú', '犢'), ('dú', '瓄'), ('dú', '皾'), ('dú', '騳'),
            ('dú', '黩'), ('dú', '讀'), ('dú', '豄'), ('dú', '贕'), ('dú', '韣'), ('dú', '鑟'), ('dú', '韇'), ('dú', '韥'),
            ('dú', '黷'), ('dú', '讟'), ('dú', '㾄'), ('dú', '㸿'), ('dú', '㱩'), ('dú', '䓯'), ('dú', '㹍'), ('dú', '䢱'),
            ('dú', '䪅'), ('dú', '䫳'), ('dú', '䮷'), ('dú', '䙱')]
    du_3 = [('dǔ', '赌'), ('dǔ', '睹'), ('dǔ', '堵'), ('dǔ', '竺'), ('dǔ', '笃'), ('dǔ', '暏'), ('dǔ', '琽'), ('dǔ', '覩'),
            ('dǔ', '賭'), ('dǔ', '篤'), ('dǔ', '䀾'), ('dǔ', '䐗'), ('dǔ', '䈞')]
    du_4 = [('dù', '度'), ('dù', '杜'), ('dù', '肚'), ('dù', '渡'), ('dù', '妒'), ('dù', '镀'), ('dù', '蠹'), ('dù', '芏'),
            ('dù', '妬'), ('dù', '姤'), ('dù', '荰'), ('dù', '秺'), ('dù', '晵'), ('dù', '靯'), ('dù', '螙'), ('dù', '斁'),
            ('dù', '殬'), ('dù', '鍍'), ('dù', '蠧'), ('dù', '㡯'), ('dù', '䅊'), ('dù', '㓃'), ('dù', '䄍'), ('dù', '䟻'),
            ('dù', '䲧')]
    duan_1 = [('duān', '端'), ('duān', '耑'), ('duān', '偳'), ('duān', '剬'), ('duān', '媏'), ('duān', '褍'), ('duān', '鍴')]
    duan_2 = [('duǎn', '短')]
    duan_3 = [('duàn', '断'), ('duàn', '段'), ('duàn', '缎'), ('duàn', '锻'), ('duàn', '塅'), ('duàn', '葮'), ('duàn', '椴'),
              ('duàn', '煅'), ('duàn', '瑖'), ('duàn', '腶'), ('duàn', '碫'), ('duàn', '緞'), ('duàn', '毈'), ('duàn', '簖'),
              ('duàn', '鍛'), ('duàn', '斷'), ('duàn', '躖'), ('duàn', '籪'), ('duàn', '㱭'), ('duàn', '㫁'), ('duàn', '䠪')]
    dui_1 = [('duī', '追'), ('duī', '堆'), ('duī', '垖'), ('duī', '塠'), ('duī', '痽'), ('duī', '磓'), ('duī', '镦'),
             ('duī', '鴭'), ('duī', '鐓'), ('duī', '鐜'), ('duī', '䊚')]
    dui_2 = [('duǐ', '啍'), ('duǐ', '頧'), ('duǐ', '㨃')]
    dui_3 = [('duì', '对'), ('duì', '队'), ('duì', '敦'), ('duì', '兑'), ('duì', '怼'), ('duì', '兊'), ('duì', '兌'),
             ('duì', '対'), ('duì', '杸'), ('duì', '祋'), ('duì', '陮'), ('duì', '敓'), ('duì', '敚'), ('duì', '隊'),
             ('duì', '碓'), ('duì', '綐'), ('duì', '對'), ('duì', '憞'), ('duì', '憝'), ('duì', '濧'), ('duì', '濻'),
             ('duì', '薱'), ('duì', '懟'), ('duì', '瀢'), ('duì', '瀩'), ('duì', '譈'), ('duì', '譵'), ('duì', '轛'),
             ('duì', '㳔'), ('duì', '㙂'), ('duì', '㟋'), ('duì', '䇤'), ('duì', '䇏'), ('duì', '䔪'), ('duì', '䬽'),
             ('duì', '䬈'), ('duì', '㠚'), ('duì', '㬣'), ('duì', '㵽'), ('duì', '䯟'), ('duì', '䨴'), ('duì', '䨺')]
    dun_1 = [('dūn', '敦'), ('dūn', '吨'), ('dūn', '蹲'), ('dūn', '墩'), ('dūn', '惇'), ('dūn', '蜳'), ('dūn', '墪'),
             ('dūn', '墫'), ('dūn', '撴'), ('dūn', '獤'), ('dūn', '噸'), ('dūn', '撉'), ('dūn', '橔'), ('dūn', '犜'),
             ('dūn', '礅'), ('dūn', '镦'), ('dūn', '蹾'), ('dūn', '驐'), ('dūn', '㥫')]
    dun_2 = [('dǔn', '盹'), ('dǔn', '趸'), ('dǔn', '躉')]
    dun_3 = [('dùn', '顿'), ('dùn', '盾'), ('dùn', '遁'), ('dùn', '钝'), ('dùn', '沌'), ('dùn', '炖'), ('dùn', '囤'),
             ('dùn', '伅'), ('dùn', '坉'), ('dùn', '庉'), ('dùn', '忳'), ('dùn', '砘'), ('dùn', '逇'), ('dùn', '鈍'),
             ('dùn', '楯'), ('dùn', '頓'), ('dùn', '碷'), ('dùn', '遯'), ('dùn', '憞'), ('dùn', '潡'), ('dùn', '燉'),
             ('dùn', '踲'), ('dùn', '䤜'), ('dùn', '㬿')]
    duo_1 = [('duō', '多'), ('duō', '哆'), ('duō', '咄'), ('duō', '掇'), ('duō', '裰'), ('duō', '夛'), ('duō', '畓'),
             ('duō', '剟'), ('duō', '敠'), ('duō', '敪'), ('duō', '毲'), ('duō', '嚉'), ('duō', '㙍')]
    duo_2 = [('duó', '度'), ('duó', '夺'), ('duó', '踱'), ('duó', '铎'), ('duó', '仛'), ('duó', '沰'), ('duó', '剫'),
             ('duó', '敓'), ('duó', '敚'), ('duó', '喥'), ('duó', '痥'), ('duó', '鈬'), ('duó', '奪'), ('duó', '凙'),
             ('duó', '鐸'), ('duó', '㣞'), ('duó', '䄍'), ('duó', '䁟'), ('duó', '䐾')]
    duo_3 = [('duǒ', '朵'), ('duǒ', '躲'), ('duǒ', '垛'), ('duǒ', '朶'), ('duǒ', '哚'), ('duǒ', '垜'), ('duǒ', '挆'),
             ('duǒ', '埵'), ('duǒ', '崜'), ('duǒ', '缍'), ('duǒ', '袳'), ('duǒ', '椯'), ('duǒ', '硾'), ('duǒ', '趓'),
             ('duǒ', '躱'), ('duǒ', '綞'), ('duǒ', '亸'), ('duǒ', '軃'), ('duǒ', '鬌'), ('duǒ', '嚲'), ('duǒ', '奲'),
             ('duǒ', '㛆'), ('duǒ', '㛊'), ('duǒ', '䒳'), ('duǒ', '㥩'), ('duǒ', '㖼'), ('duǒ', '㙐'), ('duǒ', '㻔'),
             ('duǒ', '䤪'), ('duǒ', '䫂'), ('duǒ', '㔍'), ('duǒ', '䙤'), ('duǒ', '䩣'), ('duǒ', '䠤'), ('duǒ', '䯬')]
    duo_4 = [('duò', '堕'), ('duò', '舵'), ('duò', '隋'), ('duò', '跺'), ('duò', '惰'), ('duò', '剁'), ('duò', '隳'),
             ('duò', '杕'), ('duò', '杝'), ('duò', '刴'), ('duò', '枤'), ('duò', '沲'), ('duò', '陊'), ('duò', '陏'),
             ('duò', '饳'), ('duò', '尮'), ('duò', '挅'), ('duò', '柁'), ('duò', '柂'), ('duò', '柮'), ('duò', '桗'),
             ('duò', '媠'), ('duò', '隓'), ('duò', '跢'), ('duò', '跥'), ('duò', '飿'), ('duò', '馱'), ('duò', '墮'),
             ('duò', '憜'), ('duò', '駄'), ('duò', '墯'), ('duò', '鵽'), ('duò', '㧷'), ('duò', '䑨'), ('duò', '䅜'),
             ('duò', '䩔'), ('duò', '㻧'), ('duò', '䍴'), ('duò', '䙃'), ('duò', '䙟'), ('duò', '䤻'), ('duò', '䲊')]
    duo_5 = []
    e_1 = [('ē', '阿'), ('ē', '婀'), ('ē', '妸'), ('ē', '妿'), ('ē', '娿'), ('ē', '屙'), ('ē', '痾')]
    e_2 = [('é', '额'), ('é', '俄'), ('é', '哦'), ('é', '娥'), ('é', '鹅'), ('é', '峨'), ('é', '讹'), ('é', '蛾'), ('é', '吪'),
           ('é', '囮'), ('é', '迗'), ('é', '峉'), ('é', '峩'), ('é', '涐'), ('é', '莪'), ('é', '珴'), ('é', '訛'), ('é', '皒'),
           ('é', '睋'), ('é', '鈋'), ('é', '锇'), ('é', '磀'), ('é', '誐'), ('é', '鋨'), ('é', '頟'), ('é', '魤'), ('é', '額'),
           ('é', '鵝'), ('é', '鵞'), ('é', '譌'), ('é', '䄉'), ('é', '㼰'), ('é', '䖸'), ('é', '䕏'), ('é', '㼂'), ('é', '䳗'),
           ('é', '䳘'), ('é', '䩹'), ('é', '䱮')]
    e_3 = [('ě', '枙'), ('ě', '砨'), ('ě', '頋'), ('ě', '噁'), ('ě', '騀'), ('ě', '鵈'), ('ě', '㼢')]
    e_4 = [('è', '恶'), ('è', '饿'), ('è', '愕'), ('è', '厄'), ('è', '呃'), ('è', '遏'), ('è', '噩'), ('è', '扼'), ('è', '鄂'),
           ('è', '萼'), ('è', '颚'), ('è', '鳄'), ('è', '鹗'), ('è', '轭'), ('è', '垩'), ('è', '谔'), ('è', '锷'), ('è', '戹'),
           ('è', '歺'), ('è', '岋'), ('è', '阨'), ('è', '苊'), ('è', '阸'), ('è', '呝'), ('è', '砐'), ('è', '咢'), ('è', '咹'),
           ('è', '姶'), ('è', '洝'), ('è', '砈'), ('è', '匎'), ('è', '敋'), ('è', '蚅'), ('è', '偔'), ('è', '卾'), ('è', '堊'),
           ('è', '娾'), ('è', '悪'), ('è', '硆'), ('è', '軛'), ('è', '阏'), ('è', '堨'), ('è', '堮'), ('è', '崿'), ('è', '惡'),
           ('è', '湂'), ('è', '豟'), ('è', '軶'), ('è', '遌'), ('è', '鈪'), ('è', '廅'), ('è', '搕'), ('è', '搤'), ('è', '搹'),
           ('è', '琧'), ('è', '痷'), ('è', '腭'), ('è', '僫'), ('è', '蝁'), ('è', '蕚'), ('è', '遻'), ('è', '頞'), ('è', '餓'),
           ('è', '擜'), ('è', '覨'), ('è', '諤'), ('è', '閼'), ('è', '餩'), ('è', '鍔'), ('è', '歞'), ('è', '顎'), ('è', '礘'),
           ('è', '櫮'), ('è', '鰐'), ('è', '鶚'), ('è', '鰪'), ('è', '讍'), ('è', '齃'), ('è', '鑩'), ('è', '齶'), ('è', '鱷'),
           ('è', '㧖'), ('è', '䆓'), ('è', '䑥'), ('è', '䓊'), ('è', '䙳'), ('è', '㓵'), ('è', '㡋'), ('è', '㔩'), ('è', '㕎'),
           ('è', '㖾'), ('è', '㗁'), ('è', '㗉'), ('è', '㟧'), ('è', '㟯'), ('è', '㱦'), ('è', '㷈'), ('è', '䑪'), ('è', '䝈'),
           ('è', '㮙'), ('è', '䛖'), ('è', '䞩'), ('è', '䣞'), ('è', '㠋'), ('è', '㦍'), ('è', '䔾'), ('è', '䳬'), ('è', '㩵'),
           ('è', '䫷')]
    ei_1 = [('ēi', '诶'), ('ēi', '欸'), ('ēi', '誒')]
    ei_2 = []
    en_1 = [('ēn', '恩'), ('ēn', '奀'), ('ēn', '蒽'), ('ēn', '煾')]
    en_2 = [('ěn', '峎'), ('ěn', '䅰')]
    en_3 = [('èn', '摁'), ('èn', '䊐'), ('èn', '䬶'), ('èn', '䭓'), ('èn', '䭡')]
    eng_1 = [('ēng', '鞥')]
    er_1 = [('ér', '而'), ('ér', '儿'), ('ér', '児'), ('ér', '杒'), ('ér', '侕'), ('ér', '兒'), ('ér', '陑'), ('ér', '峏'),
            ('ér', '洏'), ('ér', '耏'), ('ér', '荋'), ('ér', '栭'), ('ér', '胹'), ('ér', '唲'), ('ér', '梕'), ('ér', '袻'),
            ('ér', '鸸'), ('ér', '粫'), ('ér', '聏'), ('ér', '輀'), ('ér', '鲕'), ('ér', '隭'), ('ér', '髵'), ('ér', '鮞'),
            ('ér', '鴯'), ('ér', '轜'), ('ér', '㖇'), ('ér', '㧫'), ('ér', '䎟'), ('ér', '䎠'), ('ér', '㮕'), ('ér', '䋩'),
            ('ér', '㜨'), ('ér', '䮘')]
    er_2 = [('ěr', '尔'), ('ěr', '耳'), ('ěr', '饵'), ('ěr', '迩'), ('ěr', '洱'), ('ěr', '珥'), ('ěr', '尒'), ('ěr', '尓'),
            ('ěr', '栮'), ('ěr', '毦'), ('ěr', '铒'), ('ěr', '衈'), ('ěr', '爾'), ('ěr', '鉺'), ('ěr', '餌'), ('ěr', '駬'),
            ('ěr', '薾'), ('ěr', '邇'), ('ěr', '趰'), ('ěr', '㚷'), ('ěr', '䌺'), ('ěr', '㢽'), ('ěr', '䋙')]
    er_3 = [('èr', '二'), ('èr', '贰'), ('èr', '弍'), ('èr', '弐'), ('èr', '佴'), ('èr', '刵'), ('èr', '咡'), ('èr', '貮'),
            ('èr', '貳'), ('èr', '誀'), ('èr', '樲'), ('èr', '髶'), ('èr', '㛅'), ('èr', '䏪'), ('èr', '䎶'), ('èr', '䣵'),
            ('èr', '㒃')]
    fa_1 = [('fā', '发'), ('fā', '冹'), ('fā', '沷'), ('fā', '発'), ('fā', '發'), ('fā', '彂'), ('fā', '醗'), ('fā', '醱')]
    fa_2 = [('fá', '罚'), ('fá', '乏'), ('fá', '伐'), ('fá', '阀'), ('fá', '筏'), ('fá', '姂'), ('fá', '坺'), ('fá', '垡'),
            ('fá', '浌'), ('fá', '疺'), ('fá', '茷'), ('fá', '栰'), ('fá', '笩'), ('fá', '傠'), ('fá', '瞂'), ('fá', '罰'),
            ('fá', '閥'), ('fá', '墢'), ('fá', '罸'), ('fá', '橃'), ('fá', '藅'), ('fá', '㕹'), ('fá', '㘺'), ('fá', '䇅'),
            ('fá', '䣹')]
    fa_3 = [('fǎ', '法'), ('fǎ', '佱'), ('fǎ', '峜'), ('fǎ', '砝'), ('fǎ', '鍅'), ('fǎ', '灋'), ('fǎ', '㳒'), ('fǎ', '䂲')]
    fa_4 = [('fà', '珐'), ('fà', '琺'), ('fà', '髪'), ('fà', '蕟'), ('fà', '髮'), ('fà', '䒥'), ('fà', '㛲')]
    fan_1 = [('fān', '翻'), ('fān', '番'), ('fān', '拚'), ('fān', '帆'), ('fān', '藩'), ('fān', '幡'), ('fān', '忛'),
             ('fān', '犿'), ('fān', '畨'), ('fān', '勫'), ('fān', '噃'), ('fān', '嬏'), ('fān', '憣'), ('fān', '旙'),
             ('fān', '旛'), ('fān', '繙'), ('fān', '轓'), ('fān', '颿'), ('fān', '籓'), ('fān', '飜'), ('fān', '鱕')]
    fan_2 = [('fán', '凡'), ('fán', '烦'), ('fán', '繁'), ('fán', '樊'), ('fán', '蕃'), ('fán', '矾'), ('fán', '燔'),
             ('fán', '凢'), ('fán', '凣'), ('fán', '匥'), ('fán', '杋'), ('fán', '柉'), ('fán', '籵'), ('fán', '钒'),
             ('fán', '舤'), ('fán', '舧'), ('fán', '笲'), ('fán', '釩'), ('fán', '棥'), ('fán', '煩'), ('fán', '緐'),
             ('fán', '墦'), ('fán', '璠'), ('fán', '膰'), ('fán', '薠'), ('fán', '襎'), ('fán', '羳'), ('fán', '蹯'),
             ('fán', '瀿'), ('fán', '礬'), ('fán', '蘩'), ('fán', '鐇'), ('fán', '鐢'), ('fán', '蠜'), ('fán', '鷭'),
             ('fán', '㠶'), ('fán', '䀀'), ('fán', '䀟'), ('fán', '䡊'), ('fán', '䋣'), ('fán', '䋦'), ('fán', '䭵'),
             ('fán', '㺕'), ('fán', '䌓'), ('fán', '䉒'), ('fán', '䊩'), ('fán', '䕰'), ('fán', '㸋'), ('fán', '䪛'),
             ('fán', '䪤'), ('fán', '䮳'), ('fán', '䫶')]
    fan_3 = [('fǎn', '反'), ('fǎn', '返'), ('fǎn', '払'), ('fǎn', '仮'), ('fǎn', '橎'), ('fǎn', '䛀')]
    fan_4 = [('fàn', '饭'), ('fàn', '范'), ('fàn', '犯'), ('fàn', '泛'), ('fàn', '贩'), ('fàn', '梵'), ('fàn', '氾'),
             ('fàn', '奿'), ('fàn', '汎'), ('fàn', '畈'), ('fàn', '訉'), ('fàn', '軓'), ('fàn', '婏'), ('fàn', '桳'),
             ('fàn', '盕'), ('fàn', '笵'), ('fàn', '販'), ('fàn', '軬'), ('fàn', '飯'), ('fàn', '飰'), ('fàn', '滼'),
             ('fàn', '嬎'), ('fàn', '範'), ('fàn', '輽'), ('fàn', '瀪'), ('fàn', '㕨'), ('fàn', '㤆'), ('fàn', '䒦'),
             ('fàn', '㳎'), ('fàn', '㼝'), ('fàn', '㽹'), ('fàn', '㝃'), ('fàn', '㴀'), ('fàn', '䣲'), ('fàn', '㾱'),
             ('fàn', '䐪'), ('fàn', '䉊'), ('fàn', '㜶'), ('fàn', '㶗')]
    fang_1 = [('fāng', '方'), ('fāng', '芳'), ('fāng', '坊'), ('fāng', '邡'), ('fāng', '匚'), ('fāng', '汸'), ('fāng', '枋'),
              ('fāng', '牥'), ('fāng', '祊'), ('fāng', '钫'), ('fāng', '淓'), ('fāng', '蚄'), ('fāng', '堏'), ('fāng', '趽'),
              ('fāng', '鈁'), ('fāng', '錺'), ('fāng', '鴋')]
    fang_2 = [('fáng', '房'), ('fáng', '防'), ('fáng', '妨'), ('fáng', '肪'), ('fáng', '鲂'), ('fáng', '埅'), ('fáng', '魴'),
              ('fáng', '㤃'), ('fáng', '䉊')]
    fang_3 = [('fǎng', '访'), ('fǎng', '仿'), ('fǎng', '彷'), ('fǎng', '纺'), ('fǎng', '舫'), ('fǎng', '昉'), ('fǎng', '昘'),
              ('fǎng', '瓬'), ('fǎng', '眆'), ('fǎng', '倣'), ('fǎng', '旊'), ('fǎng', '眪'), ('fǎng', '紡'), ('fǎng', '訪'),
              ('fǎng', '髣'), ('fǎng', '鶭'), ('fǎng', '㑂'), ('fǎng', '㕫'), ('fǎng', '㧍'), ('fǎng', '䢍'), ('fǎng', '䦈'),
              ('fǎng', '㯐'), ('fǎng', '䲱')]
    fang_4 = [('fàng', '放')]
    fei_1 = [('fēi', '非'), ('fēi', '飞'), ('fēi', '菲'), ('fēi', '妃'), ('fēi', '啡'), ('fēi', '绯'), ('fēi', '霏'),
             ('fēi', '扉'), ('fēi', '蜚'), ('fēi', '飛'), ('fēi', '婓'), ('fēi', '婔'), ('fēi', '渄'), ('fēi', '暃'),
             ('fēi', '猆'), ('fēi', '靟'), ('fēi', '裶'), ('fēi', '緋'), ('fēi', '鲱'), ('fēi', '餥'), ('fēi', '馡'),
             ('fēi', '騑'), ('fēi', '騛'), ('fēi', '鯡'), ('fēi', '飝'), ('fēi', '㐟'), ('fēi', '䩁')]
    fei_2 = [('féi', '肥'), ('féi', '淝'), ('féi', '腓'), ('féi', '蜰'), ('féi', '䈈')]
    fei_3 = [('fěi', '匪'), ('fěi', '斐'), ('fěi', '翡'), ('fěi', '诽'), ('fěi', '悱'), ('fěi', '篚'), ('fěi', '朏'),
             ('fěi', '胐'), ('fěi', '奜'), ('fěi', '棐'), ('fěi', '榧'), ('fěi', '蕜'), ('fěi', '誹'), ('fěi', '䨽'),
             ('fěi', '䨾'), ('fěi', '㥱'), ('fěi', '䕁')]
    fei_4 = [('fèi', '费'), ('fèi', '废'), ('fèi', '肺'), ('fèi', '沸'), ('fèi', '吠'), ('fèi', '狒'), ('fèi', '犻'),
             ('fèi', '芾'), ('fèi', '杮'), ('fèi', '柹'), ('fèi', '胏'), ('fèi', '昲'), ('fèi', '胇'), ('fèi', '俷'),
             ('fèi', '剕'), ('fèi', '厞'), ('fèi', '疿'), ('fèi', '砩'), ('fèi', '陫'), ('fèi', '屝'), ('fèi', '笰'),
             ('fèi', '萉'), ('fèi', '廃'), ('fèi', '費'), ('fèi', '痱'), ('fèi', '镄'), ('fèi', '廢'), ('fèi', '曊'),
             ('fèi', '橃'), ('fèi', '橨'), ('fèi', '癈'), ('fèi', '鼣'), ('fèi', '濷'), ('fèi', '蟦'), ('fèi', '櫠'),
             ('fèi', '鐨'), ('fèi', '靅'), ('fèi', '㓈'), ('fèi', '㔗'), ('fèi', '㸬'), ('fèi', '䀟'), ('fèi', '䍨'),
             ('fèi', '䑔'), ('fèi', '㭭'), ('fèi', '㹃'), ('fèi', '䛍'), ('fèi', '㾱'), ('fèi', '㩌'), ('fèi', '㵒'),
             ('fèi', '䞳'), ('fèi', '䠊'), ('fèi', '䤵'), ('fèi', '䒈'), ('fèi', '䕠'), ('fèi', '䰁'), ('fèi', '䚨'),
             ('fèi', '䉬'), ('fèi', '䆏')]
    fen_1 = [('fēn', '分'), ('fēn', '纷'), ('fēn', '吩'), ('fēn', '芬'), ('fēn', '氛'), ('fēn', '玢'), ('fēn', '棻'),
             ('fēn', '帉'), ('fēn', '昐'), ('fēn', '砏'), ('fēn', '竕'), ('fēn', '衯'), ('fēn', '紛'), ('fēn', '翂'),
             ('fēn', '梤'), ('fēn', '訜'), ('fēn', '躮'), ('fēn', '酚'), ('fēn', '鈖'), ('fēn', '雰'), ('fēn', '馚'),
             ('fēn', '朆'), ('fēn', '餴'), ('fēn', '饙')]
    fen_2 = [('fén', '坟'), ('fén', '焚'), ('fén', '汾'), ('fén', '棼'), ('fén', '坆'), ('fén', '妢'), ('fén', '岎'),
             ('fén', '朌'), ('fén', '枌'), ('fén', '炃'), ('fén', '羒'), ('fén', '蚠'), ('fén', '蚡'), ('fén', '蒶'),
             ('fén', '隫'), ('fén', '墳'), ('fén', '幩'), ('fén', '濆'), ('fén', '獖'), ('fén', '蕡'), ('fén', '魵'),
             ('fén', '鳻'), ('fén', '橨'), ('fén', '燌'), ('fén', '燓'), ('fén', '豮'), ('fén', '鼢'), ('fén', '羵'),
             ('fén', '鼖'), ('fén', '豶'), ('fén', '轒'), ('fén', '鐼'), ('fén', '馩'), ('fén', '黂'), ('fén', '㸮'),
             ('fén', '㷊'), ('fén', '䯨'), ('fén', '䩿'), ('fén', '䴅')]
    fen_3 = [('fěn', '粉'), ('fěn', '黺'), ('fěn', '㥹')]
    fen_4 = [('fèn', '份'), ('fèn', '奋'), ('fèn', '愤'), ('fèn', '忿'), ('fèn', '粪'), ('fèn', '坋'), ('fèn', '弅'),
             ('fèn', '秎'), ('fèn', '偾'), ('fèn', '僨'), ('fèn', '憤'), ('fèn', '瞓'), ('fèn', '奮'), ('fèn', '膹'),
             ('fèn', '糞'), ('fèn', '鲼'), ('fèn', '瀵'), ('fèn', '鱝'), ('fèn', '䢍'), ('fèn', '䀟'), ('fèn', '㖹'),
             ('fèn', '㻞'), ('fèn', '㮥'), ('fèn', '㱵'), ('fèn', '㿎')]
    feng_1 = [('fēng', '风'), ('fēng', '封'), ('fēng', '丰'), ('fēng', '峰'), ('fēng', '疯'), ('fēng', '锋'), ('fēng', '枫'),
              ('fēng', '蜂'), ('fēng', '烽'), ('fēng', '酆'), ('fēng', '仹'), ('fēng', '凨'), ('fēng', '凬'), ('fēng', '妦'),
              ('fēng', '沣'), ('fēng', '沨'), ('fēng', '凮'), ('fēng', '炐'), ('fēng', '盽'), ('fēng', '砜'), ('fēng', '風'),
              ('fēng', '埄'), ('fēng', '峯'), ('fēng', '莑'), ('fēng', '偑'), ('fēng', '桻'), ('fēng', '琒'), ('fēng', '堼'),
              ('fēng', '崶'), ('fēng', '渢'), ('fēng', '猦'), ('fēng', '葑'), ('fēng', '楓'), ('fēng', '犎'), ('fēng', '熢'),
              ('fēng', '瘋'), ('fēng', '碸'), ('fēng', '僼'), ('fēng', '篈'), ('fēng', '鄷'), ('fēng', '鋒'), ('fēng', '檒'),
              ('fēng', '豐'), ('fēng', '鎽'), ('fēng', '鏠'), ('fēng', '寷'), ('fēng', '灃'), ('fēng', '蘴'), ('fēng', '霻'),
              ('fēng', '蠭'), ('fēng', '靊'), ('fēng', '飌'), ('fēng', '麷'), ('fēng', '䒠'), ('fēng', '㷭')]
    feng_2 = [('féng', '冯'), ('féng', '逢'), ('féng', '缝'), ('féng', '夆'), ('féng', '浲'), ('féng', '堸'), ('féng', '溄'),
              ('féng', '馮'), ('féng', '摓'), ('féng', '漨'), ('féng', '綘'), ('féng', '艂'), ('féng', '縫'), ('féng', '䏎'),
              ('féng', '㦀'), ('féng', '䙜'), ('féng', '㵯'), ('féng', '䩼')]
    feng_3 = [('fěng', '讽'), ('fěng', '覂'), ('fěng', '唪'), ('fěng', '諷'), ('fěng', '䟪'), ('fěng', '䩬')]
    feng_4 = [('fèng', '凤'), ('fèng', '奉'), ('fèng', '俸'), ('fèng', '湗'), ('fèng', '焨'), ('fèng', '煈'), ('fèng', '赗'),
              ('fèng', '鳯'), ('fèng', '鳳'), ('fèng', '鴌'), ('fèng', '賵'), ('fèng', '㡝'), ('fèng', '䵄')]
    fo_1 = [('fó', '佛'), ('fó', '仏'), ('fó', '仸'), ('fó', '坲'), ('fó', '梻'), ('fó', '㤇')]
    fou_1 = []
    fou_2 = [('fóu', '紑'), ('fóu', '䳕')]
    fou_3 = [('fǒu', '不'), ('fǒu', '否'), ('fǒu', '缶'), ('fǒu', '妚'), ('fǒu', '炰'), ('fǒu', '缹'), ('fǒu', '缻'),
             ('fǒu', '殕'), ('fǒu', '雬'), ('fǒu', '鴀'), ('fǒu', '㓡'), ('fǒu', '䬏')]
    fu_1 = [('fū', '夫'), ('fū', '肤'), ('fū', '敷'), ('fū', '孵'), ('fū', '趺'), ('fū', '伕'), ('fū', '邞'), ('fū', '呋'),
            ('fū', '妋'), ('fū', '抙'), ('fū', '姇'), ('fū', '玞'), ('fū', '怤'), ('fū', '柎'), ('fū', '砆'), ('fū', '胕'),
            ('fū', '荂'), ('fū', '衭'), ('fū', '娐'), ('fū', '尃'), ('fū', '捊'), ('fū', '荴'), ('fū', '旉'), ('fū', '紨'),
            ('fū', '酜'), ('fū', '麸'), ('fū', '稃'), ('fū', '跗'), ('fū', '鈇'), ('fū', '筟'), ('fū', '綒'), ('fū', '鄜'),
            ('fū', '粰'), ('fū', '蓲'), ('fū', '膚'), ('fū', '鳺'), ('fū', '麩'), ('fū', '糐'), ('fū', '麬'), ('fū', '麱'),
            ('fū', '懯'), ('fū', '璷'), ('fū', '㕊')]
    fu_2 = [('fú', '服'), ('fú', '佛'), ('fú', '福'), ('fú', '符'), ('fú', '伏'), ('fú', '扶'), ('fú', '浮'), ('fú', '幅'),
            ('fú', '弗'), ('fú', '芙'), ('fú', '拂'), ('fú', '袱'), ('fú', '俘'), ('fú', '辐'), ('fú', '孚'), ('fú', '蝠'),
            ('fú', '宓'), ('fú', '匐'), ('fú', '凫'), ('fú', '怫'), ('fú', '苻'), ('fú', '氟'), ('fú', '茯'), ('fú', '郛'),
            ('fú', '莩'), ('fú', '蚨'), ('fú', '涪'), ('fú', '黻'), ('fú', '乀'), ('fú', '巿'), ('fú', '払'), ('fú', '甶'),
            ('fú', '刜'), ('fú', '芣'), ('fú', '芾'), ('fú', '咈'), ('fú', '岪'), ('fú', '帗'), ('fú', '枎'), ('fú', '泭'),
            ('fú', '绂'), ('fú', '绋'), ('fú', '茀'), ('fú', '垘'), ('fú', '枹'), ('fú', '柫'), ('fú', '柭'), ('fú', '洑'),
            ('fú', '炥'), ('fú', '玸'), ('fú', '畉'), ('fú', '畐'), ('fú', '祓'), ('fú', '罘'), ('fú', '韨'), ('fú', '鳬'),
            ('fú', '哹'), ('fú', '垺'), ('fú', '栿'), ('fú', '畗'), ('fú', '砩'), ('fú', '袚'), ('fú', '桴'), ('fú', '烰'),
            ('fú', '琈'), ('fú', '笰'), ('fú', '紱'), ('fú', '紼'), ('fú', '翇'), ('fú', '艴'), ('fú', '菔'), ('fú', '虙'),
            ('fú', '棴'), ('fú', '絥'), ('fú', '罦'), ('fú', '葍'), ('fú', '綍'), ('fú', '艀'), ('fú', '蜉'), ('fú', '鉘'),
            ('fú', '鉜'), ('fú', '颫'), ('fú', '鳧'), ('fú', '榑'), ('fú', '稪'), ('fú', '箁'), ('fú', '箙'), ('fú', '豧'),
            ('fú', '韍'), ('fú', '颰'), ('fú', '幞'), ('fú', '澓'), ('fú', '髴'), ('fú', '鴔'), ('fú', '諨'), ('fú', '踾'),
            ('fú', '輻'), ('fú', '鮄'), ('fú', '癁'), ('fú', '襆'), ('fú', '鮲'), ('fú', '襥'), ('fú', '鵩'), ('fú', '纀'),
            ('fú', '鶝'), ('fú', '㐲'), ('fú', '㞎'), ('fú', '㚕'), ('fú', '㤔'), ('fú', '㫙'), ('fú', '䃽'), ('fú', '㪄'),
            ('fú', '䘠'), ('fú', '㟊'), ('fú', '䍖'), ('fú', '㐢'), ('fú', '䑧'), ('fú', '䡍'), ('fú', '䌿'), ('fú', '䞞'),
            ('fú', '㜑'), ('fú', '㡝'), ('fú', '䟮'), ('fú', '㾱'), ('fú', '䍌'), ('fú', '㠅'), ('fú', '䋹'), ('fú', '䔰'),
            ('fú', '䨗'), ('fú', '䒀'), ('fú', '䕎'), ('fú', '䵾'), ('fú', '䪙'), ('fú', '䭮'), ('fú', '䥤'), ('fú', '䵗')]
    fu_3 = [('fǔ', '府'), ('fǔ', '抚'), ('fǔ', '甫'), ('fǔ', '腐'), ('fǔ', '辅'), ('fǔ', '俯'), ('fǔ', '斧'), ('fǔ', '脯'),
            ('fǔ', '腑'), ('fǔ', '釜'), ('fǔ', '阝'), ('fǔ', '拊'), ('fǔ', '黼'), ('fǔ', '呒'), ('fǔ', '乶'), ('fǔ', '弣'),
            ('fǔ', '俌'), ('fǔ', '俛'), ('fǔ', '郙'), ('fǔ', '釡'), ('fǔ', '捬'), ('fǔ', '椨'), ('fǔ', '焤'), ('fǔ', '盙'),
            ('fǔ', '滏'), ('fǔ', '蜅'), ('fǔ', '輔'), ('fǔ', '嘸'), ('fǔ', '撫'), ('fǔ', '頫'), ('fǔ', '鬴'), ('fǔ', '簠'),
            ('fǔ', '㕮'), ('fǔ', '㓡'), ('fǔ', '䓛'), ('fǔ', '䋨'), ('fǔ', '䗄'), ('fǔ', '䩉'), ('fǔ', '䫍'), ('fǔ', '䌗'),
            ('fǔ', '䫝'), ('fǔ', '䯽'), ('fǔ', '䳝')]
    fu_4 = [('fù', '父'), ('fù', '复'), ('fù', '妇'), ('fù', '负'), ('fù', '副'), ('fù', '富'), ('fù', '付'), ('fù', '附'),
            ('fù', '傅'), ('fù', '咐'), ('fù', '覆'), ('fù', '赴'), ('fù', '腹'), ('fù', '赋'), ('fù', '缚'), ('fù', '阜'),
            ('fù', '馥'), ('fù', '驸'), ('fù', '讣'), ('fù', '鲋'), ('fù', '褔'), ('fù', '坿'), ('fù', '彿'), ('fù', '竎'),
            ('fù', '峊'), ('fù', '祔'), ('fù', '訃'), ('fù', '負'), ('fù', '蚥'), ('fù', '袝'), ('fù', '偩'), ('fù', '冨'),
            ('fù', '婏'), ('fù', '婦'), ('fù', '蚹'), ('fù', '媍'), ('fù', '復'), ('fù', '秿'), ('fù', '萯'), ('fù', '蛗'),
            ('fù', '覄'), ('fù', '詂'), ('fù', '椱'), ('fù', '禣'), ('fù', '複'), ('fù', '赙'), ('fù', '緮'), ('fù', '蕧'),
            ('fù', '蝜'), ('fù', '蝮'), ('fù', '賦'), ('fù', '駙'), ('fù', '嬔'), ('fù', '縛'), ('fù', '輹'), ('fù', '鮒'),
            ('fù', '賻'), ('fù', '鍑'), ('fù', '鍢'), ('fù', '鳆'), ('fù', '鰒'), ('fù', '㳇'), ('fù', '㝿'), ('fù', '㚆'),
            ('fù', '䟔'), ('fù', '㤱'), ('fù', '㾈'), ('fù', '䂤'), ('fù', '䎅'), ('fù', '䞜'), ('fù', '㙏'), ('fù', '㷆'),
            ('fù', '䠵'), ('fù', '䧞'), ('fù', '䬪'), ('fù', '㗘'), ('fù', '䞯'), ('fù', '䭸'), ('fù', '䯱'), ('fù', '㬼'),
            ('fù', '䝾'), ('fù', '䞸'), ('fù', '㵗'), ('fù', '䦣'), ('fù', '䒄'), ('fù', '䮛'), ('fù', '㽬'), ('fù', '䒇'),
            ('fù', '䘀'), ('fù', '䘄'), ('fù', '䨱')]
    ga_1 = [('gā', '夹'), ('gā', '咖'), ('gā', '嘎'), ('gā', '伽'), ('gā', '旮'), ('gā', '夾'), ('gā', '嘠')]
    ga_2 = [('gá', '噶'), ('gá', '钆'), ('gá', '軋'), ('gá', '尜'), ('gá', '釓'), ('gá', '錷')]
    ga_3 = [('gǎ', '尕'), ('gǎ', '玍'), ('gǎ', '朒')]
    ga_4 = [('gà', '尬'), ('gà', '魀')]
    gai_1 = [('gāi', '该'), ('gāi', '陔'), ('gāi', '垓'), ('gāi', '侅'), ('gāi', '郂'), ('gāi', '姟'), ('gāi', '峐'),
             ('gāi', '荄'), ('gāi', '晐'), ('gāi', '赅'), ('gāi', '畡'), ('gāi', '祴'), ('gāi', '絯'), ('gāi', '隑'),
             ('gāi', '該'), ('gāi', '豥'), ('gāi', '賅'), ('gāi', '賌'), ('gāi', '㱾'), ('gāi', '䀭')]
    gai_2 = [('gǎi', '改'), ('gǎi', '忋'), ('gǎi', '絠'), ('gǎi', '䪱')]
    gai_3 = [('gài', '概'), ('gài', '盖'), ('gài', '丐'), ('gài', '溉'), ('gài', '芥'), ('gài', '钙'), ('gài', '乢'),
             ('gài', '匃'), ('gài', '匄'), ('gài', '杚'), ('gài', '摡'), ('gài', '葢'), ('gài', '鈣'), ('gài', '戤'),
             ('gài', '槩'), ('gài', '蓋'), ('gài', '漑'), ('gài', '槪'), ('gài', '瓂'), ('gài', '㧉'), ('gài', '䏗'),
             ('gài', '㮣'), ('gài', '㕢')]
    gan_1 = [('gān', '干'), ('gān', '甘'), ('gān', '乾'), ('gān', '杆'), ('gān', '肝'), ('gān', '尴'), ('gān', '竿'),
             ('gān', '柑'), ('gān', '忓'), ('gān', '迀'), ('gān', '攼'), ('gān', '玕'), ('gān', '咁'), ('gān', '坩'),
             ('gān', '泔'), ('gān', '矸'), ('gān', '苷'), ('gān', '玵'), ('gān', '疳'), ('gān', '酐'), ('gān', '粓'),
             ('gān', '凲'), ('gān', '尲'), ('gān', '筸'), ('gān', '漧'), ('gān', '鳱'), ('gān', '尶'), ('gān', '尷'),
             ('gān', '魐')]
    gan_2 = [('gǎn', '感'), ('gǎn', '敢'), ('gǎn', '赶'), ('gǎn', '橄'), ('gǎn', '秆'), ('gǎn', '仠'), ('gǎn', '芉'),
             ('gǎn', '皯'), ('gǎn', '衦'), ('gǎn', '桿'), ('gǎn', '稈'), ('gǎn', '澉'), ('gǎn', '趕'), ('gǎn', '擀'),
             ('gǎn', '澸'), ('gǎn', '篢'), ('gǎn', '簳'), ('gǎn', '鳡'), ('gǎn', '鱤'), ('gǎn', '䇞'), ('gǎn', '㺂'),
             ('gǎn', '䔈'), ('gǎn', '䵟'), ('gǎn', '䃭'), ('gǎn', '䤗')]
    gan_3 = [('gàn', '赣'), ('gàn', '绀'), ('gàn', '淦'), ('gàn', '佄'), ('gàn', '旰'), ('gàn', '汵'), ('gàn', '盰'),
             ('gàn', '倝'), ('gàn', '凎'), ('gàn', '紺'), ('gàn', '詌'), ('gàn', '骭'), ('gàn', '幹'), ('gàn', '榦'),
             ('gàn', '檊'), ('gàn', '贑'), ('gàn', '贛'), ('gàn', '灨'), ('gàn', '㽏'), ('gàn', '䯎'), ('gàn', '䲺'),
             ('gàn', '补')]
    gang_1 = [('gāng', '刚'), ('gāng', '钢'), ('gāng', '纲'), ('gāng', '冈'), ('gāng', '扛'), ('gāng', '缸'), ('gāng', '罡'),
              ('gāng', '肛'), ('gāng', '冮'), ('gāng', '岡'), ('gāng', '牨'), ('gāng', '疘'), ('gāng', '矼'), ('gāng', '剛'),
              ('gāng', '堈'), ('gāng', '掆'), ('gāng', '釭'), ('gāng', '棡'), ('gāng', '犅'), ('gāng', '堽'), ('gāng', '摃'),
              ('gāng', '碙'), ('gāng', '綱'), ('gāng', '罁'), ('gāng', '鋼'), ('gāng', '鎠'), ('gāng', '㧏'), ('gāng', '㭎'),
              ('gāng', '䚗')]
    gang_2 = [('gǎng', '港'), ('gǎng', '岗'), ('gǎng', '犺'), ('gǎng', '崗'), ('gǎng', '㽘'), ('gǎng', '㟠'), ('gǎng', '㟵'),
              ('gǎng', '䴚')]
    gang_3 = [('gàng', '杠'), ('gàng', '戆'), ('gàng', '焵'), ('gàng', '焹'), ('gàng', '筻'), ('gàng', '槓'), ('gàng', '戅'),
              ('gàng', '戇')]
    gao_1 = [('gāo', '高'), ('gāo', '糕'), ('gāo', '膏'), ('gāo', '皋'), ('gāo', '羔'), ('gāo', '篙'), ('gāo', '睾'),
             ('gāo', '羙'), ('gāo', '皐'), ('gāo', '髙'), ('gāo', '臯'), ('gāo', '睪'), ('gāo', '槔'), ('gāo', '槹'),
             ('gāo', '獋'), ('gāo', '橰'), ('gāo', '餻'), ('gāo', '櫜'), ('gāo', '韟'), ('gāo', '鷎'), ('gāo', '鼛'),
             ('gāo', '鷱'), ('gāo', '䔌')]
    gao_2 = [('gǎo', '搞'), ('gǎo', '稿'), ('gǎo', '槁'), ('gǎo', '镐'), ('gǎo', '杲'), ('gǎo', '缟'), ('gǎo', '藁'),
             ('gǎo', '夰'), ('gǎo', '菒'), ('gǎo', '稁'), ('gǎo', '槀'), ('gǎo', '稾'), ('gǎo', '縞'), ('gǎo', '檺'),
             ('gǎo', '藳'), ('gǎo', '鎬'), ('gǎo', '㚏'), ('gǎo', '㚖'), ('gǎo', '㾸'), ('gǎo', '䗣')]
    gao_3 = [('gào', '告'), ('gào', '诰'), ('gào', '郜'), ('gào', '吿'), ('gào', '勂'), ('gào', '峼'), ('gào', '祮'),
             ('gào', '祰'), ('gào', '锆'), ('gào', '筶'), ('gào', '禞'), ('gào', '誥'), ('gào', '鋯'), ('gào', '䨢')]
    ge_1 = [('gē', '哥'), ('gē', '歌'), ('gē', '割'), ('gē', '戈'), ('gē', '搁'), ('gē', '胳'), ('gē', '咯'), ('gē', '鸽'),
            ('gē', '疙'), ('gē', '仡'), ('gē', '纥'), ('gē', '圪'), ('gē', '扢'), ('gē', '犵'), ('gē', '戓'), ('gē', '肐'),
            ('gē', '牫'), ('gē', '紇'), ('gē', '饹'), ('gē', '袼'), ('gē', '彁'), ('gē', '滒'), ('gē', '戨'), ('gē', '鴚'),
            ('gē', '擱'), ('gē', '謌'), ('gē', '鴿'), ('gē', '鎶'), ('gē', '㢦')]
    ge_2 = [('gé', '格'), ('gé', '革'), ('gé', '隔'), ('gé', '阁'), ('gé', '葛'), ('gé', '蛤'), ('gé', '骼'), ('gé', '鬲'),
            ('gé', '颌'), ('gé', '嗝'), ('gé', '呄'), ('gé', '佫'), ('gé', '佮'), ('gé', '匌'), ('gé', '挌'), ('gé', '敋'),
            ('gé', '愅'), ('gé', '猲'), ('gé', '臵'), ('gé', '蛒'), ('gé', '裓'), ('gé', '塥'), ('gé', '滆'), ('gé', '觡'),
            ('gé', '搿'), ('gé', '槅'), ('gé', '膈'), ('gé', '閣'), ('gé', '閤'), ('gé', '獦'), ('gé', '镉'), ('gé', '鞈'),
            ('gé', '韐'), ('gé', '臈'), ('gé', '諽'), ('gé', '輵'), ('gé', '鮥'), ('gé', '鮯'), ('gé', '櫊'), ('gé', '鎑'),
            ('gé', '鎘'), ('gé', '韚'), ('gé', '轕'), ('gé', '鞷'), ('gé', '騔'), ('gé', '㠷'), ('gé', '㝓'), ('gé', '䢔'),
            ('gé', '㦴'), ('gé', '㪾'), ('gé', '㭘'), ('gé', '䆟'), ('gé', '㗆'), ('gé', '䛋'), ('gé', '䩐'), ('gé', '㨰'),
            ('gé', '䐙'), ('gé', '䪺'), ('gé', '㵧'), ('gé', '䈓'), ('gé', '㷴'), ('gé', '䗘'), ('gé', '䛿'), ('gé', '䨣'),
            ('gé', '䫦'), ('gé', '䘁'), ('gé', '䪂'), ('gé', '䕻')]
    ge_3 = [('gě', '合'), ('gě', '盖'), ('gě', '舸'), ('gě', '哿'), ('gě', '笴'), ('gě', '嘅'), ('gě', '嗰'), ('gě', '蓋'),
            ('gě', '鲄')]
    ge_4 = [('gè', '个'), ('gè', '各'), ('gè', '亇'), ('gè', '吤'), ('gè', '茖'), ('gè', '虼'), ('gè', '個'), ('gè', '硌'),
            ('gè', '铬'), ('gè', '箇'), ('gè', '鉻'), ('gè', '䧄')]
    gei_1 = [('gěi', '给'), ('gěi', '給')]
    gen_1 = [('gēn', '跟'), ('gēn', '根')]
    gen_2 = [('gén', '哏')]
    gen_3 = [('gěn', '䫀')]
    gen_4 = [('gèn', '亘'), ('gèn', '艮'), ('gèn', '亙'), ('gèn', '茛'), ('gèn', '揯'), ('gèn', '搄'), ('gèn', '㫔'),
             ('gèn', '㮓')]
    geng_1 = [('gēng', '更'), ('gēng', '耕'), ('gēng', '庚'), ('gēng', '羹'), ('gēng', '赓'), ('gēng', '刯'), ('gēng', '畊'),
              ('gēng', '浭'), ('gēng', '菮'), ('gēng', '椩'), ('gēng', '焿'), ('gēng', '絙'), ('gēng', '絚'), ('gēng', '鹒'),
              ('gēng', '緪'), ('gēng', '縆'), ('gēng', '羮'), ('gēng', '賡'), ('gēng', '鶊')]
    geng_2 = [('gěng', '颈'), ('gěng', '耿'), ('gěng', '哽'), ('gěng', '梗'), ('gěng', '埂'), ('gěng', '鲠'), ('gěng', '郠'),
              ('gěng', '峺'), ('gěng', '挭'), ('gěng', '绠'), ('gěng', '莄'), ('gěng', '綆'), ('gěng', '骾'), ('gěng', '鯁'),
              ('gěng', '䋁'), ('gěng', '㾘'), ('gěng', '䌄')]
    geng_3 = [('gèng', '堩'), ('gèng', '䨣'), ('gèng', '䱍'), ('gèng', '䱎'), ('gèng', '䱭'), ('gèng', '䱴')]
    gong_1 = [('gōng', '公'), ('gōng', '工'), ('gōng', '功'), ('gōng', '红'), ('gōng', '供'), ('gōng', '宫'), ('gōng', '攻'),
              ('gōng', '恭'), ('gōng', '弓'), ('gōng', '躬'), ('gōng', '龚'), ('gōng', '蚣'), ('gōng', '觥'), ('gōng', '肱'),
              ('gōng', '厷'), ('gōng', '杛'), ('gōng', '侊'), ('gōng', '糼'), ('gōng', '糿'), ('gōng', '紅'), ('gōng', '宮'),
              ('gōng', '匑'), ('gōng', '塨'), ('gōng', '幊'), ('gōng', '愩'), ('gōng', '躳'), ('gōng', '慐'), ('gōng', '匔'),
              ('gōng', '碽'), ('gōng', '篢'), ('gōng', '髸'), ('gōng', '觵'), ('gōng', '龏'), ('gōng', '龔'), ('gōng', '䢼')]
    gong_2 = [('gǒng', '拱'), ('gǒng', '巩'), ('gǒng', '汞'), ('gǒng', '珙'), ('gǒng', '廾'), ('gǒng', '拲'), ('gǒng', '栱'),
              ('gǒng', '輁'), ('gǒng', '澒'), ('gǒng', '銾'), ('gǒng', '鞏'), ('gǒng', '㫒'), ('gǒng', '㺬'), ('gǒng', '㤨'),
              ('gǒng', '㧬'), ('gǒng', '㭟'), ('gǒng', '㼦'), ('gǒng', '䂬'), ('gǒng', '䡗'), ('gǒng', '䱋')]
    gong_3 = [('gòng', '共'), ('gòng', '贡'), ('gòng', '羾'), ('gòng', '唝'), ('gòng', '貢'), ('gòng', '嗊'), ('gòng', '熕'),
              ('gòng', '㓋'), ('gòng', '䢚'), ('gòng', '䇨'), ('gòng', '䔈'), ('gòng', '㯯'), ('gòng', '㔶'), ('gòng', '补')]
    gou_1 = [('gōu', '句'), ('gōu', '勾'), ('gōu', '沟'), ('gōu', '拘'), ('gōu', '钩'), ('gōu', '篝'), ('gōu', '佝'),
             ('gōu', '芶'), ('gōu', '痀'), ('gōu', '袧'), ('gōu', '缑'), ('gōu', '鈎'), ('gōu', '溝'), ('gōu', '鉤'),
             ('gōu', '緱'), ('gōu', '褠'), ('gōu', '簼'), ('gōu', '鞲'), ('gōu', '韝'), ('gōu', '㽛'), ('gōu', '䑦')]
    gou_2 = [('gǒu', '狗'), ('gǒu', '苟'), ('gǒu', '岣'), ('gǒu', '枸'), ('gǒu', '玽'), ('gǒu', '耇'), ('gǒu', '耉'),
             ('gǒu', '笱'), ('gǒu', '耈'), ('gǒu', '蚼'), ('gǒu', '豿'), ('gǒu', '㺃')]
    gou_3 = [('gòu', '构'), ('gòu', '够'), ('gòu', '购'), ('gòu', '垢'), ('gòu', '彀'), ('gòu', '诟'), ('gòu', '媾'),
             ('gòu', '呴'), ('gòu', '坸'), ('gòu', '姤'), ('gòu', '冓'), ('gòu', '啂'), ('gòu', '夠'), ('gòu', '傋'),
             ('gòu', '訽'), ('gòu', '搆'), ('gòu', '詬'), ('gòu', '遘'), ('gòu', '雊'), ('gòu', '構'), ('gòu', '煹'),
             ('gòu', '觏'), ('gòu', '撀'), ('gòu', '糓'), ('gòu', '覯'), ('gòu', '購'), ('gòu', '㳶'), ('gòu', '㨌'),
             ('gòu', '䝭'), ('gòu', '㗕'), ('gòu', '㜌'), ('gòu', '㝅'), ('gòu', '㝤'), ('gòu', '䃓'), ('gòu', '䞀')]
    gu_1 = [('gū', '姑'), ('gū', '孤'), ('gū', '估'), ('gū', '咕'), ('gū', '辜'), ('gū', '呱'), ('gū', '箍'), ('gū', '沽'),
            ('gū', '菇'), ('gū', '鸪'), ('gū', '菰'), ('gū', '觚'), ('gū', '杚'), ('gū', '泒'), ('gū', '苽'), ('gū', '巬'),
            ('gū', '巭'), ('gū', '柧'), ('gū', '轱'), ('gū', '唂'), ('gū', '唃'), ('gū', '罛'), ('gū', '笟'), ('gū', '蛄'),
            ('gū', '蓇'), ('gū', '軱'), ('gū', '軲'), ('gū', '酤'), ('gū', '稒'), ('gū', '鈲'), ('gū', '磆'), ('gū', '箛'),
            ('gū', '嫴'), ('gū', '篐'), ('gū', '橭'), ('gū', '鮕'), ('gū', '鴣'), ('gū', '㠫'), ('gū', '㠬')]
    gu_2 = [('gú', '䜼'), ('gú', '䮩')]
    gu_3 = [('gǔ', '古'), ('gǔ', '股'), ('gǔ', '骨'), ('gǔ', '鼓'), ('gǔ', '谷'), ('gǔ', '贾'), ('gǔ', '蛊'), ('gǔ', '汩'),
            ('gǔ', '诂'), ('gǔ', '毂'), ('gǔ', '瞽'), ('gǔ', '牯'), ('gǔ', '嘏'), ('gǔ', '鹘'), ('gǔ', '夃'), ('gǔ', '扢'),
            ('gǔ', '抇'), ('gǔ', '罟'), ('gǔ', '羖'), ('gǔ', '逧'), ('gǔ', '钴'), ('gǔ', '傦'), ('gǔ', '啒'), ('gǔ', '淈'),
            ('gǔ', '脵'), ('gǔ', '嗗'), ('gǔ', '尳'), ('gǔ', '愲'), ('gǔ', '詁'), ('gǔ', '馉'), ('gǔ', '賈'), ('gǔ', '鈷'),
            ('gǔ', '鼔'), ('gǔ', '榖'), ('gǔ', '皷'), ('gǔ', '穀'), ('gǔ', '縎'), ('gǔ', '糓'), ('gǔ', '薣'), ('gǔ', '濲'),
            ('gǔ', '皼'), ('gǔ', '臌'), ('gǔ', '轂'), ('gǔ', '餶'), ('gǔ', '櫎'), ('gǔ', '瀔'), ('gǔ', '盬'), ('gǔ', '鶻'),
            ('gǔ', '蠱'), ('gǔ', '㒴'), ('gǔ', '㚉'), ('gǔ', '䀜'), ('gǔ', '㼋'), ('gǔ', '䀦'), ('gǔ', '䊺'), ('gǔ', '䓛'),
            ('gǔ', '䀰'), ('gǔ', '㾶'), ('gǔ', '䐨'), ('gǔ', '㯏'), ('gǔ', '䀇'), ('gǔ', '䅽'), ('gǔ', '䡩'), ('gǔ', '䍍'),
            ('gǔ', '䵻')]
    gu_4 = [('gù', '故'), ('gù', '顾'), ('gù', '固'), ('gù', '雇'), ('gù', '梏'), ('gù', '锢'), ('gù', '崓'), ('gù', '痼'),
            ('gù', '怘'), ('gù', '凅'), ('gù', '堌'), ('gù', '崮'), ('gù', '牿'), ('gù', '棝'), ('gù', '祻'), ('gù', '榾'),
            ('gù', '僱'), ('gù', '錮'), ('gù', '鲴'), ('gù', '鯝'), ('gù', '顧'), ('gù', '㽽'), ('gù', '㧽'), ('gù', '䓢'),
            ('gù', '䍛'), ('gù', '䶜')]
    gua_1 = [('guā', '括'), ('guā', '瓜'), ('guā', '刮'), ('guā', '呱'), ('guā', '胍'), ('guā', '栝'), ('guā', '桰'),
             ('guā', '铦'), ('guā', '鸹'), ('guā', '歄'), ('guā', '煱'), ('guā', '颪'), ('guā', '趏'), ('guā', '劀'),
             ('guā', '緺'), ('guā', '銛'), ('guā', '諣'), ('guā', '踻'), ('guā', '銽'), ('guā', '颳'), ('guā', '鴰'),
             ('guā', '騧'), ('guā', '䒷'), ('guā', '䯏')]
    gua_2 = []
    gua_3 = [('guǎ', '寡'), ('guǎ', '剐'), ('guǎ', '冎'), ('guǎ', '叧'), ('guǎ', '呙'), ('guǎ', '咼'), ('guǎ', '剮'),
             ('guǎ', '㒷'), ('guǎ', '䈑')]
    gua_4 = [('guà', '挂'), ('guà', '卦'), ('guà', '褂'), ('guà', '坬'), ('guà', '诖'), ('guà', '啩'), ('guà', '掛'),
             ('guà', '罣'), ('guà', '袿'), ('guà', '絓'), ('guà', '罫'), ('guà', '詿')]
    guai_1 = [('guāi', '乖')]
    guai_2 = [('guái', '叏')]
    guai_3 = [('guǎi', '拐'), ('guǎi', '枴'), ('guǎi', '柺'), ('guǎi', '罫'), ('guǎi', '箉')]
    guai_4 = [('guài', '怪'), ('guài', '夬'), ('guài', '恠'), ('guài', '㧔'), ('guài', '䊽'), ('guài', '䂯'), ('guài', '㷇'),
              ('guài', '㽇')]
    guan_1 = [('guān', '关'), ('guān', '官'), ('guān', '观'), ('guān', '冠'), ('guān', '棺'), ('guān', '矜'), ('guān', '莞'),
              ('guān', '纶'), ('guān', '倌'), ('guān', '涫'), ('guān', '鳏'), ('guān', '覌'), ('guān', '矝'), ('guān', '蒄'),
              ('guān', '窤'), ('guān', '閞'), ('guān', '綸'), ('guān', '関'), ('guān', '瘝'), ('guān', '癏'), ('guān', '観'),
              ('guān', '闗'), ('guān', '關'), ('guān', '鰥'), ('guān', '觀'), ('guān', '鱞')]
    guan_2 = [('guǎn', '管'), ('guǎn', '馆'), ('guǎn', '斡'), ('guǎn', '琯'), ('guǎn', '痯'), ('guǎn', '筦'), ('guǎn', '輨'),
              ('guǎn', '璭'), ('guǎn', '舘'), ('guǎn', '錧'), ('guǎn', '館'), ('guǎn', '鳤'), ('guǎn', '䏓'), ('guǎn', '䦎'),
              ('guǎn', '䘾'), ('guǎn', '䗆'), ('guǎn', '䩪'), ('guǎn', '䪀'), ('guǎn', '䲘'), ('guǎn', '兼')]
    guan_3 = [('guàn', '惯'), ('guàn', '贯'), ('guàn', '灌'), ('guàn', '罐'), ('guàn', '盥'), ('guàn', '鹳'), ('guàn', '掼'),
              ('guàn', '瓘'), ('guàn', '卝'), ('guàn', '毌'), ('guàn', '丱'), ('guàn', '泴'), ('guàn', '悺'), ('guàn', '淉'),
              ('guàn', '貫'), ('guàn', '悹'), ('guàn', '祼'), ('guàn', '慣'), ('guàn', '摜'), ('guàn', '潅'), ('guàn', '遦'),
              ('guàn', '樌'), ('guàn', '罆'), ('guàn', '雚'), ('guàn', '躀'), ('guàn', '鏆'), ('guàn', '爟'), ('guàn', '矔'),
              ('guàn', '礶'), ('guàn', '鑵'), ('guàn', '欟'), ('guàn', '鱹'), ('guàn', '鸛'), ('guàn', '䂯'), ('guàn', '㮡'),
              ('guàn', '㴦'), ('guàn', '䝺'), ('guàn', '䗰'), ('guàn', '䙛'), ('guàn', '䎚'), ('guàn', '䙮'), ('guàn', '䌯')]
    guang_1 = [('guāng', '光'), ('guāng', '潢'), ('guāng', '灮'), ('guāng', '炗'), ('guāng', '炚'), ('guāng', '炛'),
               ('guāng', '咣'), ('guāng', '垙'), ('guāng', '姯'), ('guāng', '挄'), ('guāng', '洸'), ('guāng', '茪'),
               ('guāng', '桄'), ('guāng', '烡'), ('guāng', '珖'), ('guāng', '胱'), ('guāng', '硄'), ('guāng', '僙'),
               ('guāng', '輄'), ('guāng', '銧'), ('guāng', '黆')]
    guang_2 = [('guǎng', '广'), ('guǎng', '犷'), ('guǎng', '広'), ('guǎng', '廣'), ('guǎng', '獷'), ('guǎng', '臩')]
    guang_3 = [('guàng', '逛'), ('guàng', '俇'), ('guàng', '臦'), ('guàng', '撗'), ('guàng', '㫛'), ('guàng', '㤮'),
               ('guàng', '䍍')]
    gui_1 = [('guī', '规'), ('guī', '归'), ('guī', '瑰'), ('guī', '龟'), ('guī', '闺'), ('guī', '圭'), ('guī', '傀'),
             ('guī', '皈'), ('guī', '珪'), ('guī', '硅'), ('guī', '妫'), ('guī', '鲑'), ('guī', '邽'), ('guī', '茥'),
             ('guī', '帰'), ('guī', '胿'), ('guī', '亀'), ('guī', '窐'), ('guī', '袿'), ('guī', '規'), ('guī', '媯'),
             ('guī', '廆'), ('guī', '椝'), ('guī', '郌'), ('guī', '嫢'), ('guī', '摫'), ('guī', '閨'), ('guī', '嬀'),
             ('guī', '嶲'), ('guī', '槣'), ('guī', '槻'), ('guī', '槼'), ('guī', '鳺'), ('guī', '璝'), ('guī', '瞡'),
             ('guī', '龜'), ('guī', '鮭'), ('guī', '巂'), ('guī', '歸'), ('guī', '雟'), ('guī', '鬶'), ('guī', '騩'),
             ('guī', '櫰'), ('guī', '櫷'), ('guī', '瓌'), ('guī', '蘬'), ('guī', '鬹'), ('guī', '䲅')]
    gui_2 = [('guǐ', '鬼'), ('guǐ', '轨'), ('guǐ', '诡'), ('guǐ', '癸'), ('guǐ', '晷'), ('guǐ', '簋'), ('guǐ', '宄'),
             ('guǐ', '氿'), ('guǐ', '朹'), ('guǐ', '庋'), ('guǐ', '佹'), ('guǐ', '匦'), ('guǐ', '陒'), ('guǐ', '垝'),
             ('guǐ', '姽'), ('guǐ', '恑'), ('guǐ', '攱'), ('guǐ', '軌'), ('guǐ', '庪'), ('guǐ', '祪'), ('guǐ', '軓'),
             ('guǐ', '匭'), ('guǐ', '湀'), ('guǐ', '蛫'), ('guǐ', '觤'), ('guǐ', '詭'), ('guǐ', '厬'), ('guǐ', '蟡'),
             ('guǐ', '㲹'), ('guǐ', '䃽'), ('guǐ', '䣀'), ('guǐ', '㧪'), ('guǐ', '㩻'), ('guǐ', '㸵'), ('guǐ', '㔳'),
             ('guǐ', '䍯'), ('guǐ', '䞨'), ('guǐ', '㨳'), ('guǐ', '䁛'), ('guǐ', '䤥'), ('guǐ', '䞈')]
    gui_3 = [('guì', '贵'), ('guì', '跪'), ('guì', '桂'), ('guì', '柜'), ('guì', '桧'), ('guì', '刽'), ('guì', '匮'),
             ('guì', '攰'), ('guì', '刿'), ('guì', '昋'), ('guì', '炅'), ('guì', '眭'), ('guì', '硊'), ('guì', '趹'),
             ('guì', '椢'), ('guì', '猤'), ('guì', '筀'), ('guì', '貴'), ('guì', '溎'), ('guì', '蓕'), ('guì', '匱'),
             ('guì', '瞆'), ('guì', '劊'), ('guì', '劌'), ('guì', '嶡'), ('guì', '撌'), ('guì', '槶'), ('guì', '螝'),
             ('guì', '樻'), ('guì', '檜'), ('guì', '瞶'), ('guì', '禬'), ('guì', '簂'), ('guì', '櫃'), ('guì', '癐'),
             ('guì', '襘'), ('guì', '鐀'), ('guì', '鳜'), ('guì', '鞼'), ('guì', '鑎'), ('guì', '鱖'), ('guì', '鱥'),
             ('guì', '㪈'), ('guì', '䇈'), ('guì', '㱦'), ('guì', '䐴'), ('guì', '䙆'), ('guì', '䌆'), ('guì', '䍷'),
             ('guì', '䝿'), ('guì', '㙺'), ('guì', '䳏'), ('guì', '䠩'), ('guì', '䯣'), ('guì', '䰎')]
    gun_1 = [('gǔn', '滚'), ('gǔn', '衮'), ('gǔn', '鲧'), ('gǔn', '丨'), ('gǔn', '惃'), ('gǔn', '硍'), ('gǔn', '绲'),
             ('gǔn', '袞'), ('gǔn', '辊'), ('gǔn', '蓘'), ('gǔn', '裷'), ('gǔn', '滾'), ('gǔn', '緄'), ('gǔn', '蔉'),
             ('gǔn', '磙'), ('gǔn', '緷'), ('gǔn', '輥'), ('gǔn', '鮌'), ('gǔn', '鯀'), ('gǔn', '㨰'), ('gǔn', '㫎'),
             ('gǔn', '䃂'), ('gǔn', '㙥'), ('gǔn', '䎾'), ('gǔn', '䙛'), ('gǔn', '䜇'), ('gǔn', '㯻')]
    gun_2 = [('gùn', '棍'), ('gùn', '睔'), ('gùn', '謴'), ('gùn', '㔳'), ('gùn', '䵪')]
    guo_1 = [('guō', '郭'), ('guō', '锅'), ('guō', '涡'), ('guō', '聒'), ('guō', '蝈'), ('guō', '呙'), ('guō', '咼'),
             ('guō', '咶'), ('guō', '埚'), ('guō', '啯'), ('guō', '堝'), ('guō', '崞'), ('guō', '渦'), ('guō', '猓'),
             ('guō', '楇'), ('guō', '鈛'), ('guō', '墎'), ('guō', '瘑'), ('guō', '嘓'), ('guō', '彉'), ('guō', '濄'),
             ('guō', '鍋'), ('guō', '彍'), ('guō', '蟈'), ('guō', '懖'), ('guō', '矌'), ('guō', '㗻')]
    guo_2 = [('guó', '国'), ('guó', '囗'), ('guó', '帼'), ('guó', '掴'), ('guó', '虢'), ('guó', '囯'), ('guó', '囶'),
             ('guó', '囻'), ('guó', '圀'), ('guó', '敋'), ('guó', '喐'), ('guó', '國'), ('guó', '腘'), ('guó', '摑'),
             ('guó', '幗'), ('guó', '慖'), ('guó', '漍'), ('guó', '聝'), ('guó', '蔮'), ('guó', '膕'), ('guó', '簂'),
             ('guó', '馘'), ('guó', '㕵'), ('guó', '㖪'), ('guó', '䂸'), ('guó', '䤋'), ('guó', '䐸'), ('guó', '䬎'),
             ('guó', '㚍'), ('guó', '㶁'), ('guó', '䆐')]
    guo_3 = [('guǒ', '果'), ('guǒ', '裹'), ('guǒ', '椁'), ('guǒ', '惈'), ('guǒ', '淉'), ('guǒ', '菓'), ('guǒ', '馃'),
             ('guǒ', '褁'), ('guǒ', '槨'), ('guǒ', '粿'), ('guǒ', '綶'), ('guǒ', '蜾'), ('guǒ', '輠'), ('guǒ', '餜'),
             ('guǒ', '櫎'), ('guǒ', '㞅'), ('guǒ', '䙨'), ('guǒ', '䴹')]
    guo_4 = [('guò', '过'), ('guò', '過'), ('guò', '腂'), ('guò', '鐹'), ('guò', '㳀')]
    ha_1 = [('hā', '哈'), ('hā', '虾'), ('hā', '紦'), ('hā', '铪'), ('hā', '鉿'), ('hā', '蝦')]
    ha_2 = [('há', '蛤')]
    ha_3 = [('hǎ', '奤')]
    hai_1 = [('hāi', '咳'), ('hāi', '嗨'), ('hāi', '咍')]
    hai_2 = [('hái', '还'), ('hái', '孩'), ('hái', '骸'), ('hái', '郂'), ('hái', '還'), ('hái', '嚡'), ('hái', '㜾'),
             ('hái', '䂤'), ('hái', '㨟'), ('hái', '䠹'), ('hái', '䯐'), ('hái', '䠽'), ('hái', '䱺')]
    hai_3 = [('hǎi', '海'), ('hǎi', '醢'), ('hǎi', '胲'), ('hǎi', '烸'), ('hǎi', '塰'), ('hǎi', '酼')]
    hai_4 = [('hài', '害'), ('hài', '骇'), ('hài', '亥'), ('hài', '妎'), ('hài', '拸'), ('hài', '氦'), ('hài', '猲'),
             ('hài', '絯'), ('hài', '嗐'), ('hài', '餀'), ('hài', '駭'), ('hài', '駴'), ('hài', '饚'), ('hài', '㱚'),
             ('hài', '㤥'), ('hài', '㧡'), ('hài', '䍖'), ('hài', '䇋'), ('hài', '㕢'), ('hài', '㺔'), ('hài', '㦟')]
    han_1 = [('hān', '酣'), ('hān', '憨'), ('hān', '鼾'), ('hān', '犴'), ('hān', '佄'), ('hān', '顸'), ('hān', '哻'),
             ('hān', '蚶'), ('hān', '頇'), ('hān', '嫨'), ('hān', '谽'), ('hān', '馠'), ('hān', '魽'), ('hān', '歛')]
    han_2 = [('hán', '寒'), ('hán', '含'), ('hán', '函'), ('hán', '韩'), ('hán', '涵'), ('hán', '邯'), ('hán', '邗'),
             ('hán', '汵'), ('hán', '肣'), ('hán', '凾'), ('hán', '虷'), ('hán', '唅'), ('hán', '圅'), ('hán', '娢'),
             ('hán', '浛'), ('hán', '笒'), ('hán', '崡'), ('hán', '晗'), ('hán', '梒'), ('hán', '焓'), ('hán', '琀'),
             ('hán', '嵅'), ('hán', '椷'), ('hán', '甝'), ('hán', '筨'), ('hán', '蜬'), ('hán', '澏'), ('hán', '鋡'),
             ('hán', '韓'), ('hán', '㶰'), ('hán', '㟏'), ('hán', '㟔'), ('hán', '㖤'), ('hán', '㙈'), ('hán', '㼨'),
             ('hán', '㙔'), ('hán', '㮀'), ('hán', '䎏'), ('hán', '䈄'), ('hán', '䗙'), ('hán', '䤴'), ('hán', '䨡'),
             ('hán', '䶃'), ('hán', '䥁'), ('hán', '䮧')]
    han_3 = [('hǎn', '喊'), ('hǎn', '罕'), ('hǎn', '丆'), ('hǎn', '浫'), ('hǎn', '豃'), ('hǎn', '闞'), ('hǎn', '䍐'),
             ('hǎn', '䍑'), ('hǎn', '䓍'), ('hǎn', '䦈'), ('hǎn', '䓿'), ('hǎn', '㺖'), ('hǎn', '䛞'), ('hǎn', '㵎'),
             ('hǎn', '㙳'), ('hǎn', '㘎'), ('hǎn', '㸁'), ('hǎn', '㽉'), ('hǎn', '㘕'), ('hǎn', '㘚')]
    han_4 = [('hàn', '汉'), ('hàn', '厂'), ('hàn', '汗'), ('hàn', '翰'), ('hàn', '憾'), ('hàn', '旱'), ('hàn', '颔'),
             ('hàn', '悍'), ('hàn', '撼'), ('hàn', '瀚'), ('hàn', '捍'), ('hàn', '焊'), ('hàn', '菡'), ('hàn', '仠'),
             ('hàn', '厈'), ('hàn', '屽'), ('hàn', '忓'), ('hàn', '扞'), ('hàn', '闬'), ('hàn', '攼'), ('hàn', '旰'),
             ('hàn', '垾'), ('hàn', '涆'), ('hàn', '猂'), ('hàn', '莟'), ('hàn', '晘'), ('hàn', '釬'), ('hàn', '閈'),
             ('hàn', '皔'), ('hàn', '睅'), ('hàn', '傼'), ('hàn', '蛿'), ('hàn', '馯'), ('hàn', '撖'), ('hàn', '漢'),
             ('hàn', '蔊'), ('hàn', '蜭'), ('hàn', '鳱'), ('hàn', '暵'), ('hàn', '熯'), ('hàn', '輚'), ('hàn', '銲'),
             ('hàn', '鋎'), ('hàn', '螒'), ('hàn', '頷'), ('hàn', '顄'), ('hàn', '駻'), ('hàn', '譀'), ('hàn', '雗'),
             ('hàn', '鶾'), ('hàn', '㢨'), ('hàn', '䏎'), ('hàn', '㽳'), ('hàn', '㪋'), ('hàn', '䏷'), ('hàn', '䧲'),
             ('hàn', '㑵'), ('hàn', '㨔'), ('hàn', '䐄'), ('hàn', '㒈'), ('hàn', '䖔'), ('hàn', '䘶'), ('hàn', '㲦'),
             ('hàn', '㵄'), ('hàn', '䁔'), ('hàn', '㜦'), ('hàn', '䌍'), ('hàn', '䎯'), ('hàn', '䗣'), ('hàn', '䫲'),
             ('hàn', '䕿')]
    han_5 = [('han', '兯'), ('han', '爳')]
    hang_1 = [('hāng', '夯')]
    hang_2 = [('háng', '行'), ('háng', '航'), ('háng', '杭'), ('háng', '吭'), ('háng', '桁'), ('háng', '邟'), ('háng', '妔'),
              ('háng', '苀'), ('háng', '迒'), ('háng', '斻'), ('háng', '垳'), ('háng', '绗'), ('háng', '笐'), ('háng', '蚢'),
              ('háng', '颃'), ('háng', '裄'), ('háng', '貥'), ('háng', '筕'), ('háng', '絎'), ('háng', '頏'), ('háng', '魧'),
              ('háng', '㤚'), ('háng', '䘕'), ('háng', '䢚'), ('háng', '䀪'), ('háng', '䲳')]
    hang_3 = [('hàng', '巷'), ('hàng', '沆'), ('hàng', '忼'), ('hàng', '䟘'), ('hàng', '䣈'), ('hàng', '䦳'), ('hàng', '䴂')]
    hao_1 = [('hāo', '蒿'), ('hāo', '茠'), ('hāo', '嚆'), ('hāo', '薅'), ('hāo', '薧'), ('hāo', '䜰')]
    hao_2 = [('háo', '毫'), ('háo', '豪'), ('háo', '皋'), ('háo', '嚎'), ('háo', '壕'), ('háo', '嗥'), ('háo', '貉'),
             ('háo', '濠'), ('háo', '乚'), ('háo', '毜'), ('háo', '呺'), ('háo', '竓'), ('háo', '蚝'), ('háo', '椃'),
             ('háo', '獆'), ('háo', '噑'), ('háo', '獔'), ('háo', '嘷'), ('háo', '獋'), ('háo', '諕'), ('háo', '儫'),
             ('háo', '籇'), ('háo', '蠔'), ('háo', '譹'), ('háo', '㕺'), ('háo', '㬔'), ('háo', '䧫'), ('háo', '㠙'),
             ('háo', '㩝'), ('háo', '䝥')]
    hao_3 = [('hǎo', '好'), ('hǎo', '郝')]
    hao_4 = [('hào', '号'), ('hào', '浩'), ('hào', '耗'), ('hào', '皓'), ('hào', '昊'), ('hào', '镐'), ('hào', '灏'),
             ('hào', '澔'), ('hào', '颢'), ('hào', '侴'), ('hào', '昦'), ('hào', '秏'), ('hào', '哠'), ('hào', '恏'),
             ('hào', '悎'), ('hào', '晧'), ('hào', '淏'), ('hào', '傐'), ('hào', '鄗'), ('hào', '滈'), ('hào', '滜'),
             ('hào', '聕'), ('hào', '號'), ('hào', '暠'), ('hào', '暤'), ('hào', '暭'), ('hào', '皜'), ('hào', '皞'),
             ('hào', '曍'), ('hào', '皡'), ('hào', '薃'), ('hào', '皥'), ('hào', '藃'), ('hào', '鎬'), ('hào', '顥'),
             ('hào', '鰝'), ('hào', '灝'), ('hào', '㘪'), ('hào', '㚪'), ('hào', '㝀'), ('hào', '㞻'), ('hào', '䒵'),
             ('hào', '㬶'), ('hào', '䚽'), ('hào', '䧚'), ('hào', '㵆'), ('hào', '䪽'), ('hào', '䝞'), ('hào', '㙱'),
             ('hào', '䬉'), ('hào', '䯫')]
    he_1 = [('hē', '喝'), ('hē', '呵'), ('hē', '诃'), ('hē', '苛'), ('hē', '嗬'), ('hē', '抲'), ('hē', '欱'), ('hē', '訶'),
            ('hē', '蠚'), ('hē', '㰤')]
    he_2 = [('hé', '和'), ('hé', '何'), ('hé', '合'), ('hé', '河'), ('hé', '盖'), ('hé', '核'), ('hé', '荷'), ('hé', '盒'),
            ('hé', '禾'), ('hé', '阖'), ('hé', '劾'), ('hé', '涸'), ('hé', '曷'), ('hé', '阂'), ('hé', '纥'), ('hé', '盍'),
            ('hé', '菏'), ('hé', '颌'), ('hé', '貉'), ('hé', '翮'), ('hé', '呙'), ('hé', '咊'), ('hé', '咼'), ('hé', '姀'),
            ('hé', '郃'), ('hé', '峆'), ('hé', '柇'), ('hé', '狢'), ('hé', '盇'), ('hé', '籺'), ('hé', '紇'), ('hé', '饸'),
            ('hé', '敆'), ('hé', '盉'), ('hé', '釛'), ('hé', '啝'), ('hé', '渮'), ('hé', '萂'), ('hé', '龁'), ('hé', '喛'),
            ('hé', '惒'), ('hé', '粭'), ('hé', '訸'), ('hé', '楁'), ('hé', '毼'), ('hé', '澕'), ('hé', '蓋'), ('hé', '詥'),
            ('hé', '貈'), ('hé', '鉌'), ('hé', '鲄'), ('hé', '朅'), ('hé', '熆'), ('hé', '閡'), ('hé', '閤'), ('hé', '餄'),
            ('hé', '鹖'), ('hé', '麧'), ('hé', '噈'), ('hé', '頜'), ('hé', '篕'), ('hé', '螛'), ('hé', '魺'), ('hé', '礉'),
            ('hé', '闔'), ('hé', '鞨'), ('hé', '齕'), ('hé', '覈'), ('hé', '鶡'), ('hé', '皬'), ('hé', '鑉'), ('hé', '龢'),
            ('hé', '䒩'), ('hé', '㪃'), ('hé', '䢔'), ('hé', '䢗'), ('hé', '㪉'), ('hé', '㭘'), ('hé', '㓭'), ('hé', '㔠'),
            ('hé', '㭱'), ('hé', '䅂'), ('hé', '㥺'), ('hé', '㮝'), ('hé', '㹇'), ('hé', '䞦'), ('hé', '㕡'), ('hé', '㮫'),
            ('hé', '㻧'), ('hé', '㿣'), ('hé', '㿥'), ('hé', '䃒'), ('hé', '㗿'), ('hé', '㙳'), ('hé', '䕣'), ('hé', '䫘'),
            ('hé', '䳚'), ('hé', '䶅')]
    he_3 = [('hě', '㲦')]
    he_4 = [('hè', '吓'), ('hè', '赫'), ('hè', '贺'), ('hè', '鹤'), ('hè', '褐'), ('hè', '壑'), ('hè', '垎'), ('hè', '哬'),
            ('hè', '袔'), ('hè', '隺'), ('hè', '寉'), ('hè', '焃'), ('hè', '猲'), ('hè', '賀'), ('hè', '嗃'), ('hè', '煂'),
            ('hè', '碋'), ('hè', '熇'), ('hè', '翯'), ('hè', '嚇'), ('hè', '癋'), ('hè', '謞'), ('hè', '燺'), ('hè', '爀'),
            ('hè', '鶮'), ('hè', '鶴'), ('hè', '靍'), ('hè', '靎'), ('hè', '鸖'), ('hè', '靏'), ('hè', '㕰'), ('hè', '㷎'),
            ('hè', '䎋'), ('hè', '䓼'), ('hè', '䯨'), ('hè', '㷤'), ('hè', '䚂'), ('hè', '㵑'), ('hè', '㬞'), ('hè', '䴳'),
            ('hè', '㦦'), ('hè', '䪚'), ('hè', '䮤'), ('hè', '䳽'), ('hè', '䵱')]
    hei_1 = [('hēi', '黑'), ('hēi', '嘿'), ('hēi', '嗨'), ('hēi', '黒'), ('hēi', '潶')]
    hen_1 = [('hén', '痕'), ('hén', '拫'), ('hén', '鞎'), ('hén', '㯊')]
    hen_2 = [('hěn', '很'), ('hěn', '狠'), ('hěn', '哏'), ('hěn', '佷'), ('hěn', '詪'), ('hěn', '噷'), ('hěn', '䓳')]
    hen_3 = [('hèn', '恨')]
    heng_1 = [('hēng', '哼'), ('hēng', '亨'), ('hēng', '悙'), ('hēng', '涥'), ('hēng', '脝')]
    heng_2 = [('héng', '横'), ('héng', '衡'), ('héng', '恒'), ('héng', '姮'), ('héng', '桁'), ('héng', '珩'), ('héng', '蘅'),
              ('héng', '恆'), ('héng', '烆'), ('héng', '胻'), ('héng', '鸻'), ('héng', '撗'), ('héng', '橫'), ('héng', '鴴'),
              ('héng', '鵆'), ('héng', '鑅'), ('héng', '㔰'), ('héng', '䒛'), ('héng', '䄓'), ('héng', '䯒'), ('héng', '㶇'),
              ('héng', '䬖'), ('héng', '䬝')]
    heng_3 = [('hèng', '啈')]
    hong_1 = [('hōng', '轰'), ('hōng', '哄'), ('hōng', '烘'), ('hōng', '薨'), ('hōng', '訇'), ('hōng', '叿'), ('hōng', '吽'),
              ('hōng', '呍'), ('hōng', '灴'), ('hōng', '軣'), ('hōng', '揈'), ('hōng', '渹'), ('hōng', '焢'), ('hōng', '硡'),
              ('hōng', '谾'), ('hōng', '輷'), ('hōng', '嚝'), ('hōng', '鍧'), ('hōng', '巆'), ('hōng', '轟')]
    hong_2 = [('hóng', '红'), ('hóng', '洪'), ('hóng', '宏'), ('hóng', '鸿'), ('hóng', '虹'), ('hóng', '弘'), ('hóng', '泓'),
              ('hóng', '闳'), ('hóng', '纮'), ('hóng', '厷'), ('hóng', '仜'), ('hóng', '妅'), ('hóng', '屸'), ('hóng', '吰'),
              ('hóng', '汯'), ('hóng', '玒'), ('hóng', '瓨'), ('hóng', '宖'), ('hóng', '玜'), ('hóng', '苰'), ('hóng', '垬'),
              ('hóng', '娂'), ('hóng', '沗'), ('hóng', '竑'), ('hóng', '紅'), ('hóng', '羾'), ('hóng', '荭'), ('hóng', '浤'),
              ('hóng', '浲'), ('hóng', '紘'), ('hóng', '翃'), ('hóng', '耾'), ('hóng', '硔'), ('hóng', '紭'), ('hóng', '谹'),
              ('hóng', '渱'), ('hóng', '溄'), ('hóng', '竤'), ('hóng', '粠'), ('hóng', '葒'), ('hóng', '葓'), ('hóng', '鈜'),
              ('hóng', '閎'), ('hóng', '綋'), ('hóng', '翝'), ('hóng', '谼'), ('hóng', '潂'), ('hóng', '鉷'), ('hóng', '鞃'),
              ('hóng', '魟'), ('hóng', '篊'), ('hóng', '鋐'), ('hóng', '彋'), ('hóng', '霐'), ('hóng', '黉'), ('hóng', '霟'),
              ('hóng', '鴻'), ('hóng', '黌'), ('hóng', '㢬'), ('hóng', '䧆'), ('hóng', '䆖'), ('hóng', '䉺'), ('hóng', '䍔'),
              ('hóng', '㖓'), ('hóng', '䜫'), ('hóng', '䞑'), ('hóng', '䂫'), ('hóng', '䡌'), ('hóng', '䡏'), ('hóng', '䩑'),
              ('hóng', '䪦'), ('hóng', '䫹'), ('hóng', '㷎'), ('hóng', '䨎'), ('hóng', '䫺'), ('hóng', '㗢'), ('hóng', '䃔'),
              ('hóng', '䲨')]
    hong_3 = [('hǒng', '唝'), ('hǒng', '晎'), ('hǒng', '嗊'), ('hǒng', '愩'), ('hǒng', '慐'), ('hǒng', '㬴'), ('hǒng', '䀧')]
    hong_4 = [('hòng', '讧'), ('hòng', '訌'), ('hòng', '閧'), ('hòng', '撔'), ('hòng', '澒'), ('hòng', '銾'), ('hòng', '蕻'),
              ('hòng', '闂'), ('hòng', '鬨'), ('hòng', '闀'), ('hòng', '㶹'), ('hòng', '䬝')]
    hou_1 = [('hōu', '齁')]
    hou_2 = [('hóu', '侯'), ('hóu', '喉'), ('hóu', '猴'), ('hóu', '篌'), ('hóu', '矦'), ('hóu', '鄇'), ('hóu', '帿'),
             ('hóu', '葔'), ('hóu', '瘊'), ('hóu', '睺'), ('hóu', '銗'), ('hóu', '糇'), ('hóu', '翭'), ('hóu', '骺'),
             ('hóu', '翵'), ('hóu', '鍭'), ('hóu', '餱'), ('hóu', '鯸'), ('hóu', '㤧'), ('hóu', '㗋'), ('hóu', '㺅'),
             ('hóu', '㬋'), ('hóu', '㮢'), ('hóu', '䂉'), ('hóu', '䙈'), ('hóu', '䗔'), ('hóu', '䫛'), ('hóu', '䳧')]
    hou_3 = [('hǒu', '吼'), ('hǒu', '吽'), ('hǒu', '犼'), ('hǒu', '呴'), ('hǒu', '㖃'), ('hǒu', '㸸')]
    hou_4 = [('hòu', '后'), ('hòu', '候'), ('hòu', '厚'), ('hòu', '後'), ('hòu', '逅'), ('hòu', '郈'), ('hòu', '垕'),
             ('hòu', '洉'), ('hòu', '茩'), ('hòu', '堠'), ('hòu', '豞'), ('hòu', '鲎'), ('hòu', '鲘'), ('hòu', '鮜'),
             ('hòu', '鱟'), ('hòu', '㫗'), ('hòu', '㕈'), ('hòu', '㰯'), ('hòu', '䞧'), ('hòu', '䫺'), ('hòu', '䪷'),
             ('hòu', '䞀'), ('hòu', '䡩')]
    hu_1 = [('hū', '乎'), ('hū', '忽'), ('hū', '呼'), ('hū', '戏'), ('hū', '糊'), ('hū', '惚'), ('hū', '唿'), ('hū', '乯'),
            ('hū', '匢'), ('hū', '虍'), ('hū', '芴'), ('hū', '垀'), ('hū', '昒'), ('hū', '曶'), ('hū', '泘'), ('hū', '苸'),
            ('hū', '恗'), ('hū', '烀'), ('hū', '芔'), ('hū', '轷'), ('hū', '匫'), ('hū', '淴'), ('hū', '虖'), ('hū', '軤'),
            ('hū', '雽'), ('hū', '嘑'), ('hū', '寣'), ('hū', '滹'), ('hū', '雐'), ('hū', '幠'), ('hū', '戯'), ('hū', '歑'),
            ('hū', '戱'), ('hū', '膴'), ('hū', '戲'), ('hū', '謼'), ('hū', '㫚'), ('hū', '㳷'), ('hū', '㦌'), ('hū', '䬍'),
            ('hū', '䰧')]
    hu_2 = [('hú', '和'), ('hú', '胡'), ('hú', '湖'), ('hú', '核'), ('hú', '狐'), ('hú', '壶'), ('hú', '弧'), ('hú', '葫'),
            ('hú', '蝴'), ('hú', '瑚'), ('hú', '鹄'), ('hú', '斛'), ('hú', '猢'), ('hú', '囫'), ('hú', '鹘'), ('hú', '抇'),
            ('hú', '瓳'), ('hú', '隺'), ('hú', '壷'), ('hú', '焀'), ('hú', '喖'), ('hú', '壺'), ('hú', '媩'), ('hú', '搰'),
            ('hú', '絗'), ('hú', '楜'), ('hú', '煳'), ('hú', '瓡'), ('hú', '嘝'), ('hú', '蔛'), ('hú', '鹕'), ('hú', '槲'),
            ('hú', '箶'), ('hú', '縎'), ('hú', '衚'), ('hú', '魱'), ('hú', '縠'), ('hú', '螜'), ('hú', '醐'), ('hú', '頶'),
            ('hú', '觳'), ('hú', '鍸'), ('hú', '餬'), ('hú', '礐'), ('hú', '鵠'), ('hú', '瀫'), ('hú', '鬍'), ('hú', '鰗'),
            ('hú', '鶘'), ('hú', '鶦'), ('hú', '鶻'), ('hú', '鶮'), ('hú', '㪶'), ('hú', '㹱'), ('hú', '㧽'), ('hú', '䉿'),
            ('hú', '䊀'), ('hú', '䎁'), ('hú', '㗅'), ('hú', '㝬'), ('hú', '㾰'), ('hú', '䚛'), ('hú', '䞱'), ('hú', '㿥'),
            ('hú', '䔯'), ('hú', '䧼'), ('hú', '㯛'), ('hú', '䠒'), ('hú', '䭅'), ('hú', '㽇'), ('hú', '䁫'), ('hú', '䈸'),
            ('hú', '䉉'), ('hú', '䩴'), ('hú', '䭌'), ('hú', '䭍'), ('hú', '䮸'), ('hú', '䵻')]
    hu_3 = [('hǔ', '许'), ('hǔ', '虎'), ('hǔ', '唬'), ('hǔ', '琥'), ('hǔ', '浒'), ('hǔ', '乕'), ('hǔ', '汻'), ('hǔ', '俿'),
            ('hǔ', '淲'), ('hǔ', '萀'), ('hǔ', '虝'), ('hǔ', '滸'), ('hǔ', '錿'), ('hǔ', '鯱'), ('hǔ', '䗂')]
    hu_4 = [('hù', '户'), ('hù', '护'), ('hù', '互'), ('hù', '沪'), ('hù', '扈'), ('hù', '笏'), ('hù', '怙'), ('hù', '祜'),
            ('hù', '瓠'), ('hù', '弖'), ('hù', '戶'), ('hù', '戸'), ('hù', '冱'), ('hù', '芐'), ('hù', '帍'), ('hù', '沍'),
            ('hù', '岵'), ('hù', '戽'), ('hù', '昈'), ('hù', '枑'), ('hù', '姱'), ('hù', '怘'), ('hù', '粐'), ('hù', '婟'),
            ('hù', '楛'), ('hù', '嗀'), ('hù', '嗃'), ('hù', '綔'), ('hù', '鄠'), ('hù', '嫭'), ('hù', '嫮'), ('hù', '摢'),
            ('hù', '滬'), ('hù', '蔰'), ('hù', '槴'), ('hù', '熩'), ('hù', '鳸'), ('hù', '濩'), ('hù', '簄'), ('hù', '豰'),
            ('hù', '鍙'), ('hù', '嚛'), ('hù', '鹱'), ('hù', '觷'), ('hù', '護'), ('hù', '鳠'), ('hù', '頀'), ('hù', '鱯'),
            ('hù', '鸌'), ('hù', '㸦'), ('hù', '㕆'), ('hù', '㦿'), ('hù', '䍓'), ('hù', '䇘'), ('hù', '䊺'), ('hù', '䛎'),
            ('hù', '㨭'), ('hù', '㷤'), ('hù', '㺉'), ('hù', '䲵'), ('hù', '䨥'), ('hù', '䕶'), ('hù', '䨼'), ('hù', '䪝')]
    hua_1 = [('huā', '花'), ('huā', '砉'), ('huā', '吪'), ('huā', '芲'), ('huā', '埖'), ('huā', '婲'), ('huā', '椛'),
             ('huā', '硴'), ('huā', '蒊'), ('huā', '糀'), ('huā', '誮'), ('huā', '錵'), ('huā', '蘤')]
    hua_2 = [('huá', '华'), ('huá', '划'), ('huá', '哗'), ('huá', '滑'), ('huá', '豁'), ('huá', '猾'), ('huá', '骅'),
             ('huá', '铧'), ('huá', '呚'), ('huá', '姡'), ('huá', '華'), ('huá', '釪'), ('huá', '釫'), ('huá', '嘩'),
             ('huá', '搳'), ('huá', '撶'), ('huá', '劃'), ('huá', '磆'), ('huá', '蕐'), ('huá', '螖'), ('huá', '鋘'),
             ('huá', '譁'), ('huá', '鏵'), ('huá', '驊'), ('huá', '鷨'), ('huá', '㕲'), ('huá', '㭉'), ('huá', '㟆'),
             ('huá', '䏦'), ('huá', '㠏'), ('huá', '㦊'), ('huá', '㮯'), ('huá', '䊐'), ('huá', '䔢'), ('huá', '䅿'),
             ('huá', '䴳'), ('huá', '䱻'), ('huá', '䶤')]
    hua_3 = [('huà', '话'), ('huà', '化'), ('huà', '画'), ('huà', '桦'), ('huà', '夻'), ('huà', '杹'), ('huà', '枠'),
             ('huà', '崋'), ('huà', '婳'), ('huà', '畫'), ('huà', '嬅'), ('huà', '畵'), ('huà', '觟'), ('huà', '話'),
             ('huà', '摦'), ('huà', '樺'), ('huà', '嫿'), ('huà', '槬'), ('huà', '澅'), ('huà', '諙'), ('huà', '諣'),
             ('huà', '黊'), ('huà', '繣'), ('huà', '舙'), ('huà', '譮'), ('huà', '㕦'), ('huà', '㕷'), ('huà', '㓰'),
             ('huà', '䇈'), ('huà', '䋀'), ('huà', '㚌'), ('huà', '䛡'), ('huà', '㦎'), ('huà', '㩇'), ('huà', '䔯'),
             ('huà', '䠉')]
    huai_1 = [('huái', '怀'), ('huái', '淮'), ('huái', '槐'), ('huái', '徊'), ('huái', '踝'), ('huái', '佪'), ('huái', '褢'),
              ('huái', '懐'), ('huái', '褱'), ('huái', '懷'), ('huái', '瀤'), ('huái', '櫰'), ('huái', '耲'), ('huái', '蘹'),
              ('huái', '䈭'), ('huái', '㠢'), ('huái', '㜳'), ('huái', '䴜'), ('huái', '䃶'), ('huái', '补')]
    huai_2 = [('huài', '坏'), ('huài', '咶'), ('huài', '壊'), ('huài', '壞'), ('huài', '蘾')]
    huan_1 = [('huān', '欢'), ('huān', '犿'), ('huān', '歓'), ('huān', '鴅'), ('huān', '懁'), ('huān', '鵍'), ('huān', '酄'),
              ('huān', '孉'), ('huān', '懽'), ('huān', '獾'), ('huān', '歡'), ('huān', '讙'), ('huān', '貛'), ('huān', '驩')]
    huan_2 = [('huán', '还'), ('huán', '环'), ('huán', '桓'), ('huán', '鬟'), ('huán', '寰'), ('huán', '圜'), ('huán', '垸'),
              ('huán', '綄'), ('huán', '嬛'), ('huán', '郇'), ('huán', '峘'), ('huán', '洹'), ('huán', '狟'), ('huán', '荁'),
              ('huán', '萈'), ('huán', '萑'), ('huán', '堚'), ('huán', '寏'), ('huán', '絙'), ('huán', '雈'), ('huán', '獂'),
              ('huán', '羦'), ('huán', '蒝'), ('huán', '貆'), ('huán', '锾'), ('huán', '瞏'), ('huán', '澴'), ('huán', '缳'),
              ('huán', '還'), ('huán', '阛'), ('huán', '環'), ('huán', '豲'), ('huán', '鍰'), ('huán', '雚'), ('huán', '镮'),
              ('huán', '鹮'), ('huán', '糫'), ('huán', '繯'), ('huán', '鐶'), ('huán', '闤'), ('huán', '瓛'), ('huán', '㡲'),
              ('huán', '㢰'), ('huán', '㿪'), ('huán', '㔳'), ('huán', '䭴'), ('huán', '䴟'), ('huán', '㵹'), ('huán', '䦡'),
              ('huán', '䍺'), ('huán', '䝠'), ('huán', '㦥'), ('huán', '㶎'), ('huán', '䮝'), ('huán', '䥧')]
    huan_3 = [('huǎn', '缓'), ('huǎn', '睆'), ('huǎn', '緩'), ('huǎn', '㣪'), ('huǎn', '㬊'), ('huǎn', '䁔'), ('huǎn', '䈠')]
    huan_4 = [('huàn', '换'), ('huàn', '唤'), ('huàn', '幻'), ('huàn', '患'), ('huàn', '焕'), ('huàn', '宦'), ('huàn', '浣'),
              ('huàn', '涣'), ('huàn', '痪'), ('huàn', '豢'), ('huàn', '奂'), ('huàn', '肒'), ('huàn', '奐'), ('huàn', '烉'),
              ('huàn', '梙'), ('huàn', '逭'), ('huàn', '喚'), ('huàn', '喛'), ('huàn', '嵈'), ('huàn', '愌'), ('huàn', '換'),
              ('huàn', '渙'), ('huàn', '煥'), ('huàn', '瑍'), ('huàn', '漶'), ('huàn', '瘓'), ('huàn', '槵'), ('huàn', '鲩'),
              ('huàn', '擐'), ('huàn', '澣'), ('huàn', '藧'), ('huàn', '鯇'), ('huàn', '攌'), ('huàn', '嚾'), ('huàn', '轘'),
              ('huàn', '鯶'), ('huàn', '鰀'), ('huàn', '㕕'), ('huàn', '䒛'), ('huàn', '㓉'), ('huàn', '䀓'), ('huàn', '㪱'),
              ('huàn', '㬇'), ('huàn', '䀨'), ('huàn', '䆠'), ('huàn', '㼫'), ('huàn', '䊐'), ('huàn', '䠉'), ('huàn', '䯘'),
              ('huàn', '㹖')]
    huang_1 = [('huāng', '慌'), ('huāng', '荒'), ('huāng', '巟'), ('huāng', '肓'), ('huāng', '衁'), ('huāng', '宺'),
               ('huāng', '朚'), ('huāng', '塃'), ('huāng', '㠵'), ('huāng', '㡆')]
    huang_2 = [('huáng', '黄'), ('huáng', '皇'), ('huáng', '惶'), ('huáng', '煌'), ('huáng', '凰'), ('huáng', '簧'),
               ('huáng', '隍'), ('huáng', '徨'), ('huáng', '遑'), ('huáng', '璜'), ('huáng', '蝗'), ('huáng', '潢'),
               ('huáng', '篁'), ('huáng', '磺'), ('huáng', '偟'), ('huáng', '喤'), ('huáng', '堭'), ('huáng', '媓'),
               ('huáng', '崲'), ('huáng', '揘'), ('huáng', '湟'), ('huáng', '葟'), ('huáng', '黃'), ('huáng', '楻'),
               ('huáng', '瑝'), ('huáng', '墴'), ('huáng', '獚'), ('huáng', '锽'), ('huáng', '熿'), ('huáng', '艎'),
               ('huáng', '癀'), ('huáng', '穔'), ('huáng', '諻'), ('huáng', '蟥'), ('huáng', '鍠'), ('huáng', '餭'),
               ('huáng', '鳇'), ('huáng', '趪'), ('huáng', '韹'), ('huáng', '鐄'), ('huáng', '騜'), ('huáng', '鰉'),
               ('huáng', '鱑'), ('huáng', '鷬'), ('huáng', '㞷'), ('huáng', '䍿'), ('huáng', '㾠'), ('huáng', '䄓'),
               ('huáng', '㾮'), ('huáng', '䅣'), ('huáng', '䊗'), ('huáng', '䐵'), ('huáng', '䞹'), ('huáng', '䊣'),
               ('huáng', '䪄'), ('huáng', '䳨'), ('huáng', '䑟'), ('huáng', '䮲')]
    huang_3 = [('huǎng', '晃'), ('huǎng', '谎'), ('huǎng', '恍'), ('huǎng', '幌'), ('huǎng', '汻'), ('huǎng', '怳'),
               ('huǎng', '炾'), ('huǎng', '晄'), ('huǎng', '奛'), ('huǎng', '詤'), ('huǎng', '熀'), ('huǎng', '縨'),
               ('huǎng', '謊'), ('huǎng', '兤'), ('huǎng', '櫎'), ('huǎng', '爌'), ('huǎng', '㤺'), ('huǎng', '㬻'),
               ('huǎng', '䐠'), ('huǎng', '䁜'), ('huǎng', '䌙')]
    huang_4 = [('huàng', '滉'), ('huàng', '皝'), ('huàng', '愰'), ('huàng', '榥'), ('huàng', '曂'), ('huàng', '鎤'),
               ('huàng', '皩'), ('huàng', '㿠'), ('huàng', '㨪')]
    hui_1 = [('huī', '挥'), ('huī', '灰'), ('huī', '恢'), ('huī', '辉'), ('huī', '徽'), ('huī', '堕'), ('huī', '晖'),
             ('huī', '麾'), ('huī', '诙'), ('huī', '睢'), ('huī', '翚'), ('huī', '隳'), ('huī', '灳'), ('huī', '咴'),
             ('huī', '拻'), ('huī', '洃'), ('huī', '袆'), ('huī', '烣'), ('huī', '珲'), ('huī', '豗'), ('huī', '婎'),
             ('huī', '媈'), ('huī', '揮'), ('huī', '隓'), ('huī', '暉'), ('huī', '椲'), ('huī', '楎'), ('huī', '煇'),
             ('huī', '琿'), ('huī', '禈'), ('huī', '詼'), ('huī', '墮'), ('huī', '幑'), ('huī', '睳'), ('huī', '褘'),
             ('huī', '噅'), ('huī', '噕'), ('huī', '撝'), ('huī', '翬'), ('huī', '輝'), ('huī', '瀈'), ('huī', '蘳'),
             ('huī', '孈'), ('huī', '鰴'), ('huī', '䧦'), ('huī', '䜐')]
    hui_2 = [('huí', '回'), ('huí', '茴'), ('huí', '蛔'), ('huí', '囘'), ('huí', '囬'), ('huí', '佪'), ('huí', '廻'),
             ('huí', '廽'), ('huí', '恛'), ('huí', '洄'), ('huí', '迴'), ('huí', '烠'), ('huí', '蚘'), ('huí', '逥'),
             ('huí', '痐'), ('huí', '蛕'), ('huí', '蜖'), ('huí', '鮰'), ('huí', '㽇')]
    hui_3 = [('huǐ', '悔'), ('huǐ', '毁'), ('huǐ', '虺'), ('huǐ', '毀'), ('huǐ', '螝'), ('huǐ', '毇'), ('huǐ', '檓'),
             ('huǐ', '燬'), ('huǐ', '譭'), ('huǐ', '䏨'), ('huǐ', '㷐'), ('huǐ', '䠉'), ('huǐ', '䛼'), ('huǐ', '㩓'),
             ('huǐ', '䃣'), ('huǐ', '䫖'), ('huǐ', '䰎')]
    hui_4 = [('huì', '会'), ('huì', '慧'), ('huì', '汇'), ('huì', '惠'), ('huì', '绘'), ('huì', '溃'), ('huì', '蕙'),
             ('huì', '讳'), ('huì', '贿'), ('huì', '晦'), ('huì', '秽'), ('huì', '卉'), ('huì', '诲'), ('huì', '桧'),
             ('huì', '荟'), ('huì', '彗'), ('huì', '喙'), ('huì', '恚'), ('huì', '烩'), ('huì', '屶'), ('huì', '屷'),
             ('huì', '泋'), ('huì', '哕'), ('huì', '浍'), ('huì', '芔'), ('huì', '恵'), ('huì', '廆'), ('huì', '湏'),
             ('huì', '絵'), ('huì', '缋'), ('huì', '翙'), ('huì', '阓'), ('huì', '匯'), ('huì', '彙'), ('huì', '彚'),
             ('huì', '會'), ('huì', '滙'), ('huì', '詯'), ('huì', '賄'), ('huì', '颒'), ('huì', '僡'), ('huì', '嘒'),
             ('huì', '瘣'), ('huì', '蔧'), ('huì', '誨'), ('huì', '銊'), ('huì', '圚'), ('huì', '寭'), ('huì', '憓'),
             ('huì', '暳'), ('huì', '槥'), ('huì', '潓'), ('huì', '潰'), ('huì', '噦'), ('huì', '嬒'), ('huì', '徻'),
             ('huì', '橞'), ('huì', '殨'), ('huì', '澮'), ('huì', '濊'), ('huì', '獩'), ('huì', '璤'), ('huì', '薈'),
             ('huì', '薉'), ('huì', '諱'), ('huì', '頮'), ('huì', '檅'), ('huì', '檜'), ('huì', '燴'), ('huì', '璯'),
             ('huì', '篲'), ('huì', '藱'), ('huì', '餯'), ('huì', '嚖'), ('huì', '懳'), ('huì', '瞺'), ('huì', '穢'),
             ('huì', '繢'), ('huì', '蟪'), ('huì', '櫘'), ('huì', '繪'), ('huì', '翽'), ('huì', '譓'), ('huì', '儶'),
             ('huì', '鏸'), ('huì', '闠'), ('huì', '鐬'), ('huì', '靧'), ('huì', '譿'), ('huì', '顪'), ('huì', '㞧'),
             ('huì', '㤬'), ('huì', '㰥'), ('huì', '㻅'), ('huì', '㑰'), ('huì', '㑹'), ('huì', '㷄'), ('huì', '䅏'),
             ('huì', '㜇'), ('huì', '㥣'), ('huì', '㨤'), ('huì', '㱱'), ('huì', '䇻'), ('huì', '䛛'), ('huì', '㨹'),
             ('huì', '䂕'), ('huì', '䙌'), ('huì', '䤧'), ('huì', '䧥'), ('huì', '㒑'), ('huì', '䍷'), ('huì', '䕇'),
             ('huì', '䩈'), ('huì', '䙡'), ('huì', '㩨'), ('huì', '㬩'), ('huì', '䜋'), ('huì', '䎚'), ('huì', '䫭'),
             ('huì', '䵻'), ('huì', '䶐')]
    hui_5 = []
    hun_1 = [('hūn', '婚'), ('hūn', '昏'), ('hūn', '荤'), ('hūn', '阍'), ('hūn', '昬'), ('hūn', '惛'), ('hūn', '涽'),
             ('hūn', '焄'), ('hūn', '棔'), ('hūn', '殙'), ('hūn', '湣'), ('hūn', '葷'), ('hūn', '睧'), ('hūn', '睯'),
             ('hūn', '蔒'), ('hūn', '閽'), ('hūn', '轋'), ('hūn', '㱪')]
    hun_2 = [('hún', '魂'), ('hún', '浑'), ('hún', '馄'), ('hún', '忶'), ('hún', '珲'), ('hún', '渾'), ('hún', '湷'),
             ('hún', '琿'), ('hún', '餛'), ('hún', '鼲'), ('hún', '㕵'), ('hún', '㑮'), ('hún', '䐊'), ('hún', '㨡'),
             ('hún', '䰟'), ('hún', '㮯'), ('hún', '䊐'), ('hún', '䛰'), ('hún', '䡣'), ('hún', '䴷'), ('hún', '䮝')]
    hun_3 = []
    hun_4 = [('hùn', '混'), ('hùn', '棍'), ('hùn', '诨'), ('hùn', '溷'), ('hùn', '俒'), ('hùn', '眃'), ('hùn', '倱'),
             ('hùn', '圂'), ('hùn', '婫'), ('hùn', '掍'), ('hùn', '焝'), ('hùn', '尡'), ('hùn', '慁'), ('hùn', '睴'),
             ('hùn', '觨'), ('hùn', '諢'), ('hùn', '㥵'), ('hùn', '㨰'), ('hùn', '䅙'), ('hùn', '䅱'), ('hùn', '䚠'),
             ('hùn', '㯻'), ('hùn', '䫟'), ('hùn', '䧰')]
    huo_1 = [('huō', '豁'), ('huō', '吙'), ('huō', '秴'), ('huō', '耠'), ('huō', '劐'), ('huō', '攉'), ('huō', '騞')]
    huo_2 = [('huó', '和'), ('huó', '活'), ('huó', '佸'), ('huó', '姡'), ('huó', '秮'), ('huó', '秳'), ('huó', '趏'),
             ('huó', '㓉'), ('huó', '䄆'), ('huó', '䄑'), ('huó', '䣶'), ('huó', '䯏')]
    huo_3 = [('huǒ', '火'), ('huǒ', '伙'), ('huǒ', '夥'), ('huǒ', '灬'), ('huǒ', '邩'), ('huǒ', '钬'), ('huǒ', '鈥'),
             ('huǒ', '漷'), ('huǒ', '煷'), ('huǒ', '㶡'), ('huǒ', '㚌')]
    huo_4 = [('huò', '或'), ('huò', '获'), ('huò', '货'), ('huò', '惑'), ('huò', '霍'), ('huò', '祸'), ('huò', '镬'),
             ('huò', '沎'), ('huò', '咟'), ('huò', '俰'), ('huò', '捇'), ('huò', '眓'), ('huò', '閄'), ('huò', '剨'),
             ('huò', '喐'), ('huò', '掝'), ('huò', '貨'), ('huò', '旤'), ('huò', '湱'), ('huò', '禍'), ('huò', '窢'),
             ('huò', '蒦'), ('huò', '锪'), ('huò', '嚄'), ('huò', '奯'), ('huò', '擭'), ('huò', '濊'), ('huò', '濩'),
             ('huò', '獲'), ('huò', '篧'), ('huò', '鍃'), ('huò', '檴'), ('huò', '謋'), ('huò', '雘'), ('huò', '矆'),
             ('huò', '礊'), ('huò', '穫'), ('huò', '嚯'), ('huò', '彟'), ('huò', '瀖'), ('huò', '耯'), ('huò', '艧'),
             ('huò', '藿'), ('huò', '蠖'), ('huò', '嚿'), ('huò', '曤'), ('huò', '臛'), ('huò', '癨'), ('huò', '矐'),
             ('huò', '鑊'), ('huò', '韄'), ('huò', '靃'), ('huò', '彠'), ('huò', '㘞'), ('huò', '㦯'), ('huò', '䄀'),
             ('huò', '㨯'), ('huò', '㨰'), ('huò', '㕡'), ('huò', '䋭'), ('huò', '䦚'), ('huò', '㗲'), ('huò', '㩇'),
             ('huò', '㯉'), ('huò', '䁨'), ('huò', '㦜'), ('huò', '㯛'), ('huò', '䐸'), ('huò', '䰥'), ('huò', '䨥'),
             ('huò', '䉟'), ('huò', '䱛'), ('huò', '㸌'), ('huò', '䂄')]
    ji_1 = [('jī', '其'), ('jī', '机'), ('jī', '几'), ('jī', '基'), ('jī', '期'), ('jī', '奇'), ('jī', '击'), ('jī', '激'),
            ('jī', '积'), ('jī', '鸡'), ('jī', '姬'), ('jī', '肌'), ('jī', '饥'), ('jī', '稽'), ('jī', '讥'), ('jī', '圾'),
            ('jī', '缉'), ('jī', '玑'), ('jī', '唧'), ('jī', '羁'), ('jī', '叽'), ('jī', '箕'), ('jī', '矶'), ('jī', '嵇'),
            ('jī', '赍'), ('jī', '畸'), ('jī', '咭'), ('jī', '屐'), ('jī', '跻'), ('jī', '乩'), ('jī', '笄'), ('jī', '犄'),
            ('jī', '畿'), ('jī', '齑'), ('jī', '丌'), ('jī', '刉'), ('jī', '刏'), ('jī', '芨'), ('jī', '枅'), ('jī', '苙'),
            ('jī', '剞'), ('jī', '飢'), ('jī', '庴'), ('jī', '喞'), ('jī', '嵆'), ('jī', '幾'), ('jī', '攲'), ('jī', '敧'),
            ('jī', '朞'), ('jī', '筓'), ('jī', '嗘'), ('jī', '稘'), ('jī', '鳮'), ('jī', '僟'), ('jī', '毄'), ('jī', '綨'),
            ('jī', '緁'), ('jī', '銈'), ('jī', '嘰'), ('jī', '撃'), ('jī', '槣'), ('jī', '樭'), ('jī', '緝'), ('jī', '觭'),
            ('jī', '賫'), ('jī', '踑'), ('jī', '躸'), ('jī', '墼'), ('jī', '撽'), ('jī', '機'), ('jī', '璣'), ('jī', '禨'),
            ('jī', '積'), ('jī', '錤'), ('jī', '隮'), ('jī', '懠'), ('jī', '擊'), ('jī', '磯'), ('jī', '簊'), ('jī', '賷'),
            ('jī', '櫅'), ('jī', '耭'), ('jī', '雞'), ('jī', '譏'), ('jī', '韲'), ('jī', '鶏'), ('jī', '譤'), ('jī', '鐖'),
            ('jī', '饑'), ('jī', '癪'), ('jī', '躋'), ('jī', '鞿'), ('jī', '魕'), ('jī', '鶺'), ('jī', '鷄'), ('jī', '羇'),
            ('jī', '虀'), ('jī', '鑇'), ('jī', '覉'), ('jī', '鑙'), ('jī', '齏'), ('jī', '羈'), ('jī', '鸄'), ('jī', '覊'),
            ('jī', '㚻'), ('jī', '䇫'), ('jī', '䤠'), ('jī', '䕤'), ('jī', '䟇'), ('jī', '䪢')]
    ji_2 = [('jí', '及'), ('jí', '即'), ('jí', '集'), ('jí', '极'), ('jí', '急'), ('jí', '级'), ('jí', '吉'), ('jí', '辑'),
            ('jí', '疾'), ('jí', '籍'), ('jí', '藉'), ('jí', '嫉'), ('jí', '棘'), ('jí', '汲'), ('jí', '诘'), ('jí', '亟'),
            ('jí', '笈'), ('jí', '岌'), ('jí', '楫'), ('jí', '瘠'), ('jí', '佶'), ('jí', '戢'), ('jí', '殛'), ('jí', '蒺'),
            ('jí', '乁'), ('jí', '亼'), ('jí', '亽'), ('jí', '尐'), ('jí', '伋'), ('jí', '彶'), ('jí', '忣'), ('jí', '皀'),
            ('jí', '郆'), ('jí', '卽'), ('jí', '叝'), ('jí', '姞'), ('jí', '皍'), ('jí', '級'), ('jí', '堲'), ('jí', '揤'),
            ('jí', '觙'), ('jí', '偮'), ('jí', '卙'), ('jí', '唶'), ('jí', '楖'), ('jí', '淁'), ('jí', '焏'), ('jí', '谻'),
            ('jí', '極'), ('jí', '湒'), ('jí', '塉'), ('jí', '愱'), ('jí', '蝍'), ('jí', '趌'), ('jí', '槉'), ('jí', '耤'),
            ('jí', '膌'), ('jí', '銡'), ('jí', '嶯'), ('jí', '潗'), ('jí', '濈'), ('jí', '箿'), ('jí', '蕀'), ('jí', '蕺'),
            ('jí', '諔'), ('jí', '趞'), ('jí', '踖'), ('jí', '鞊'), ('jí', '鹡'), ('jí', '檝'), ('jí', '螏'), ('jí', '輯'),
            ('jí', '磼'), ('jí', '簎'), ('jí', '襋'), ('jí', '蹐'), ('jí', '鍓'), ('jí', '艥'), ('jí', '轚'), ('jí', '鏶'),
            ('jí', '霵'), ('jí', '齎'), ('jí', '躤'), ('jí', '雧'), ('jí', '㲺'), ('jí', '㔕'), ('jí', '㤂'), ('jí', '㧀'),
            ('jí', '㽺'), ('jí', '㡇'), ('jí', '㱞'), ('jí', '䞘'), ('jí', '㞃'), ('jí', '㥛'), ('jí', '㭲'), ('jí', '㴕'),
            ('jí', '㾊'), ('jí', '䐚'), ('jí', '䓧'), ('jí', '㑵'), ('jí', '㖢'), ('jí', '㗊'), ('jí', '䦈'), ('jí', '䩐'),
            ('jí', '㮟'), ('jí', '䐕'), ('jí', '㮨'), ('jí', '䁒'), ('jí', '䲯'), ('jí', '㗱'), ('jí', '㙫'), ('jí', '㠍'),
            ('jí', '㡮'), ('jí', '㻷'), ('jí', '䣢'), ('jí', '䩯'), ('jí', '㘍'), ('jí', '䳭'), ('jí', '䚐'), ('jí', '䟌'),
            ('jí', '䯂'), ('jí', '兼')]
    ji_3 = [('jǐ', '己'), ('jǐ', '给'), ('jǐ', '挤'), ('jǐ', '脊'), ('jǐ', '戟'), ('jǐ', '丮'), ('jǐ', '妀'), ('jǐ', '屰'),
            ('jǐ', '犱'), ('jǐ', '泲'), ('jǐ', '虮'), ('jǐ', '掎'), ('jǐ', '鱾'), ('jǐ', '給'), ('jǐ', '嵴'), ('jǐ', '麂'),
            ('jǐ', '魢'), ('jǐ', '撠'), ('jǐ', '憿'), ('jǐ', '橶'), ('jǐ', '擠'), ('jǐ', '穖'), ('jǐ', '蟣'), ('jǐ', '䢳'),
            ('jǐ', '㞦'), ('jǐ', '㧗'), ('jǐ', '㞆'), ('jǐ', '㨈'), ('jǐ', '㴉'), ('jǐ', '㞛'), ('jǐ', '㦸'), ('jǐ', '㱦'),
            ('jǐ', '㚡'), ('jǐ', '䆅'), ('jǐ', '䍤'), ('jǐ', '䤒')]
    ji_4 = [('jì', '系'), ('jì', '计'), ('jì', '记'), ('jì', '技'), ('jì', '济'), ('jì', '际'), ('jì', '既'), ('jì', '纪'),
            ('jì', '齐'), ('jì', '继'), ('jì', '迹'), ('jì', '季'), ('jì', '寄'), ('jì', '寂'), ('jì', '忌'), ('jì', '绩'),
            ('jì', '祭'), ('jì', '妓'), ('jì', '剂'), ('jì', '冀'), ('jì', '悸'), ('jì', '稷'), ('jì', '髻'), ('jì', '骥'),
            ('jì', '伎'), ('jì', '暨'), ('jì', '霁'), ('jì', '蓟'), ('jì', '觊'), ('jì', '偈'), ('jì', '芰'), ('jì', '洎'),
            ('jì', '荠'), ('jì', '勣'), ('jì', '鲫'), ('jì', '彐'), ('jì', '彑'), ('jì', '旡'), ('jì', '坖'), ('jì', '汥'),
            ('jì', '哜'), ('jì', '垍'), ('jì', '紀'), ('jì', '茍'), ('jì', '茤'), ('jì', '計'), ('jì', '剤'), ('jì', '畟'),
            ('jì', '紒'), ('jì', '記'), ('jì', '帺'), ('jì', '徛'), ('jì', '旣'), ('jì', '梞'), ('jì', '済'), ('jì', '塈'),
            ('jì', '惎'), ('jì', '臮'), ('jì', '葪'), ('jì', '蔇'), ('jì', '兾'), ('jì', '痵'), ('jì', '継'), ('jì', '裚'),
            ('jì', '跡'), ('jì', '際'), ('jì', '鬾'), ('jì', '魝'), ('jì', '摖'), ('jì', '漃'), ('jì', '漈'), ('jì', '禝'),
            ('jì', '稩'), ('jì', '穊'), ('jì', '誋'), ('jì', '跽'), ('jì', '魥'), ('jì', '鲚'), ('jì', '暩'), ('jì', '瞉'),
            ('jì', '諅'), ('jì', '劑'), ('jì', '曁'), ('jì', '穄'), ('jì', '薊'), ('jì', '襀'), ('jì', '嚌'), ('jì', '檕'),
            ('jì', '濟'), ('jì', '績'), ('jì', '繋'), ('jì', '罽'), ('jì', '薺'), ('jì', '覬'), ('jì', '鮆'), ('jì', '檵'),
            ('jì', '櫭'), ('jì', '璾'), ('jì', '蹟'), ('jì', '鯽'), ('jì', '鵋'), ('jì', '齌'), ('jì', '廭'), ('jì', '懻'),
            ('jì', '癠'), ('jì', '穧'), ('jì', '繫'), ('jì', '蘎'), ('jì', '鯚'), ('jì', '瀱'), ('jì', '繼'), ('jì', '蘮'),
            ('jì', '鱀'), ('jì', '蘻'), ('jì', '霽'), ('jì', '鰶'), ('jì', '鰿'), ('jì', '鷑'), ('jì', '鱭'), ('jì', '驥'),
            ('jì', '㒫'), ('jì', '䢋'), ('jì', '㑑'), ('jì', '㰟'), ('jì', '㑧'), ('jì', '䦇'), ('jì', '㠱'), ('jì', '㥍'),
            ('jì', '㳵'), ('jì', '㾒'), ('jì', '䓫'), ('jì', '㭰'), ('jì', '㻑'), ('jì', '䍯'), ('jì', '䐀'), ('jì', '䛋'),
            ('jì', '䋟'), ('jì', '䓽'), ('jì', '㡭'), ('jì', '㲅'), ('jì', '㹄'), ('jì', '㾵'), ('jì', '䗁'), ('jì', '䝸'),
            ('jì', '䨖'), ('jì', '㙨'), ('jì', '㠖'), ('jì', '䠏'), ('jì', '䒁'), ('jì', '䰥'), ('jì', '䶓'), ('jì', '㸄'),
            ('jì', '䱥'), ('jì', '䜞'), ('jì', '䮺'), ('jì', '䰏'), ('jì', '䶩'), ('jì', '补')]
    jia_1 = [('jiā', '家'), ('jiā', '加'), ('jiā', '佳'), ('jiā', '嘉'), ('jiā', '夹'), ('jiā', '挟'), ('jiā', '伽'),
             ('jiā', '迦'), ('jiā', '枷'), ('jiā', '袈'), ('jiā', '浃'), ('jiā', '珈'), ('jiā', '笳'), ('jiā', '葭'),
             ('jiā', '乫'), ('jiā', '夾'), ('jiā', '宊'), ('jiā', '抸'), ('jiā', '拁'), ('jiā', '泇'), ('jiā', '徍'),
             ('jiā', '毠'), ('jiā', '哿'), ('jiā', '埉'), ('jiā', '挾'), ('jiā', '浹'), ('jiā', '痂'), ('jiā', '梜'),
             ('jiā', '耞'), ('jiā', '傢'), ('jiā', '猳'), ('jiā', '跏'), ('jiā', '犌'), ('jiā', '腵'), ('jiā', '鉫'),
             ('jiā', '擖'), ('jiā', '镓'), ('jiā', '糘'), ('jiā', '豭'), ('jiā', '貑'), ('jiā', '鴐'), ('jiā', '鎵'),
             ('jiā', '麚'), ('jiā', '㔖'), ('jiā', '䇲'), ('jiā', '䴥')]
    jia_2 = [('jiá', '颊'), ('jiá', '颉'), ('jiá', '戛'), ('jiá', '拮'), ('jiá', '荚'), ('jiá', '恝'), ('jiá', '圿'),
             ('jiá', '忦'), ('jiá', '扴'), ('jiá', '郏'), ('jiá', '郟'), ('jiá', '唊'), ('jiá', '莢'), ('jiá', '脥'),
             ('jiá', '袷'), ('jiá', '铗'), ('jiá', '戞'), ('jiá', '猰'), ('jiá', '蛱'), ('jiá', '裌'), ('jiá', '蛺'),
             ('jiá', '鋏'), ('jiá', '頬'), ('jiá', '頰'), ('jiá', '鴶'), ('jiá', '鵊'), ('jiá', '㪴'), ('jiá', '䢔'),
             ('jiá', '䘥'), ('jiá', '㔠'), ('jiá', '㼪'), ('jiá', '䀫'), ('jiá', '䀹'), ('jiá', '㮖'), ('jiá', '䛟'),
             ('jiá', '䩡'), ('jiá', '䕛'), ('jiá', '㿓')]
    jia_3 = [('jiǎ', '假'), ('jiǎ', '贾'), ('jiǎ', '甲'), ('jiǎ', '岬'), ('jiǎ', '胛'), ('jiǎ', '钾'), ('jiǎ', '叚'),
             ('jiǎ', '玾'), ('jiǎ', '斚'), ('jiǎ', '婽'), ('jiǎ', '徦'), ('jiǎ', '斝'), ('jiǎ', '椵'), ('jiǎ', '賈'),
             ('jiǎ', '鉀'), ('jiǎ', '榎'), ('jiǎ', '槚'), ('jiǎ', '瘕'), ('jiǎ', '檟'), ('jiǎ', '㕅'), ('jiǎ', '䖬'),
             ('jiǎ', '䑝')]
    jia_4 = [('jià', '价'), ('jià', '架'), ('jià', '嫁'), ('jià', '驾'), ('jià', '稼'), ('jià', '幏'), ('jià', '榢'),
             ('jià', '價'), ('jià', '駕'), ('jià', '䁍')]
    jian_1 = [('jiān', '间'), ('jiān', '坚'), ('jiān', '监'), ('jiān', '肩'), ('jiān', '尖'), ('jiān', '兼'), ('jiān', '浅'),
              ('jiān', '奸'), ('jiān', '艰'), ('jiān', '煎'), ('jiān', '笺'), ('jiān', '缄'), ('jiān', '歼'), ('jiān', '菅'),
              ('jiān', '缣'), ('jiān', '蒹'), ('jiān', '戋'), ('jiān', '幵'), ('jiān', '冿'), ('jiān', '戔'), ('jiān', '玪'),
              ('jiān', '姦'), ('jiān', '姧'), ('jiān', '堅'), ('jiān', '惤'), ('jiān', '猏'), ('jiān', '菺'), ('jiān', '豜'),
              ('jiān', '傔'), ('jiān', '湔'), ('jiān', '牋'), ('jiān', '犍'), ('jiān', '葌'), ('jiān', '閒'), ('jiān', '間'),
              ('jiān', '雃'), ('jiān', '靬'), ('jiān', '搛'), ('jiān', '椷'), ('jiān', '椾'), ('jiān', '瑊'), ('jiān', '睷'),
              ('jiān', '碊'), ('jiān', '豣'), ('jiān', '監'), ('jiān', '箋'), ('jiān', '蔪'), ('jiān', '樫'), ('jiān', '熞'),
              ('jiān', '稴'), ('jiān', '緘'), ('jiān', '蕑'), ('jiān', '蕳'), ('jiān', '鋑'), ('jiān', '鲣'), ('jiān', '鳽'),
              ('jiān', '鹣'), ('jiān', '熸'), ('jiān', '縑'), ('jiān', '鋻'), ('jiān', '艱'), ('jiān', '餰'), ('jiān', '馢'),
              ('jiān', '麉'), ('jiān', '瀐'), ('jiān', '鞯'), ('jiān', '鳒'), ('jiān', '鵑'), ('jiān', '殱'), ('jiān', '礛'),
              ('jiān', '籈'), ('jiān', '鵳'), ('jiān', '攕'), ('jiān', '瀸'), ('jiān', '鰔'), ('jiān', '櫼'), ('jiān', '殲'),
              ('jiān', '譼'), ('jiān', '鰜'), ('jiān', '鶼'), ('jiān', '礷'), ('jiān', '韀'), ('jiān', '鰹'), ('jiān', '囏'),
              ('jiān', '虃'), ('jiān', '鑯'), ('jiān', '韉'), ('jiān', '㦰'), ('jiān', '㡨'), ('jiān', '䶬'), ('jiān', '䶢')]
    jian_2 = [('jiǎn', '简'), ('jiǎn', '检'), ('jiǎn', '减'), ('jiǎn', '剪'), ('jiǎn', '拣'), ('jiǎn', '捡'), ('jiǎn', '柬'),
              ('jiǎn', '俭'), ('jiǎn', '茧'), ('jiǎn', '戬'), ('jiǎn', '睑'), ('jiǎn', '翦'), ('jiǎn', '蹇'), ('jiǎn', '锏'),
              ('jiǎn', '碱'), ('jiǎn', '謇'), ('jiǎn', '囝'), ('jiǎn', '枧'), ('jiǎn', '倹'), ('jiǎn', '挸'), ('jiǎn', '笕'),
              ('jiǎn', '帴'), ('jiǎn', '梘'), ('jiǎn', '湕'), ('jiǎn', '趼'), ('jiǎn', '堿'), ('jiǎn', '揀'), ('jiǎn', '揃'),
              ('jiǎn', '検'), ('jiǎn', '減'), ('jiǎn', '硷'), ('jiǎn', '裥'), ('jiǎn', '詃'), ('jiǎn', '弿'), ('jiǎn', '暕'),
              ('jiǎn', '瑐'), ('jiǎn', '筧'), ('jiǎn', '絸'), ('jiǎn', '谫'), ('jiǎn', '彅'), ('jiǎn', '戩'), ('jiǎn', '儉'),
              ('jiǎn', '鋄'), ('jiǎn', '撿'), ('jiǎn', '橏'), ('jiǎn', '篯'), ('jiǎn', '檢'), ('jiǎn', '藆'), ('jiǎn', '襇'),
              ('jiǎn', '襉'), ('jiǎn', '瞼'), ('jiǎn', '礆'), ('jiǎn', '簡'), ('jiǎn', '繭'), ('jiǎn', '謭'), ('jiǎn', '鎫'),
              ('jiǎn', '鬋'), ('jiǎn', '鰎'), ('jiǎn', '鹸'), ('jiǎn', '瀽'), ('jiǎn', '蠒'), ('jiǎn', '鐗'), ('jiǎn', '鐧'),
              ('jiǎn', '鹻'), ('jiǎn', '籛'), ('jiǎn', '譾'), ('jiǎn', '襺'), ('jiǎn', '鹼'), ('jiǎn', '㔓'), ('jiǎn', '䄯'),
              ('jiǎn', '㳨'), ('jiǎn', '䅐'), ('jiǎn', '䟰'), ('jiǎn', '㨵'), ('jiǎn', '䩆'), ('jiǎn', '䛳'), ('jiǎn', '䵡'),
              ('jiǎn', '䵤'), ('jiǎn', '䯛'), ('jiǎn', '䉍'), ('jiǎn', '䯡'), ('jiǎn', '㶕'), ('jiǎn', '䭠'), ('jiǎn', '䶠'),
              ('jiǎn', '䮿')]
    jian_3 = [('jiàn', '见'), ('jiàn', '件'), ('jiàn', '建'), ('jiàn', '剑'), ('jiàn', '渐'), ('jiàn', '键'), ('jiàn', '健'),
              ('jiàn', '箭'), ('jiàn', '践'), ('jiàn', '鉴'), ('jiàn', '贱'), ('jiàn', '荐'), ('jiàn', '谏'), ('jiàn', '溅'),
              ('jiàn', '舰'), ('jiàn', '涧'), ('jiàn', '槛'), ('jiàn', '饯'), ('jiàn', '僭'), ('jiàn', '見'), ('jiàn', '侟'),
              ('jiàn', '洊'), ('jiàn', '牮'), ('jiàn', '俴'), ('jiàn', '剣'), ('jiàn', '栫'), ('jiàn', '珔'), ('jiàn', '剱'),
              ('jiàn', '徤'), ('jiàn', '揵'), ('jiàn', '袸'), ('jiàn', '釰'), ('jiàn', '釼'), ('jiàn', '寋'), ('jiàn', '旔'),
              ('jiàn', '朁'), ('jiàn', '楗'), ('jiàn', '毽'), ('jiàn', '腱'), ('jiàn', '臶'), ('jiàn', '跈'), ('jiàn', '賎'),
              ('jiàn', '僣'), ('jiàn', '榗'), ('jiàn', '漸'), ('jiàn', '劍'), ('jiàn', '劎'), ('jiàn', '墹'), ('jiàn', '澗'),
              ('jiàn', '糋'), ('jiàn', '諓'), ('jiàn', '賤'), ('jiàn', '趝'), ('jiàn', '踐'), ('jiàn', '踺'), ('jiàn', '劒'),
              ('jiàn', '劔'), ('jiàn', '薦'), ('jiàn', '諫'), ('jiàn', '鍵'), ('jiàn', '餞'), ('jiàn', '瞯'), ('jiàn', '瞷'),
              ('jiàn', '磵'), ('jiàn', '礀'), ('jiàn', '螹'), ('jiàn', '鍳'), ('jiàn', '鞬'), ('jiàn', '擶'), ('jiàn', '檻'),
              ('jiàn', '濺'), ('jiàn', '繝'), ('jiàn', '瀳'), ('jiàn', '覵'), ('jiàn', '覸'), ('jiàn', '譛'), ('jiàn', '鏩'),
              ('jiàn', '聻'), ('jiàn', '艦'), ('jiàn', '轞'), ('jiàn', '鐱'), ('jiàn', '鑑'), ('jiàn', '鑒'), ('jiàn', '鑬'),
              ('jiàn', '鑳'), ('jiàn', '䧖'), ('jiàn', '㣤'), ('jiàn', '䇟'), ('jiàn', '㓺'), ('jiàn', '㺂'), ('jiàn', '䟢'),
              ('jiàn', '㨴'), ('jiàn', '䬻'), ('jiàn', '㵎'), ('jiàn', '㔋'), ('jiàn', '㦗'), ('jiàn', '䞼'), ('jiàn', '䭈'),
              ('jiàn', '㺝'), ('jiàn', '㯺'), ('jiàn', '㽉'), ('jiàn', '䟅'), ('jiàn', '㰄'), ('jiàn', '䥜'), ('jiàn', '䭕'),
              ('jiàn', '䵖'), ('jiàn', '䤔'), ('jiàn', '䵛')]
    jiang_1 = [('jiāng', '将'), ('jiāng', '江'), ('jiāng', '姜'), ('jiāng', '僵'), ('jiāng', '疆'), ('jiāng', '浆'),
               ('jiāng', '缰'), ('jiāng', '茳'), ('jiāng', '畕'), ('jiāng', '豇'), ('jiāng', '將'), ('jiāng', '葁'),
               ('jiāng', '畺'), ('jiāng', '摪'), ('jiāng', '翞'), ('jiāng', '漿'), ('jiāng', '螀'), ('jiāng', '壃'),
               ('jiāng', '薑'), ('jiāng', '橿'), ('jiāng', '殭'), ('jiāng', '螿'), ('jiāng', '鳉'), ('jiāng', '疅'),
               ('jiāng', '礓'), ('jiāng', '繮'), ('jiāng', '韁'), ('jiāng', '鱂'), ('jiāng', '㹔'), ('jiāng', '䕬')]
    jiang_2 = [('jiǎng', '讲'), ('jiǎng', '港'), ('jiǎng', '奖'), ('jiǎng', '蒋'), ('jiǎng', '桨'), ('jiǎng', '傋'),
               ('jiǎng', '塂'), ('jiǎng', '奨'), ('jiǎng', '奬'), ('jiǎng', '蔣'), ('jiǎng', '槳'), ('jiǎng', '獎'),
               ('jiǎng', '耩'), ('jiǎng', '膙'), ('jiǎng', '講'), ('jiǎng', '顜'), ('jiǎng', '䋌'), ('jiǎng', '䙹'),
               ('jiǎng', '㢡'), ('jiǎng', '㯍'), ('jiǎng', '䁰'), ('jiǎng', '䉃'), ('jiǎng', '䒂')]
    jiang_3 = [('jiàng', '强'), ('jiàng', '降'), ('jiàng', '匠'), ('jiàng', '绛'), ('jiàng', '酱'), ('jiàng', '匞'),
               ('jiàng', '夅'), ('jiàng', '弜'), ('jiàng', '洚'), ('jiàng', '弶'), ('jiàng', '強'), ('jiàng', '絳'),
               ('jiàng', '勥'), ('jiàng', '滰'), ('jiàng', '嵹'), ('jiàng', '摾'), ('jiàng', '彊'), ('jiàng', '犟'),
               ('jiàng', '糡'), ('jiàng', '醤'), ('jiàng', '糨'), ('jiàng', '醬'), ('jiàng', '櫤'), ('jiàng', '謽'),
               ('jiàng', '䞪'), ('jiàng', '䥒')]
    jiao_1 = [('jiāo', '交'), ('jiāo', '娇'), ('jiāo', '焦'), ('jiāo', '骄'), ('jiāo', '郊'), ('jiāo', '胶'), ('jiāo', '浇'),
              ('jiāo', '蛟'), ('jiāo', '椒'), ('jiāo', '蕉'), ('jiāo', '跤'), ('jiāo', '礁'), ('jiāo', '姣'), ('jiāo', '鲛'),
              ('jiāo', '艽'), ('jiāo', '峧'), ('jiāo', '茭'), ('jiāo', '茮'), ('jiāo', '喬'), ('jiāo', '僬'), ('jiāo', '嘐'),
              ('jiāo', '虠'), ('jiāo', '嬌'), ('jiāo', '嶕'), ('jiāo', '嶣'), ('jiāo', '憍'), ('jiāo', '憢'), ('jiāo', '澆'),
              ('jiāo', '膠'), ('jiāo', '燋'), ('jiāo', '膲'), ('jiāo', '穚'), ('jiāo', '鮫'), ('jiāo', '鵁'), ('jiāo', '鹪'),
              ('jiāo', '簥'), ('jiāo', '蟭'), ('jiāo', '轇'), ('jiāo', '鐎'), ('jiāo', '驕'), ('jiāo', '鷦'), ('jiāo', '鷮'),
              ('jiāo', '㚣'), ('jiāo', '䢒'), ('jiāo', '㬵'), ('jiāo', '䴔'), ('jiāo', '䩌')]
    jiao_2 = [('jiáo', '嚼')]
    jiao_3 = [('jiǎo', '脚'), ('jiǎo', '角'), ('jiǎo', '搅'), ('jiǎo', '狡'), ('jiǎo', '绞'), ('jiǎo', '缴'), ('jiǎo', '矫'),
              ('jiǎo', '侥'), ('jiǎo', '剿'), ('jiǎo', '皎'), ('jiǎo', '佼'), ('jiǎo', '饺'), ('jiǎo', '铰'), ('jiǎo', '湫'),
              ('jiǎo', '徼'), ('jiǎo', '臫'), ('jiǎo', '恔'), ('jiǎo', '挢'), ('jiǎo', '捁'), ('jiǎo', '晈'), ('jiǎo', '烄'),
              ('jiǎo', '笅'), ('jiǎo', '釥'), ('jiǎo', '筊'), ('jiǎo', '絞'), ('jiǎo', '勦'), ('jiǎo', '敫'), ('jiǎo', '湬'),
              ('jiǎo', '煍'), ('jiǎo', '腳'), ('jiǎo', '賋'), ('jiǎo', '僥'), ('jiǎo', '摎'), ('jiǎo', '摷'), ('jiǎo', '暞'),
              ('jiǎo', '踋'), ('jiǎo', '鉸'), ('jiǎo', '餃'), ('jiǎo', '儌'), ('jiǎo', '劋'), ('jiǎo', '徺'), ('jiǎo', '撟'),
              ('jiǎo', '撹'), ('jiǎo', '樔'), ('jiǎo', '憿'), ('jiǎo', '敽'), ('jiǎo', '敿'), ('jiǎo', '燞'), ('jiǎo', '曒'),
              ('jiǎo', '璬'), ('jiǎo', '矯'), ('jiǎo', '皦'), ('jiǎo', '蟜'), ('jiǎo', '繳'), ('jiǎo', '譑'), ('jiǎo', '孂'),
              ('jiǎo', '纐'), ('jiǎo', '攪'), ('jiǎo', '灚'), ('jiǎo', '鱎'), ('jiǎo', '龣'), ('jiǎo', '㭂'), ('jiǎo', '㳅'),
              ('jiǎo', '㽱'), ('jiǎo', '㽲'), ('jiǎo', '㿟'), ('jiǎo', '䘨'), ('jiǎo', '䢪'), ('jiǎo', '䠛'), ('jiǎo', '䁶'),
              ('jiǎo', '䜈'), ('jiǎo', '䴛'), ('jiǎo', '㩭'), ('jiǎo', '㩰'), ('jiǎo', '䀊'), ('jiǎo', '䚩'), ('jiǎo', '䥞')]
    jiao_4 = [('jiào', '叫'), ('jiào', '觉'), ('jiào', '教'), ('jiào', '较'), ('jiào', '校'), ('jiào', '轿'), ('jiào', '窖'),
              ('jiào', '醮'), ('jiào', '峤'), ('jiào', '酵'), ('jiào', '呌'), ('jiào', '挍'), ('jiào', '訆'), ('jiào', '悎'),
              ('jiào', '珓'), ('jiào', '窌'), ('jiào', '敎'), ('jiào', '斍'), ('jiào', '覐'), ('jiào', '覚'), ('jiào', '滘'),
              ('jiào', '較'), ('jiào', '嘂'), ('jiào', '嘄'), ('jiào', '嘦'), ('jiào', '斠'), ('jiào', '漖'), ('jiào', '噍'),
              ('jiào', '嶠'), ('jiào', '潐'), ('jiào', '噭'), ('jiào', '嬓'), ('jiào', '獥'), ('jiào', '癄'), ('jiào', '藠'),
              ('jiào', '趭'), ('jiào', '轎'), ('jiào', '灂'), ('jiào', '覺'), ('jiào', '譥'), ('jiào', '皭'), ('jiào', '釂'),
              ('jiào', '䆗'), ('jiào', '㰾'), ('jiào', '䪒'), ('jiào', '㠐'), ('jiào', '㱶'), ('jiào', '㬭'), ('jiào', '䂃'),
              ('jiào', '䣤')]
    jie_1 = [('jiē', '接'), ('jiē', '皆'), ('jiē', '街'), ('jiē', '阶'), ('jiē', '揭'), ('jiē', '嗟'), ('jiē', '楷'),
             ('jiē', '秸'), ('jiē', '喈'), ('jiē', '疖'), ('jiē', '哜'), ('jiē', '袓'), ('jiē', '掲'), ('jiē', '痎'),
             ('jiē', '菨'), ('jiē', '階'), ('jiē', '喼'), ('jiē', '堦'), ('jiē', '媘'), ('jiē', '嫅'), ('jiē', '椄'),
             ('jiē', '湝'), ('jiē', '脻'), ('jiē', '裓'), ('jiē', '楬'), ('jiē', '煯'), ('jiē', '瑎'), ('jiē', '稭'),
             ('jiē', '鞂'), ('jiē', '擑'), ('jiē', '蝔'), ('jiē', '嚌'), ('jiē', '癤'), ('jiē', '謯'), ('jiē', '鶛'),
             ('jiē', '䃈')]
    jie_2 = [('jié', '结'), ('jié', '节'), ('jié', '杰'), ('jié', '洁'), ('jié', '截'), ('jié', '劫'), ('jié', '捷'),
             ('jié', '竭'), ('jié', '睫'), ('jié', '桀'), ('jié', '诘'), ('jié', '桔'), ('jié', '婕'), ('jié', '颉'),
             ('jié', '孑'), ('jié', '偈'), ('jié', '讦'), ('jié', '拮'), ('jié', '碣'), ('jié', '羯'), ('jié', '卩'),
             ('jié', '卪'), ('jié', '尐'), ('jié', '扢'), ('jié', '刦'), ('jié', '刧'), ('jié', '岊'), ('jié', '昅'),
             ('jié', '杢'), ('jié', '刼'), ('jié', '劼'), ('jié', '疌'), ('jié', '衱'), ('jié', '狤'), ('jié', '迼'),
             ('jié', '倢'), ('jié', '桝'), ('jié', '洯'), ('jié', '紒'), ('jié', '莭'), ('jié', '訐'), ('jié', '偼'),
             ('jié', '啑'), ('jié', '崨'), ('jié', '掶'), ('jié', '袷'), ('jié', '袺'), ('jié', '傑'), ('jié', '媫'),
             ('jié', '嵑'), ('jié', '結'), ('jié', '絜'), ('jié', '蛣'), ('jié', '嵥'), ('jié', '搩'), ('jié', '楶'),
             ('jié', '滐'), ('jié', '節'), ('jié', '蜐'), ('jié', '詰'), ('jié', '趌'), ('jié', '跲'), ('jié', '鉣'),
             ('jié', '榤'), ('jié', '蓵'), ('jié', '鲒'), ('jié', '嶱'), ('jié', '潔'), ('jié', '誱'), ('jié', '踕'),
             ('jié', '镼'), ('jié', '鞊'), ('jié', '頡'), ('jié', '幯'), ('jié', '擳'), ('jié', '嶻'), ('jié', '擮'),
             ('jié', '礍'), ('jié', '鍻'), ('jié', '鮚'), ('jié', '巀'), ('jié', '蠞'), ('jié', '蠘'), ('jié', '蠽'),
             ('jié', '㔾'), ('jié', '㝌'), ('jié', '㞯'), ('jié', '㓤'), ('jié', '㔛'), ('jié', '㘶'), ('jié', '㛃'),
             ('jié', '䂝'), ('jié', '䂒'), ('jié', '㑵'), ('jié', '㨗'), ('jié', '㨩'), ('jié', '䀷'), ('jié', '䀹'),
             ('jié', '䂶'), ('jié', '㨰'), ('jié', '㮞'), ('jié', '䞦'), ('jié', '㓗'), ('jié', '㮮'), ('jié', '䅥'),
             ('jié', '䣠'), ('jié', '㠍'), ('jié', '㦢'), ('jié', '㸅'), ('jié', '䕙'), ('jié', '㸄'), ('jié', '䌖'),
             ('jié', '䗻'), ('jié', '䘁'), ('jié', '䥛'), ('jié', '䟌'), ('jié', '䂃'), ('jié', '䲙')]
    jie_3 = [('jiě', '她'), ('jiě', '解'), ('jiě', '姐'), ('jiě', '毑'), ('jiě', '媎'), ('jiě', '觧'), ('jiě', '飷'),
             ('jiě', '檞')]
    jie_4 = [('jiè', '界'), ('jiè', '价'), ('jiè', '介'), ('jiè', '借'), ('jiè', '届'), ('jiè', '戒'), ('jiè', '藉'),
             ('jiè', '诫'), ('jiè', '芥'), ('jiè', '疥'), ('jiè', '丯'), ('jiè', '吤'), ('jiè', '妎'), ('jiè', '岕'),
             ('jiè', '庎'), ('jiè', '屆'), ('jiè', '斺'), ('jiè', '玠'), ('jiè', '畍'), ('jiè', '砎'), ('jiè', '衸'),
             ('jiè', '悈'), ('jiè', '蚧'), ('jiè', '唶'), ('jiè', '徣'), ('jiè', '堺'), ('jiè', '楐'), ('jiè', '琾'),
             ('jiè', '蛶'), ('jiè', '骱'), ('jiè', '犗'), ('jiè', '耤'), ('jiè', '誡'), ('jiè', '褯'), ('jiè', '魪'),
             ('jiè', '嶰'), ('jiè', '鎅'), ('jiè', '鶡'), ('jiè', '㝏'), ('jiè', '㠹'), ('jiè', '㑘'), ('jiè', '㾏'),
             ('jiè', '䁓'), ('jiè', '䇒'), ('jiè', '䯰'), ('jiè', '䔿'), ('jiè', '䰺'), ('jiè', '䲸'), ('jiè', '䛺'),
             ('jiè', '䱄'), ('jiè', '㿍')]
    jie_5 = [('jie', '家'), ('jie', '價')]
    jin_1 = [('jīn', '今'), ('jīn', '金'), ('jīn', '禁'), ('jīn', '津'), ('jīn', '巾'), ('jīn', '斤'), ('jīn', '筋'),
             ('jīn', '襟'), ('jīn', '矜'), ('jīn', '衿'), ('jīn', '钅'), ('jīn', '仐'), ('jīn', '竻'), ('jīn', '釒'),
             ('jīn', '砛'), ('jīn', '荕'), ('jīn', '觔'), ('jīn', '埐'), ('jīn', '珒'), ('jīn', '矝'), ('jīn', '紟'),
             ('jīn', '惍'), ('jīn', '琎'), ('jīn', '菳'), ('jīn', '堻'), ('jīn', '琻'), ('jīn', '釿'), ('jīn', '璡'),
             ('jīn', '鹶'), ('jīn', '黅'), ('jīn', '䘳')]
    jin_2 = [('jǐn', '紧'), ('jǐn', '仅'), ('jǐn', '锦'), ('jǐn', '谨'), ('jǐn', '瑾'), ('jǐn', '堇'), ('jǐn', '卺'),
             ('jǐn', '槿'), ('jǐn', '侭'), ('jǐn', '巹'), ('jǐn', '婜'), ('jǐn', '菫'), ('jǐn', '僅'), ('jǐn', '厪'),
             ('jǐn', '嫤'), ('jǐn', '廑'), ('jǐn', '漌'), ('jǐn', '緊'), ('jǐn', '蓳'), ('jǐn', '馑'), ('jǐn', '儘'),
             ('jǐn', '錦'), ('jǐn', '謹'), ('jǐn', '饉'), ('jǐn', '䒺'), ('jǐn', '㬐'), ('jǐn', '㝻'), ('jǐn', '㹏'),
             ('jǐn', '䐶'), ('jǐn', '䌍'), ('jǐn', '㯸'), ('jǐn', '䥆'), ('jǐn', '䤐'), ('jǐn', '䭙')]
    jin_3 = [('jìn', '进'), ('jìn', '近'), ('jìn', '尽'), ('jìn', '劲'), ('jìn', '晋'), ('jìn', '浸'), ('jìn', '靳'),
             ('jìn', '噤'), ('jìn', '烬'), ('jìn', '荩'), ('jìn', '觐'), ('jìn', '缙'), ('jìn', '妗'), ('jìn', '伒'),
             ('jìn', '劤'), ('jìn', '枃'), ('jìn', '勁'), ('jìn', '浕'), ('jìn', '晉'), ('jìn', '笒'), ('jìn', '赆'),
             ('jìn', '唫'), ('jìn', '祲'), ('jìn', '進'), ('jìn', '煡'), ('jìn', '臸'), ('jìn', '寖'), ('jìn', '搢'),
             ('jìn', '溍'), ('jìn', '墐'), ('jìn', '慬'), ('jìn', '榗'), ('jìn', '瑨'), ('jìn', '盡'), ('jìn', '馸'),
             ('jìn', '僸'), ('jìn', '凚'), ('jìn', '歏'), ('jìn', '殣'), ('jìn', '嬐'), ('jìn', '濅'), ('jìn', '縉'),
             ('jìn', '賮'), ('jìn', '嚍'), ('jìn', '壗'), ('jìn', '嬧'), ('jìn', '濜'), ('jìn', '藎'), ('jìn', '燼'),
             ('jìn', '璶'), ('jìn', '覲'), ('jìn', '贐'), ('jìn', '齽'), ('jìn', '㶦'), ('jìn', '䢻'), ('jìn', '㶳'),
             ('jìn', '䑤'), ('jìn', '㴆'), ('jìn', '䖐'), ('jìn', '㰹'), ('jìn', '䝲'), ('jìn', '㨷'), ('jìn', '䋮'),
             ('jìn', '䀆'), ('jìn', '䆮'), ('jìn', '㦗'), ('jìn', '㬜'), ('jìn', '㻸'), ('jìn', '㯲'), ('jìn', '㱈'),
             ('jìn', '䗯'), ('jìn', '䌝'), ('jìn', '䶖'), ('jìn', '䫴'), ('jìn', '䉷')]
    jing_1 = [('jīng', '经'), ('jīng', '惊'), ('jīng', '京'), ('jīng', '精'), ('jīng', '睛'), ('jīng', '晶'), ('jīng', '荆'),
              ('jīng', '兢'), ('jīng', '菁'), ('jīng', '茎'), ('jīng', '旌'), ('jīng', '鲸'), ('jīng', '泾'), ('jīng', '坕'),
              ('jīng', '坙'), ('jīng', '巠'), ('jīng', '亰'), ('jīng', '秔'), ('jīng', '荊'), ('jīng', '涇'), ('jīng', '粇'),
              ('jīng', '婛'), ('jīng', '旍'), ('jīng', '猄'), ('jīng', '経'), ('jīng', '稉'), ('jīng', '腈'), ('jīng', '葏'),
              ('jīng', '粳'), ('jīng', '經'), ('jīng', '箐'), ('jīng', '綡'), ('jīng', '聙'), ('jīng', '鋞'), ('jīng', '橸'),
              ('jīng', '鯨'), ('jīng', '鶁'), ('jīng', '鶄'), ('jīng', '麖'), ('jīng', '鼱'), ('jīng', '驚'), ('jīng', '麠'),
              ('jīng', '䴖'), ('jīng', '䲔')]
    jing_2 = [('jǐng', '景'), ('jǐng', '警'), ('jǐng', '井'), ('jǐng', '颈'), ('jǐng', '阱'), ('jǐng', '憬'), ('jǐng', '儆'),
              ('jǐng', '丼'), ('jǐng', '刭'), ('jǐng', '坓'), ('jǐng', '宑'), ('jǐng', '汫'), ('jǐng', '汬'), ('jǐng', '肼'),
              ('jǐng', '剄'), ('jǐng', '穽'), ('jǐng', '殌'), ('jǐng', '頚'), ('jǐng', '幜'), ('jǐng', '擏'), ('jǐng', '澋'),
              ('jǐng', '璄'), ('jǐng', '憼'), ('jǐng', '暻'), ('jǐng', '璟'), ('jǐng', '璥'), ('jǐng', '頸'), ('jǐng', '蟼'),
              ('jǐng', '㘫'), ('jǐng', '䜘')]
    jing_3 = [('jìng', '竟'), ('jìng', '静'), ('jìng', '境'), ('jìng', '敬'), ('jìng', '径'), ('jìng', '劲'), ('jìng', '净'),
              ('jìng', '镜'), ('jìng', '竞'), ('jìng', '靖'), ('jìng', '迳'), ('jìng', '靓'), ('jìng', '痉'), ('jìng', '胫'),
              ('jìng', '婧'), ('jìng', '劤'), ('jìng', '妌'), ('jìng', '弪'), ('jìng', '俓'), ('jìng', '勁'), ('jìng', '婙'),
              ('jìng', '浄'), ('jìng', '倞'), ('jìng', '凈'), ('jìng', '弳'), ('jìng', '徑'), ('jìng', '莖'), ('jìng', '逕'),
              ('jìng', '桱'), ('jìng', '梷'), ('jìng', '殑'), ('jìng', '淨'), ('jìng', '竫'), ('jìng', '脛'), ('jìng', '痙'),
              ('jìng', '竧'), ('jìng', '傹'), ('jìng', '獍'), ('jìng', '誩'), ('jìng', '踁'), ('jìng', '靚'), ('jìng', '曔'),
              ('jìng', '靜'), ('jìng', '瀞'), ('jìng', '鵛'), ('jìng', '鏡'), ('jìng', '競'), ('jìng', '竸'), ('jìng', '㕋'),
              ('jìng', '㹵'), ('jìng', '䑤'), ('jìng', '㣏'), ('jìng', '㬌'), ('jìng', '䡖'), ('jìng', '䔔'), ('jìng', '䵞'),
              ('jìng', '㢣'), ('jìng', '㵾')]
    jiong_1 = [('jiōng', '扃'), ('jiōng', '冂'), ('jiōng', '冋'), ('jiōng', '坰'), ('jiōng', '埛'), ('jiōng', '扄'),
               ('jiōng', '絅'), ('jiōng', '銄'), ('jiōng', '駉'), ('jiōng', '駫'), ('jiōng', '蘏'), ('jiōng', '蘔')]
    jiong_2 = [('jiǒng', '炯'), ('jiǒng', '窘'), ('jiǒng', '迥'), ('jiǒng', '冏'), ('jiǒng', '囧'), ('jiǒng', '泂'),
               ('jiǒng', '炅'), ('jiǒng', '侰'), ('jiǒng', '逈'), ('jiǒng', '浻'), ('jiǒng', '烱'), ('jiǒng', '煚'),
               ('jiǒng', '颎'), ('jiǒng', '綗'), ('jiǒng', '臦'), ('jiǒng', '僒'), ('jiǒng', '煛'), ('jiǒng', '熲'),
               ('jiǒng', '澃'), ('jiǒng', '褧'), ('jiǒng', '燛'), ('jiǒng', '顈'), ('jiǒng', '臩'), ('jiǒng', '㢠'),
               ('jiǒng', '䌹'), ('jiǒng', '㓏'), ('jiǒng', '㤯'), ('jiǒng', '䢛'), ('jiǒng', '㖥'), ('jiǒng', '䐃'),
               ('jiǒng', '㷗'), ('jiǒng', '㷡')]
    jiong_3 = [('jiòng', '㑋')]
    jiu_1 = [('jiū', '究'), ('jiū', '纠'), ('jiū', '揪'), ('jiū', '鸠'), ('jiū', '啾'), ('jiū', '赳'), ('jiū', '阄'),
             ('jiū', '丩'), ('jiū', '勼'), ('jiū', '朻'), ('jiū', '牞'), ('jiū', '糺'), ('jiū', '糾'), ('jiū', '萛'),
             ('jiū', '揂'), ('jiū', '剹'), ('jiū', '揫'), ('jiū', '鳩'), ('jiū', '摎'), ('jiū', '稵'), ('jiū', '樛'),
             ('jiū', '鬏'), ('jiū', '鬮'), ('jiū', '㽱'), ('jiū', '䰗')]
    jiu_2 = [('jiú', '㺵')]
    jiu_3 = [('jiǔ', '九'), ('jiǔ', '酒'), ('jiǔ', '久'), ('jiǔ', '玖'), ('jiǔ', '灸'), ('jiǔ', '韭'), ('jiǔ', '乆'),
             ('jiǔ', '乣'), ('jiǔ', '氿'), ('jiǔ', '奺'), ('jiǔ', '汣'), ('jiǔ', '杦'), ('jiǔ', '舏'), ('jiǔ', '紤'),
             ('jiǔ', '镹'), ('jiǔ', '韮'), ('jiǔ', '㐇'), ('jiǔ', '㡱'), ('jiǔ', '㼋')]
    jiu_4 = [('jiù', '就'), ('jiù', '救'), ('jiù', '旧'), ('jiù', '舅'), ('jiù', '咎'), ('jiù', '疚'), ('jiù', '柩'),
             ('jiù', '厩'), ('jiù', '臼'), ('jiù', '鹫'), ('jiù', '匛'), ('jiù', '柾'), ('jiù', '倃'), ('jiù', '捄'),
             ('jiù', '桕'), ('jiù', '匓'), ('jiù', '廄'), ('jiù', '廐'), ('jiù', '僦'), ('jiù', '廏'), ('jiù', '慦'),
             ('jiù', '殧'), ('jiù', '舊'), ('jiù', '匶'), ('jiù', '鯦'), ('jiù', '麔'), ('jiù', '欍'), ('jiù', '齨'),
             ('jiù', '鷲'), ('jiù', '㝌'), ('jiù', '㺩'), ('jiù', '㧕'), ('jiù', '䆒'), ('jiù', '㶭'), ('jiù', '䡂'),
             ('jiù', '䓘'), ('jiù', '㲃'), ('jiù', '䊆'), ('jiù', '䬨'), ('jiù', '䅢'), ('jiù', '㠇'), ('jiù', '㩆'),
             ('jiù', '䊘'), ('jiù', '䛮'), ('jiù', '䠓'), ('jiù', '䳎'), ('jiù', '䳔')]
    ju_1 = [('jū', '且'), ('jū', '车'), ('jū', '居'), ('jū', '拘'), ('jū', '鞠'), ('jū', '驹'), ('jū', '掬'), ('jū', '狙'),
            ('jū', '苴'), ('jū', '疽'), ('jū', '琚'), ('jū', '趄'), ('jū', '裾'), ('jū', '雎'), ('jū', '鞫'), ('jū', '凥'),
            ('jū', '伡'), ('jū', '抅'), ('jū', '車'), ('jū', '匊'), ('jū', '岨'), ('jū', '泃'), ('jū', '俥'), ('jū', '毩'),
            ('jū', '眗'), ('jū', '砠'), ('jū', '罝'), ('jū', '陱'), ('jū', '娵'), ('jū', '婮'), ('jū', '崌'), ('jū', '梮'),
            ('jū', '涺'), ('jū', '揟'), ('jū', '椐'), ('jū', '毱'), ('jū', '腒'), ('jū', '跔'), ('jū', '跙'), ('jū', '锔'),
            ('jū', '艍'), ('jū', '蜛'), ('jū', '諊'), ('jū', '踘'), ('jū', '躹'), ('jū', '鋦'), ('jū', '駒'), ('jū', '鮈'),
            ('jū', '鴡'), ('jū', '檋'), ('jū', '鶋'), ('jū', '䢸'), ('jū', '㞐'), ('jū', '㡹'), ('jū', '㐝'), ('jū', '㪺')]
    ju_2 = [('jú', '局'), ('jú', '菊'), ('jú', '橘'), ('jú', '桔'), ('jú', '泦'), ('jú', '侷'), ('jú', '狊'), ('jú', '挶'),
            ('jú', '啹'), ('jú', '婅'), ('jú', '淗'), ('jú', '焗'), ('jú', '郹'), ('jú', '椈'), ('jú', '湨'), ('jú', '犑'),
            ('jú', '輂'), ('jú', '僪'), ('jú', '粷'), ('jú', '蓻'), ('jú', '跼'), ('jú', '閰'), ('jú', '趜'), ('jú', '駶'),
            ('jú', '繘'), ('jú', '鵙'), ('jú', '蹫'), ('jú', '鵴'), ('jú', '巈'), ('jú', '蘜'), ('jú', '鶪'), ('jú', '鼰'),
            ('jú', '鼳'), ('jú', '驧'), ('jú', '㘲'), ('jú', '㥌'), ('jú', '㹼'), ('jú', '䏱'), ('jú', '㮂'), ('jú', '㽤'),
            ('jú', '䎤'), ('jú', '䋰'), ('jú', '䗇'), ('jú', '䴗'), ('jú', '䜯'), ('jú', '䡞'), ('jú', '䪕'), ('jú', '䳔'),
            ('jú', '䕮'), ('jú', '䤎'), ('jú', '䱡'), ('jú', '㩴'), ('jú', '䰬')]
    ju_3 = [('jǔ', '举'), ('jǔ', '矩'), ('jǔ', '柜'), ('jǔ', '沮'), ('jǔ', '咀'), ('jǔ', '莒'), ('jǔ', '榉'), ('jǔ', '龃'),
            ('jǔ', '踽'), ('jǔ', '弆'), ('jǔ', '枸'), ('jǔ', '挙'), ('jǔ', '椇'), ('jǔ', '筥'), ('jǔ', '榘'), ('jǔ', '蒟'),
            ('jǔ', '聥'), ('jǔ', '舉'), ('jǔ', '擧'), ('jǔ', '櫸'), ('jǔ', '齟'), ('jǔ', '欅'), ('jǔ', '襷'), ('jǔ', '䢹'),
            ('jǔ', '㪯'), ('jǔ', '䅓'), ('jǔ', '䃊'), ('jǔ', '䄔'), ('jǔ', '䈮'), ('jǔ', '㐦'), ('jǔ', '䶥')]
    ju_4 = [('jù', '据'), ('jù', '句'), ('jù', '具'), ('jù', '剧'), ('jù', '巨'), ('jù', '聚'), ('jù', '俱'), ('jù', '距'),
            ('jù', '拒'), ('jù', '惧'), ('jù', '渠'), ('jù', '遽'), ('jù', '瞿'), ('jù', '炬'), ('jù', '锯'), ('jù', '踞'),
            ('jù', '讵'), ('jù', '钜'), ('jù', '倨'), ('jù', '飓'), ('jù', '屦'), ('jù', '乬'), ('jù', '巪'), ('jù', '姖'),
            ('jù', '岠'), ('jù', '怇'), ('jù', '洰'), ('jù', '苣'), ('jù', '邭'), ('jù', '怐'), ('jù', '怚'), ('jù', '拠'),
            ('jù', '昛'), ('jù', '歫'), ('jù', '珇'), ('jù', '秬'), ('jù', '倶'), ('jù', '烥'), ('jù', '粔'), ('jù', '耟'),
            ('jù', '蚷'), ('jù', '袓'), ('jù', '埧'), ('jù', '埾'), ('jù', '詎'), ('jù', '焣'), ('jù', '犋'), ('jù', '鉅'),
            ('jù', '蒩'), ('jù', '虡'), ('jù', '豦'), ('jù', '寠'), ('jù', '愳'), ('jù', '窭'), ('jù', '駏'), ('jù', '劇'),
            ('jù', '勮'), ('jù', '鮔'), ('jù', '壉'), ('jù', '懅'), ('jù', '據'), ('jù', '澽'), ('jù', '窶'), ('jù', '螶'),
            ('jù', '鋸'), ('jù', '屨'), ('jù', '颶'), ('jù', '貗'), ('jù', '簴'), ('jù', '躆'), ('jù', '醵'), ('jù', '忂'),
            ('jù', '懼'), ('jù', '鐻'), ('jù', '㠪'), ('jù', '㞫'), ('jù', '㳥'), ('jù', '䀠'), ('jù', '䣰'), ('jù', '㩀'),
            ('jù', '㕢'), ('jù', '㜘'), ('jù', '㨿'), ('jù', '䛯'), ('jù', '㘌'), ('jù', '䆽'), ('jù', '䱟'), ('jù', '䶙'),
            ('jù', '䵕'), ('jù', '㬬')]
    juan_1 = [('juān', '捐'), ('juān', '娟'), ('juān', '鹃'), ('juān', '涓'), ('juān', '镌'), ('juān', '蠲'), ('juān', '姢'),
              ('juān', '朘'), ('juān', '梋'), ('juān', '焆'), ('juān', '脧'), ('juān', '裐'), ('juān', '勬'), ('juān', '鋑'),
              ('juān', '鋗'), ('juān', '鞙'), ('juān', '鎸'), ('juān', '鐫'), ('juān', '䅌'), ('juān', '䣺'), ('juān', '䥴'),
              ('juān', '兼')]
    juan_2 = [('juǎn', '呟'), ('juǎn', '埍'), ('juǎn', '捲'), ('juǎn', '菤'), ('juǎn', '锩'), ('juǎn', '臇'), ('juǎn', '錈'),
              ('juǎn', '闂'), ('juǎn', '䐪'), ('juǎn', '㷷'), ('juǎn', '补')]
    juan_3 = [('juàn', '卷'), ('juàn', '圈'), ('juàn', '倦'), ('juàn', '眷'), ('juàn', '绢'), ('juàn', '隽'), ('juàn', '狷'),
              ('juàn', '奆'), ('juàn', '劵'), ('juàn', '奍'), ('juàn', '巻'), ('juàn', '帣'), ('juàn', '弮'), ('juàn', '勌'),
              ('juàn', '悁'), ('juàn', '桊'), ('juàn', '婘'), ('juàn', '惓'), ('juàn', '淃'), ('juàn', '瓹'), ('juàn', '鄄'),
              ('juàn', '圏'), ('juàn', '棬'), ('juàn', '椦'), ('juàn', '睊'), ('juàn', '絭'), ('juàn', '罥'), ('juàn', '腃'),
              ('juàn', '雋'), ('juàn', '睠'), ('juàn', '絹'), ('juàn', '飬'), ('juàn', '慻'), ('juàn', '蔨'), ('juàn', '嶲'),
              ('juàn', '餋'), ('juàn', '獧'), ('juàn', '縳'), ('juàn', '巂'), ('juàn', '羂'), ('juàn', '讂'), ('juàn', '㢧'),
              ('juàn', '䌸'), ('juàn', '䄅'), ('juàn', '㢾'), ('juàn', '䖭'), ('juàn', '䚈'), ('juàn', '䡓'), ('juàn', '㯞'),
              ('juàn', '䳪'), ('juàn', '㪻')]
    jue_1 = [('juē', '噘'), ('juē', '撅'), ('juē', '撧'), ('juē', '屩'), ('juē', '屫')]
    jue_2 = [('jué', '觉'), ('jué', '决'), ('jué', '绝'), ('jué', '角'), ('jué', '爵'), ('jué', '掘'), ('jué', '诀'),
             ('jué', '嚼'), ('jué', '厥'), ('jué', '倔'), ('jué', '攫'), ('jué', '珏'), ('jué', '崛'), ('jué', '抉'),
             ('jué', '谲'), ('jué', '獗'), ('jué', '蹶'), ('jué', '虳'), ('jué', '傕'), ('jué', '矞'), ('jué', '蕨'),
             ('jué', '噱'), ('jué', '橛'), ('jué', '矍'), ('jué', '亅'), ('jué', '孒'), ('jué', '孓'), ('jué', '刔'),
             ('jué', '氒'), ('jué', '吷'), ('jué', '妜'), ('jué', '弡'), ('jué', '決'), ('jué', '芵'), ('jué', '叕'),
             ('jué', '泬'), ('jué', '玦'), ('jué', '玨'), ('jué', '挗'), ('jué', '疦'), ('jué', '砄'), ('jué', '埆'),
             ('jué', '捔'), ('jué', '欮'), ('jué', '蚗'), ('jué', '袦'), ('jué', '崫'), ('jué', '斍'), ('jué', '桷'),
             ('jué', '覐'), ('jué', '觖'), ('jué', '訣'), ('jué', '赽'), ('jué', '趹'), ('jué', '焳'), ('jué', '絕'),
             ('jué', '絶'), ('jué', '覚'), ('jué', '趉'), ('jué', '鈌'), ('jué', '劂'), ('jué', '瑴'), ('jué', '駃'),
             ('jué', '噊'), ('jué', '嶡'), ('jué', '嶥'), ('jué', '憰'), ('jué', '熦'), ('jué', '爴'), ('jué', '瘚'),
             ('jué', '蕝'), ('jué', '觮'), ('jué', '鴂'), ('jué', '鴃'), ('jué', '壆'), ('jué', '憠'), ('jué', '橜'),
             ('jué', '燋'), ('jué', '璚'), ('jué', '臄'), ('jué', '镢'), ('jué', '櫭'), ('jué', '繘'), ('jué', '蟨'),
             ('jué', '蟩'), ('jué', '爑'), ('jué', '譎'), ('jué', '蹷'), ('jué', '髉'), ('jué', '匷'), ('jué', '覺'),
             ('jué', '鐍'), ('jué', '鐝'), ('jué', '鳜'), ('jué', '灍'), ('jué', '爝'), ('jué', '觼'), ('jué', '穱'),
             ('jué', '彏'), ('jué', '戄'), ('jué', '玃'), ('jué', '鷢'), ('jué', '矡'), ('jué', '貜'), ('jué', '躩'),
             ('jué', '钁'), ('jué', '䦼'), ('jué', '㹟'), ('jué', '㭈'), ('jué', '䏐'), ('jué', '㤜'), ('jué', '䀗'),
             ('jué', '䆕'), ('jué', '䏣'), ('jué', '䋉'), ('jué', '䡈'), ('jué', '㓸'), ('jué', '㔳'), ('jué', '㭰'),
             ('jué', '㭾'), ('jué', '㻕'), ('jué', '䆢'), ('jué', '䍊'), ('jué', '㟲'), ('jué', '㻡'), ('jué', '䇶'),
             ('jué', '䐘'), ('jué', '䖼'), ('jué', '䘿'), ('jué', '㔃'), ('jué', '㔢'), ('jué', '㸕'), ('jué', '䈑'),
             ('jué', '䍳'), ('jué', '㵐'), ('jué', '䝌'), ('jué', '䞷'), ('jué', '䠇'), ('jué', '㷾'), ('jué', '䙠'),
             ('jué', '㰐'), ('jué', '䁷'), ('jué', '㩱'), ('jué', '䣤'), ('jué', '䦆')]
    jue_3 = [('juě', '䞵'), ('juě', '䟾')]
    jue_4 = [('juè', '誳')]
    jun_1 = [('jūn', '军'), ('jūn', '君'), ('jūn', '均'), ('jūn', '钧'), ('jūn', '龟'), ('jūn', '筠'), ('jūn', '菌'),
             ('jūn', '汮'), ('jūn', '姰'), ('jūn', '袀'), ('jūn', '軍'), ('jūn', '莙'), ('jūn', '蚐'), ('jūn', '桾'),
             ('jūn', '皲'), ('jūn', '鈞'), ('jūn', '碅'), ('jūn', '皸'), ('jūn', '皹'), ('jūn', '覠'), ('jūn', '銁'),
             ('jūn', '銞'), ('jūn', '鲪'), ('jūn', '頵'), ('jūn', '麇'), ('jūn', '龜'), ('jūn', '鍕'), ('jūn', '鮶'),
             ('jūn', '麏'), ('jūn', '麕')]
    jun_2 = []
    jun_3 = [('jùn', '俊'), ('jùn', '郡'), ('jùn', '峻'), ('jùn', '骏'), ('jùn', '浚'), ('jùn', '隽'), ('jùn', '竣'),
             ('jùn', '呁'), ('jùn', '陖'), ('jùn', '埈'), ('jùn', '捃'), ('jùn', '馂'), ('jùn', '晙'), ('jùn', '焌'),
             ('jùn', '珺'), ('jùn', '棞'), ('jùn', '畯'), ('jùn', '葰'), ('jùn', '雋'), ('jùn', '儁'), ('jùn', '箘'),
             ('jùn', '箟'), ('jùn', '蜠'), ('jùn', '賐'), ('jùn', '寯'), ('jùn', '懏'), ('jùn', '餕'), ('jùn', '燇'),
             ('jùn', '濬'), ('jùn', '駿'), ('jùn', '鵔'), ('jùn', '鵕'), ('jùn', '鵘'), ('jùn', '攈'), ('jùn', '攟'),
             ('jùn', '㢠'), ('jùn', '㽙'), ('jùn', '㤯'), ('jùn', '㓴'), ('jùn', '㑺'), ('jùn', '㴫'), ('jùn', '㻒'),
             ('jùn', '䜭'), ('jùn', '㝦'), ('jùn', '䇹'), ('jùn', '㕙'), ('jùn', '䝌'), ('jùn', '䕑'), ('jùn', '䝍'),
             ('jùn', '㒞')]
    ka_1 = [('kā', '咖'), ('kā', '喀'), ('kā', '㮟'), ('kā', '䘔')]
    ka_2 = [('kǎ', '卡'), ('kǎ', '咯'), ('kǎ', '咔'), ('kǎ', '佧'), ('kǎ', '垰'), ('kǎ', '胩'), ('kǎ', '裃'), ('kǎ', '鉲')]
    kai_1 = [('kāi', '开'), ('kāi', '揩'), ('kāi', '奒'), ('kāi', '锎'), ('kāi', '開'), ('kāi', '鐦'), ('kāi', '㱾'),
             ('kāi', '㚊')]
    kai_2 = [('kǎi', '岂'), ('kǎi', '凯'), ('kǎi', '慨'), ('kǎi', '恺'), ('kǎi', '楷'), ('kǎi', '铠'), ('kǎi', '剀'),
             ('kǎi', '垲'), ('kǎi', '闿'), ('kǎi', '豈'), ('kǎi', '凱'), ('kǎi', '剴'), ('kǎi', '嘅'), ('kǎi', '蒈'),
             ('kǎi', '塏'), ('kǎi', '嵦'), ('kǎi', '愷'), ('kǎi', '輆'), ('kǎi', '暟'), ('kǎi', '锴'), ('kǎi', '鍇'),
             ('kǎi', '鎧'), ('kǎi', '闓'), ('kǎi', '颽'), ('kǎi', '䒓'), ('kǎi', '㳀'), ('kǎi', '㡁'), ('kǎi', '䐩'),
             ('kǎi', '䁗')]
    kai_3 = [('kài', '忾'), ('kài', '炌'), ('kài', '欬'), ('kài', '欯'), ('kài', '烗'), ('kài', '勓'), ('kài', '愒'),
             ('kài', '愾'), ('kài', '濭'), ('kài', '鎎'), ('kài', '㗆'), ('kài', '䫦'), ('kài', '䡷')]
    kan_1 = [('kān', '刊'), ('kān', '堪'), ('kān', '勘'), ('kān', '龛'), ('kān', '栞'), ('kān', '嵁'), ('kān', '戡'),
             ('kān', '龕')]
    kan_2 = [('kǎn', '砍'), ('kǎn', '坎'), ('kǎn', '侃'), ('kǎn', '槛'), ('kǎn', '凵'), ('kǎn', '冚'), ('kǎn', '扻'),
             ('kǎn', '莰'), ('kǎn', '偘'), ('kǎn', '埳'), ('kǎn', '惂'), ('kǎn', '欿'), ('kǎn', '歁'), ('kǎn', '輡'),
             ('kǎn', '檻'), ('kǎn', '顑'), ('kǎn', '竷'), ('kǎn', '轗'), ('kǎn', '㸝'), ('kǎn', '䖔'), ('kǎn', '䬻'),
             ('kǎn', '㵎'), ('kǎn', '㙳'), ('kǎn', '䳚'), ('kǎn', '䫲'), ('kǎn', '䶫')]
    kan_3 = [('kàn', '看'), ('kàn', '嵌'), ('kàn', '瞰'), ('kàn', '阚'), ('kàn', '衎'), ('kàn', '崁'), ('kàn', '墈'),
             ('kàn', '磡'), ('kàn', '闞'), ('kàn', '鬫'), ('kàn', '矙'), ('kàn', '㸔'), ('kàn', '䘓'), ('kàn', '䀍')]
    kang_1 = [('kāng', '康'), ('kāng', '慷'), ('kāng', '糠'), ('kāng', '忼'), ('kāng', '砊'), ('kāng', '粇'), ('kāng', '閌'),
              ('kāng', '嫝'), ('kāng', '嵻'), ('kāng', '漮'), ('kāng', '槺'), ('kāng', '穅'), ('kāng', '躿'), ('kāng', '鏮'),
              ('kāng', '鱇'), ('kāng', '㝩'), ('kāng', '㱂')]
    kang_2 = [('káng', '扛')]
    kang_3 = [('kǎng', '䡉')]
    kang_4 = [('kàng', '抗'), ('kàng', '炕'), ('kàng', '亢'), ('kàng', '伉'), ('kàng', '匟'), ('kàng', '邟'), ('kàng', '囥'),
              ('kàng', '犺'), ('kàng', '闶'), ('kàng', '钪'), ('kàng', '鈧'), ('kàng', '㰠'), ('kàng', '䲘')]
    kao_1 = [('kāo', '尻'), ('kāo', '嵪'), ('kāo', '髛'), ('kāo', '䯌')]
    kao_2 = [('kǎo', '考'), ('kǎo', '烤'), ('kǎo', '拷'), ('kǎo', '丂'), ('kǎo', '攷'), ('kǎo', '洘'), ('kǎo', '栲'),
             ('kǎo', '薧'), ('kǎo', '㼥'), ('kǎo', '䯪')]
    kao_3 = [('kào', '靠'), ('kào', '铐'), ('kào', '犒'), ('kào', '銬'), ('kào', '鲓'), ('kào', '鮳'), ('kào', '鯌'),
             ('kào', '䎋'), ('kào', '䐧'), ('kào', '䘓'), ('kào', '㸆')]
    ke_1 = [('kē', '科'), ('kē', '呵'), ('kē', '颗'), ('kē', '柯'), ('kē', '棵'), ('kē', '磕'), ('kē', '珂'), ('kē', '苛'),
            ('kē', '坷'), ('kē', '瞌'), ('kē', '轲'), ('kē', '颏'), ('kē', '窠'), ('kē', '嗑'), ('kē', '蝌'), ('kē', '匼'),
            ('kē', '牁'), ('kē', '牱'), ('kē', '疴'), ('kē', '砢'), ('kē', '趷'), ('kē', '钶'), ('kē', '蚵'), ('kē', '铪'),
            ('kē', '嵙'), ('kē', '痾'), ('kē', '萪'), ('kē', '軻'), ('kē', '搕'), ('kē', '犐'), ('kē', '稞'), ('kē', '鈳'),
            ('kē', '榼'), ('kē', '薖'), ('kē', '鉿'), ('kē', '樖'), ('kē', '頦'), ('kē', '窼'), ('kē', '醘'), ('kē', '顆'),
            ('kē', '髁'), ('kē', '礚')]
    ke_2 = [('ké', '咳'), ('ké', '壳'), ('ké', '殻'), ('ké', '揢'), ('ké', '殼'), ('ké', '翗')]
    ke_3 = [('kě', '可'), ('kě', '渴'), ('kě', '岢'), ('kě', '炣'), ('kě', '渇'), ('kě', '嵑'), ('kě', '敤'), ('kě', '閜'),
            ('kě', '磆'), ('kě', '嶱'), ('kě', '㐓'), ('kě', '㞹'), ('kě', '㪼'), ('kě', '㼎'), ('kě', '䋉'), ('kě', '㪙'),
            ('kě', '㪡'), ('kě', '㵣'), ('kě', '㒞'), ('kě', '䕣'), ('kě', '䘁')]
    ke_4 = [('kè', '克'), ('kè', '客'), ('kè', '刻'), ('kè', '课'), ('kè', '恪'), ('kè', '剋'), ('kè', '勀'), ('kè', '勊'),
            ('kè', '峇'), ('kè', '娔'), ('kè', '尅'), ('kè', '悈'), ('kè', '袔'), ('kè', '堁'), ('kè', '氪'), ('kè', '骒'),
            ('kè', '愘'), ('kè', '硞'), ('kè', '缂'), ('kè', '衉'), ('kè', '愙'), ('kè', '歁'), ('kè', '溘'), ('kè', '锞'),
            ('kè', '碦'), ('kè', '緙'), ('kè', '艐'), ('kè', '課'), ('kè', '濭'), ('kè', '錁'), ('kè', '礊'), ('kè', '騍'),
            ('kè', '㲺'), ('kè', '㕉'), ('kè', '㝓'), ('kè', '㤩'), ('kè', '㥛'), ('kè', '㕎'), ('kè', '㾧'), ('kè', '㒆'),
            ('kè', '䁍'), ('kè', '䙐'), ('kè', '䗘'), ('kè', '䶗')]
    ken_1 = []
    ken_2 = [('kěn', '肯'), ('kěn', '恳'), ('kěn', '啃'), ('kěn', '垦'), ('kěn', '龈'), ('kěn', '肎'), ('kěn', '肻'),
             ('kěn', '龂'), ('kěn', '豤'), ('kěn', '貇'), ('kěn', '墾'), ('kěn', '錹'), ('kěn', '懇')]
    ken_3 = [('kèn', '珢'), ('kèn', '掯'), ('kèn', '硍'), ('kèn', '裉'), ('kèn', '褃'), ('kèn', '㸧')]
    keng_1 = [('kēng', '坑'), ('kēng', '吭'), ('kēng', '铿'), ('kēng', '劥'), ('kēng', '阬'), ('kēng', '坈'), ('kēng', '妔'),
              ('kēng', '挳'), ('kēng', '硁'), ('kēng', '殸'), ('kēng', '牼'), ('kēng', '揁'), ('kēng', '硜'), ('kēng', '硻'),
              ('kēng', '摼'), ('kēng', '誙'), ('kēng', '銵'), ('kēng', '鍞'), ('kēng', '鏗'), ('kēng', '䡩')]
    keng_2 = [('kěng', '䡰')]
    kong_1 = [('kōng', '空'), ('kōng', '崆'), ('kōng', '箜'), ('kōng', '倥'), ('kōng', '埪'), ('kōng', '悾'), ('kōng', '涳'),
              ('kōng', '椌'), ('kōng', '硿'), ('kōng', '躻'), ('kōng', '錓'), ('kōng', '鵼')]
    kong_2 = [('kǒng', '恐'), ('kǒng', '孔'), ('kǒng', '㑋'), ('kǒng', '㤟')]
    kong_3 = [('kòng', '控'), ('kòng', '矼'), ('kòng', '羫'), ('kòng', '鞚'), ('kòng', '㸜')]
    kou_1 = [('kōu', '抠'), ('kōu', '芤'), ('kōu', '眍'), ('kōu', '眗'), ('kōu', '剾'), ('kōu', '彄'), ('kōu', '摳'),
             ('kōu', '瞘')]
    kou_2 = [('kǒu', '口'), ('kǒu', '劶'), ('kǒu', '竘'), ('kǒu', '㔚'), ('kǒu', '䧆'), ('kǒu', '㸸')]
    kou_3 = [('kòu', '扣'), ('kòu', '寇'), ('kòu', '叩'), ('kòu', '蔻'), ('kòu', '佝'), ('kòu', '怐'), ('kòu', '敂'),
             ('kòu', '冦'), ('kòu', '宼'), ('kòu', '釦'), ('kòu', '窛'), ('kòu', '筘'), ('kòu', '滱'), ('kòu', '蔲'),
             ('kòu', '瞉'), ('kòu', '簆'), ('kòu', '鷇'), ('kòu', '㓂'), ('kòu', '㲄'), ('kòu', '䍍'), ('kòu', '䳟'),
             ('kòu', '䳹')]
    ku_1 = [('kū', '哭'), ('kū', '枯'), ('kū', '窟'), ('kū', '骷'), ('kū', '刳'), ('kū', '挎'), ('kū', '扝'), ('kū', '矻'),
            ('kū', '郀'), ('kū', '朏'), ('kū', '胐'), ('kū', '桍'), ('kū', '窋'), ('kū', '堀'), ('kū', '圐'), ('kū', '跍'),
            ('kū', '鮬'), ('kū', '㱠'), ('kū', '䧊'), ('kū', '㲄')]
    ku_2 = []
    ku_3 = [('kǔ', '苦'), ('kǔ', '狜'), ('kǔ', '楛'), ('kǔ', '䇢')]
    ku_4 = [('kù', '库'), ('kù', '裤'), ('kù', '酷'), ('kù', '绔'), ('kù', '俈'), ('kù', '庫'), ('kù', '捁'), ('kù', '秙'),
            ('kù', '焅'), ('kù', '袴'), ('kù', '喾'), ('kù', '硞'), ('kù', '絝'), ('kù', '瘔'), ('kù', '廤'), ('kù', '褲'),
            ('kù', '嚳'), ('kù', '㠸'), ('kù', '䊿'), ('kù', '㐣'), ('kù', '㒂'), ('kù', '䔯'), ('kù', '䵈'), ('kù', '补')]
    kua_1 = [('kuā', '夸'), ('kuā', '咵'), ('kuā', '姱'), ('kuā', '恗'), ('kuā', '晇'), ('kuā', '絓'), ('kuā', '舿'),
             ('kuā', '誇'), ('kuā', '䯞')]
    kua_2 = [('kuǎ', '垮'), ('kuǎ', '侉'), ('kuǎ', '楇'), ('kuǎ', '銙'), ('kuǎ', '䦚')]
    kua_3 = [('kuà', '跨'), ('kuà', '胯'), ('kuà', '挎'), ('kuà', '趶'), ('kuà', '骻'), ('kuà', '㡁'), ('kuà', '䋀')]
    kuai_1 = [('kuǎi', '蒯'), ('kuǎi', '擓'), ('kuǎi', '㧟'), ('kuǎi', '䓒'), ('kuǎi', '㨤')]
    kuai_2 = [('kuài', '会'), ('kuài', '快'), ('kuài', '块'), ('kuài', '筷'), ('kuài', '侩'), ('kuài', '哙'), ('kuài', '狯'),
              ('kuài', '脍'), ('kuài', '鲙'), ('kuài', '巜'), ('kuài', '凷'), ('kuài', '圦'), ('kuài', '郐'), ('kuài', '浍'),
              ('kuài', '欳'), ('kuài', '塊'), ('kuài', '蒉'), ('kuài', '會'), ('kuài', '駃'), ('kuài', '儈'), ('kuài', '墤'),
              ('kuài', '鄶'), ('kuài', '噲'), ('kuài', '廥'), ('kuài', '澮'), ('kuài', '獪'), ('kuài', '璯'), ('kuài', '膾'),
              ('kuài', '旝'), ('kuài', '糩'), ('kuài', '鱠'), ('kuài', '㭈'), ('kuài', '㔞'), ('kuài', '㻅'), ('kuài', '㙕'),
              ('kuài', '㙗'), ('kuài', '㟴'), ('kuài', '㫎'), ('kuài', '㱮'), ('kuài', '䈛'), ('kuài', '䭝'), ('kuài', '䯤'),
              ('kuài', '㬮')]
    kuan_1 = [('kuān', '宽'), ('kuān', '寛'), ('kuān', '寬'), ('kuān', '臗'), ('kuān', '髋'), ('kuān', '鑧'), ('kuān', '髖'),
              ('kuān', '㝟')]
    kuan_2 = [('kuǎn', '款'), ('kuǎn', '梡'), ('kuǎn', '欵'), ('kuǎn', '歀'), ('kuǎn', '窽'), ('kuǎn', '窾'), ('kuǎn', '㮯'),
              ('kuǎn', '䕀'), ('kuǎn', '㯘'), ('kuǎn', '䥗'), ('kuǎn', '䲌')]
    kuan_3 = [('kuàn', '䤭')]
    kuang_1 = [('kuāng', '匡'), ('kuāng', '筐'), ('kuāng', '诓'), ('kuāng', '迋'), ('kuāng', '劻'), ('kuāng', '邼'),
               ('kuāng', '匩'), ('kuāng', '哐'), ('kuāng', '恇'), ('kuāng', '洭'), ('kuāng', '硄'), ('kuāng', '筺'),
               ('kuāng', '誆'), ('kuāng', '軭')]
    kuang_2 = [('kuáng', '狂'), ('kuáng', '诳'), ('kuáng', '忹'), ('kuáng', '抂'), ('kuáng', '狅'), ('kuáng', '軖'),
               ('kuáng', '軠'), ('kuáng', '誑'), ('kuáng', '鵟'), ('kuáng', '㫛'), ('kuáng', '㤮'), ('kuáng', '㾠')]
    kuang_3 = [('kuǎng', '夼'), ('kuǎng', '儣'), ('kuǎng', '懭')]
    kuang_4 = [('kuàng', '况'), ('kuàng', '框'), ('kuàng', '矿'), ('kuàng', '旷'), ('kuàng', '眶'), ('kuàng', '邝'),
               ('kuàng', '圹'), ('kuàng', '卝'), ('kuàng', '丱'), ('kuàng', '纩'), ('kuàng', '岲'), ('kuàng', '況'),
               ('kuàng', '昿'), ('kuàng', '贶'), ('kuàng', '眖'), ('kuàng', '砿'), ('kuàng', '絋'), ('kuàng', '絖'),
               ('kuàng', '貺'), ('kuàng', '軦'), ('kuàng', '鉱'), ('kuàng', '鋛'), ('kuàng', '鄺'), ('kuàng', '壙'),
               ('kuàng', '黋'), ('kuàng', '懬'), ('kuàng', '曠'), ('kuàng', '爌'), ('kuàng', '矌'), ('kuàng', '礦'),
               ('kuàng', '穬'), ('kuàng', '纊'), ('kuàng', '鑛'), ('kuàng', '㔞'), ('kuàng', '䊯'), ('kuàng', '䵃'),
               ('kuàng', '䂄')]
    kui_1 = [('kuī', '亏'), ('kuī', '窥'), ('kuī', '盔'), ('kuī', '刲'), ('kuī', '岿'), ('kuī', '悝'), ('kuī', '聧'),
             ('kuī', '窺'), ('kuī', '虧'), ('kuī', '顝'), ('kuī', '闚'), ('kuī', '巋')]
    kui_2 = [('kuí', '魁'), ('kuí', '奎'), ('kuí', '逵'), ('kuí', '葵'), ('kuí', '睽'), ('kuí', '夔'), ('kuí', '揆'),
             ('kuí', '隗'), ('kuí', '馗'), ('kuí', '晆'), ('kuí', '鄈'), ('kuí', '喹'), ('kuí', '骙'), ('kuí', '戣'),
             ('kuí', '暌'), ('kuí', '楏'), ('kuí', '楑'), ('kuí', '蝰'), ('kuí', '頯'), ('kuí', '櫆'), ('kuí', '藈'),
             ('kuí', '鍨'), ('kuí', '鍷'), ('kuí', '騤'), ('kuí', '蘷'), ('kuí', '巙'), ('kuí', '虁'), ('kuí', '犪'),
             ('kuí', '躨'), ('kuí', '㚝'), ('kuí', '㙓'), ('kuí', '㨒'), ('kuí', '㷇'), ('kuí', '䖯'), ('kuí', '䧶'),
             ('kuí', '䟸'), ('kuí', '䯓'), ('kuí', '䤆'), ('kuí', '㙺'), ('kuí', '㰐'), ('kuí', '䕫'), ('kuí', '䳫')]
    kui_3 = [('kuǐ', '傀'), ('kuǐ', '煃'), ('kuǐ', '跬'), ('kuǐ', '頍'), ('kuǐ', '磈'), ('kuǐ', '蹞'), ('kuǐ', '㛻'),
             ('kuǐ', '㟴'), ('kuǐ', '䞨'), ('kuǐ', '㒑'), ('kuǐ', '䠑'), ('kuǐ', '㚍'), ('kuǐ', '䫥'), ('kuǐ', '䦱')]
    kui_4 = [('kuì', '愧'), ('kuì', '溃'), ('kuì', '馈'), ('kuì', '喟'), ('kuì', '匮'), ('kuì', '愦'), ('kuì', '篑'),
             ('kuì', '聩'), ('kuì', '尯'), ('kuì', '胿'), ('kuì', '媿'), ('kuì', '蒉'), ('kuì', '匱'), ('kuì', '瞆'),
             ('kuì', '嘳'), ('kuì', '嬇'), ('kuì', '憒'), ('kuì', '潰'), ('kuì', '聭'), ('kuì', '蕢'), ('kuì', '殨'),
             ('kuì', '膭'), ('kuì', '謉'), ('kuì', '瞶'), ('kuì', '餽'), ('kuì', '簣'), ('kuì', '聵'), ('kuì', '籄'),
             ('kuì', '饋'), ('kuì', '㧉'), ('kuì', '䏗'), ('kuì', '㕟'), ('kuì', '㤬'), ('kuì', '䍪'), ('kuì', '㾠'),
             ('kuì', '㱮'), ('kuì', '䇻'), ('kuì', '䁛'), ('kuì', '䙆'), ('kuì', '䙌'), ('kuì', '䈐'), ('kuì', '䕚'),
             ('kuì', '䙡'), ('kuì', '䯣'), ('kuì', '䰎')]
    kun_1 = [('kūn', '昆'), ('kūn', '坤'), ('kūn', '琨'), ('kūn', '堃'), ('kūn', '锟'), ('kūn', '髡'), ('kūn', '鲲'),
             ('kūn', '堒'), ('kūn', '婫'), ('kūn', '崐'), ('kūn', '崑'), ('kūn', '晜'), ('kūn', '猑'), ('kūn', '菎'),
             ('kūn', '裈'), ('kūn', '焜'), ('kūn', '髠'), ('kūn', '裩'), ('kūn', '貇'), ('kūn', '鹍'), ('kūn', '潉'),
             ('kūn', '蜫'), ('kūn', '褌'), ('kūn', '髨'), ('kūn', '熴'), ('kūn', '瑻'), ('kūn', '醌'), ('kūn', '錕'),
             ('kūn', '騉'), ('kūn', '鯤'), ('kūn', '鵾'), ('kūn', '鶤'), ('kūn', '䖵')]
    kun_2 = [('kǔn', '捆'), ('kǔn', '阃'), ('kǔn', '悃'), ('kǔn', '壸'), ('kǔn', '梱'), ('kǔn', '祵'), ('kǔn', '硱'),
             ('kǔn', '稇'), ('kǔn', '裍'), ('kǔn', '壼'), ('kǔn', '稛'), ('kǔn', '綑'), ('kǔn', '閫'), ('kǔn', '閸'),
             ('kǔn', '㕎'), ('kǔn', '䠅'), ('kǔn', '㩲')]
    kun_3 = [('kùn', '困'), ('kùn', '涃'), ('kùn', '睏'), ('kùn', '㫻')]
    kuo_1 = [('kuò', '适'), ('kuò', '括'), ('kuò', '扩'), ('kuò', '阔'), ('kuò', '廓'), ('kuò', '拡'), ('kuò', '挄'),
             ('kuò', '秮'), ('kuò', '秳'), ('kuò', '铦'), ('kuò', '筈'), ('kuò', '萿'), ('kuò', '葀'), ('kuò', '蛞'),
             ('kuò', '漷'), ('kuò', '銛'), ('kuò', '噋'), ('kuò', '銽'), ('kuò', '頢'), ('kuò', '髺'), ('kuò', '擴'),
             ('kuò', '濶'), ('kuò', '闊'), ('kuò', '鞟'), ('kuò', '韕'), ('kuò', '霩'), ('kuò', '鞹'), ('kuò', '鬠'),
             ('kuò', '䄆'), ('kuò', '㣪'), ('kuò', '㪙'), ('kuò', '䄑'), ('kuò', '㗥'), ('kuò', '㨯'), ('kuò', '䟯'),
             ('kuò', '䙃'), ('kuò', '䦢'), ('kuò', '䯺')]
    la_1 = [('lā', '拉'), ('lā', '啦'), ('lā', '垃'), ('lā', '邋'), ('lā', '柆'), ('lā', '砬'), ('lā', '菈'), ('lā', '搚')]
    la_2 = [('lá', '旯'), ('lá', '磖'), ('lá', '嚹'), ('lá', '㕇')]
    la_3 = [('lǎ', '喇'), ('lǎ', '藞'), ('lǎ', '䟑')]
    la_4 = [('là', '落'), ('là', '辣'), ('là', '腊'), ('là', '蜡'), ('là', '剌'), ('là', '翋'), ('là', '揦'), ('là', '溂'),
            ('là', '揧'), ('là', '楋'), ('là', '瘌'), ('là', '蝋'), ('là', '辢'), ('là', '蝲'), ('là', '臈'), ('là', '擸'),
            ('là', '攋'), ('là', '爉'), ('là', '臘'), ('là', '鬎'), ('là', '櫴'), ('là', '瓎'), ('là', '镴'), ('là', '鯻'),
            ('là', '蠟'), ('là', '鑞'), ('là', '㻋'), ('là', '䓥'), ('là', '䀳'), ('là', '䂰'), ('là', '㻝'), ('là', '䏀'),
            ('là', '䗶'), ('là', '㸊'), ('là', '䃳'), ('là', '䱫'), ('là', '䶛'), ('là', '䝓'), ('là', '䪉')]
    la_5 = [('la', '鞡')]
    lai_1 = [('lái', '来'), ('lái', '莱'), ('lái', '來'), ('lái', '俫'), ('lái', '倈'), ('lái', '崃'), ('lái', '涞'),
             ('lái', '郲'), ('lái', '婡'), ('lái', '崍'), ('lái', '庲'), ('lái', '徠'), ('lái', '梾'), ('lái', '淶'),
             ('lái', '猍'), ('lái', '萊'), ('lái', '逨'), ('lái', '棶'), ('lái', '琜'), ('lái', '筙'), ('lái', '铼'),
             ('lái', '箂'), ('lái', '錸'), ('lái', '騋'), ('lái', '鯠'), ('lái', '鶆'), ('lái', '麳'), ('lái', '㚓'),
             ('lái', '䧒'), ('lái', '㥎'), ('lái', '䅘'), ('lái', '䋱'), ('lái', '䚅'), ('lái', '䠭')]
    lai_2 = [('lǎi', '襰'), ('lǎi', '䂾')]
    lai_3 = [('lài', '赖'), ('lài', '癞'), ('lài', '濑'), ('lài', '籁'), ('lài', '睐'), ('lài', '徕'), ('lài', '赉'),
             ('lài', '疠'), ('lài', '娕'), ('lài', '唻'), ('lài', '睞'), ('lài', '誺'), ('lài', '賚'), ('lài', '賴'),
             ('lài', '頼'), ('lài', '癘'), ('lài', '顂'), ('lài', '鵣'), ('lài', '攋'), ('lài', '瀨'), ('lài', '瀬'),
             ('lài', '藾'), ('lài', '櫴'), ('lài', '癩'), ('lài', '籟'), ('lài', '䀳'), ('lài', '䓶'), ('lài', '㾢'),
             ('lài', '㠣'), ('lài', '㸊'), ('lài', '䄤'), ('lài', '䲚')]
    lan_1 = [('lán', '兰'), ('lán', '蓝'), ('lán', '拦'), ('lán', '栏'), ('lán', '篮'), ('lán', '岚'), ('lán', '澜'),
             ('lán', '阑'), ('lán', '婪'), ('lán', '褴'), ('lán', '斓'), ('lán', '啉'), ('lán', '惏'), ('lán', '嵐'),
             ('lán', '葻'), ('lán', '暕'), ('lán', '谰'), ('lán', '厱'), ('lán', '儖'), ('lán', '懢'), ('lán', '燣'),
             ('lán', '燷'), ('lán', '藍'), ('lán', '襕'), ('lán', '镧'), ('lán', '闌'), ('lán', '璼'), ('lán', '幱'),
             ('lán', '襤'), ('lán', '譋'), ('lán', '攔'), ('lán', '瀾'), ('lán', '灆'), ('lán', '籃'), ('lán', '繿'),
             ('lán', '蘫'), ('lán', '蘭'), ('lán', '斕'), ('lán', '欄'), ('lán', '襴'), ('lán', '囒'), ('lán', '灡'),
             ('lán', '籣'), ('lán', '欗'), ('lán', '讕'), ('lán', '躝'), ('lán', '襽'), ('lán', '鑭'), ('lán', '韊'),
             ('lán', '㞩'), ('lán', '㳕'), ('lán', '㑣'), ('lán', '䍀'), ('lán', '㔋'), ('lán', '䦨'), ('lán', '䆾'),
             ('lán', '㘓'), ('lán', '㘕'), ('lán', '㦨'), ('lán', '䄤'), ('lán', '䑌'), ('lán', '䳿'), ('lán', '䰐'),
             ('lán', '䪍')]
    lan_2 = [('lǎn', '览'), ('lǎn', '懒'), ('lǎn', '揽'), ('lǎn', '缆'), ('lǎn', '榄'), ('lǎn', '浨'), ('lǎn', '漤'),
             ('lǎn', '罱'), ('lǎn', '醂'), ('lǎn', '壈'), ('lǎn', '覧'), ('lǎn', '擥'), ('lǎn', '嬾'), ('lǎn', '懶'),
             ('lǎn', '孄'), ('lǎn', '覽'), ('lǎn', '孏'), ('lǎn', '攬'), ('lǎn', '灠'), ('lǎn', '欖'), ('lǎn', '爦'),
             ('lǎn', '顲'), ('lǎn', '纜'), ('lǎn', '㘝'), ('lǎn', '㑑'), ('lǎn', '䧒'), ('lǎn', '㛦'), ('lǎn', '㨫'),
             ('lǎn', '䊖'), ('lǎn', '㩜'), ('lǎn', '㰖'), ('lǎn', '䌫')]
    lan_3 = [('làn', '烂'), ('làn', '滥'), ('làn', '坔'), ('làn', '燗'), ('làn', '嚂'), ('làn', '壏'), ('làn', '濫'),
             ('làn', '爁'), ('làn', '爛'), ('làn', '瓓'), ('làn', '爤'), ('làn', '糷'), ('làn', '钄'), ('làn', '㱫'),
             ('làn', '㜮'), ('làn', '䃹'), ('làn', '䲚')]
    lang_1 = [('lāng', '啷')]
    lang_2 = [('láng', '郎'), ('láng', '狼'), ('láng', '廊'), ('láng', '琅'), ('láng', '螂'), ('láng', '榔'), ('láng', '勆'),
              ('láng', '郞'), ('láng', '哴'), ('láng', '欴'), ('láng', '嫏'), ('láng', '斏'), ('láng', '桹'), ('láng', '蓈'),
              ('láng', '瑯'), ('láng', '硠'), ('láng', '稂'), ('láng', '锒'), ('láng', '筤'), ('láng', '艆'), ('láng', '蜋'),
              ('láng', '郒'), ('láng', '樃'), ('láng', '躴'), ('láng', '鋃'), ('láng', '鎯'), ('láng', '駺'), ('láng', '㝗'),
              ('láng', '㟍'), ('láng', '㢃'), ('láng', '㱢'), ('láng', '䆡'), ('láng', '㾿'), ('láng', '䡙'), ('láng', '䯖'),
              ('láng', '䱶'), ('láng', '兼')]
    lang_3 = [('lǎng', '朗'), ('lǎng', '崀'), ('lǎng', '朖'), ('lǎng', '烺'), ('lǎng', '塱'), ('lǎng', '蓢'), ('lǎng', '誏'),
              ('lǎng', '朤'), ('lǎng', '㓪'), ('lǎng', '㫰'), ('lǎng', '㾗'), ('lǎng', '䀶'), ('lǎng', '㙟'), ('lǎng', '䁁'),
              ('lǎng', '㮾'), ('lǎng', '䃹')]
    lang_4 = [('làng', '浪'), ('làng', '阆'), ('làng', '埌'), ('làng', '莨'), ('làng', '蒗'), ('làng', '閬'), ('làng', '䍚'),
              ('làng', '䕞')]
    lao_1 = [('lāo', '捞'), ('lāo', '粩'), ('lāo', '撈')]
    lao_2 = [('láo', '劳'), ('láo', '牢'), ('láo', '痨'), ('láo', '崂'), ('láo', '醪'), ('láo', '労'), ('láo', '窂'),
             ('láo', '哰'), ('láo', '浶'), ('láo', '勞'), ('láo', '铹'), ('láo', '僗'), ('láo', '嶗'), ('láo', '憥'),
             ('láo', '朥'), ('láo', '癆'), ('láo', '磱'), ('láo', '簩'), ('láo', '蟧'), ('láo', '鐒'), ('láo', '顟'),
             ('láo', '髝'), ('láo', '㟉'), ('láo', '㨓'), ('láo', '㗦'), ('láo', '㟹'), ('láo', '㞠'), ('láo', '䃕'),
             ('láo', '䝁'), ('láo', '䜎'), ('láo', '䲏')]
    lao_3 = [('lǎo', '老'), ('lǎo', '姥'), ('lǎo', '佬'), ('lǎo', '潦'), ('lǎo', '耂'), ('lǎo', '咾'), ('lǎo', '恅'),
             ('lǎo', '狫'), ('lǎo', '荖'), ('lǎo', '栳'), ('lǎo', '珯'), ('lǎo', '硓'), ('lǎo', '铑'), ('lǎo', '蛯'),
             ('lǎo', '銠'), ('lǎo', '鮱'), ('lǎo', '轑'), ('lǎo', '㐗'), ('lǎo', '㧯'), ('lǎo', '㟙'), ('lǎo', '䇭'),
             ('lǎo', '䳓'), ('lǎo', '䕩'), ('lǎo', '䝤'), ('lǎo', '䵏')]
    lao_4 = [('lào', '落'), ('lào', '乐'), ('lào', '络'), ('lào', '唠'), ('lào', '烙'), ('lào', '涝'), ('lào', '酪'),
             ('lào', '絡'), ('lào', '嗠'), ('lào', '耢'), ('lào', '嫪'), ('lào', '嘮'), ('lào', '憦'), ('lào', '樂'),
             ('lào', '澇'), ('lào', '躼'), ('lào', '橯'), ('lào', '耮'), ('lào', '軂')]
    le_1 = [('lē', '肋'), ('lē', '嘞')]
    le_2 = [('lè', '乐'), ('lè', '勒'), ('lè', '仂'), ('lè', '阞'), ('lè', '叻'), ('lè', '忇'), ('lè', '扐'), ('lè', '氻'),
            ('lè', '艻'), ('lè', '牞'), ('lè', '玏'), ('lè', '泐'), ('lè', '竻'), ('lè', '砳'), ('lè', '楽'), ('lè', '韷'),
            ('lè', '餎'), ('lè', '樂'), ('lè', '簕'), ('lè', '鳓'), ('lè', '鰳'), ('lè', '鱳'), ('lè', '㔹'), ('lè', '㖀'),
            ('lè', '㨋'), ('lè', '㦡')]
    le_3 = [('le', '了'), ('le', '饹')]
    lei_1 = [('lēi', '勒')]
    lei_2 = [('léi', '雷'), ('léi', '累'), ('léi', '擂'), ('léi', '羸'), ('léi', '嫘'), ('léi', '缧'), ('léi', '蔂'),
             ('léi', '樏'), ('léi', '畾'), ('léi', '檑'), ('léi', '縲'), ('léi', '攂'), ('léi', '礌'), ('léi', '镭'),
             ('léi', '櫑'), ('léi', '瓃'), ('léi', '礧'), ('léi', '纍'), ('léi', '罍'), ('léi', '蘲'), ('léi', '鐳'),
             ('léi', '轠'), ('léi', '儽'), ('léi', '鑘'), ('léi', '靁'), ('léi', '虆'), ('léi', '鱩'), ('léi', '欙'),
             ('léi', '纝'), ('léi', '鼺'), ('léi', '㲺'), ('léi', '㗊'), ('léi', '㒍'), ('léi', '䨓'), ('léi', '㹎'),
             ('léi', '䐯'), ('léi', '㵢'), ('léi', '㔣'), ('léi', '䉓'), ('léi', '䍣')]
    lei_3 = [('lěi', '蕾'), ('lěi', '磊'), ('lěi', '垒'), ('lěi', '儡'), ('lěi', '耒'), ('lěi', '诔'), ('lěi', '厽'),
             ('lěi', '洡'), ('lěi', '塁'), ('lěi', '絫'), ('lěi', '傫'), ('lěi', '誄'), ('lěi', '瘣'), ('lěi', '蕌'),
             ('lěi', '磥'), ('lěi', '壘'), ('lěi', '癗'), ('lěi', '藟'), ('lěi', '櫐'), ('lěi', '矋'), ('lěi', '礨'),
             ('lěi', '灅'), ('lěi', '蠝'), ('lěi', '蘽'), ('lěi', '讄'), ('lěi', '壨'), ('lěi', '鑸'), ('lěi', '鸓'),
             ('lěi', '㑍'), ('lěi', '䣂'), ('lěi', '㼍'), ('lěi', '㡞'), ('lěi', '䛶'), ('lěi', '䉂'), ('lěi', '㙼'),
             ('lěi', '㰐'), ('lěi', '㵽'), ('lěi', '㒦'), ('lěi', '㿔'), ('lěi', '㶟'), ('lěi', '䴎')]
    lei_4 = [('lèi', '类'), ('lèi', '泪'), ('lèi', '肋'), ('lèi', '酹'), ('lèi', '涙'), ('lèi', '淚'), ('lèi', '祱'),
             ('lèi', '銇'), ('lèi', '頛'), ('lèi', '頪'), ('lèi', '錑'), ('lèi', '颣'), ('lèi', '類'), ('lèi', '纇'),
             ('lèi', '蘱'), ('lèi', '禷'), ('lèi', '䒹'), ('lèi', '䣦'), ('lèi', '㭩'), ('lèi', '㲕'), ('lèi', '㴃'),
             ('lèi', '㻋'), ('lèi', '䢮'), ('lèi', '䮑'), ('lèi', '䉪'), ('lèi', '䍥')]
    lei_5 = [('lei', '嘞')]
    leng_1 = [('lēng', '㘄')]
    leng_2 = [('léng', '楞'), ('léng', '棱'), ('léng', '唥'), ('léng', '崚'), ('léng', '塄'), ('léng', '碐'), ('léng', '稜'),
              ('léng', '薐'), ('léng', '䉄'), ('léng', '䬋')]
    leng_3 = [('lěng', '冷')]
    leng_4 = [('lèng', '愣'), ('lèng', '倰'), ('lèng', '堎'), ('lèng', '睖'), ('lèng', '踜'), ('lèng', '䮚'), ('lèng', '䚏')]
    li_1 = [('lí', '离'), ('lí', '黎'), ('lí', '璃'), ('lí', '梨'), ('lí', '狸'), ('lí', '篱'), ('lí', '漓'), ('lí', '厘'),
            ('lí', '犁'), ('lí', '骊'), ('lí', '藜'), ('lí', '罹'), ('lí', '鹂'), ('lí', '黧'), ('lí', '刕'), ('lí', '柂'),
            ('lí', '剓'), ('lí', '荲'), ('lí', '悡'), ('lí', '梸'), ('lí', '琍'), ('lí', '菞'), ('lí', '喱'), ('lí', '棃'),
            ('lí', '犂'), ('lí', '剺'), ('lí', '睝'), ('lí', '筣'), ('lí', '缡'), ('lí', '艃'), ('lí', '蓠'), ('lí', '嫠'),
            ('lí', '孷'), ('lí', '樆'), ('lí', '盠'), ('lí', '竰'), ('lí', '貍'), ('lí', '犛'), ('lí', '糎'), ('lí', '蔾'),
            ('lí', '褵'), ('lí', '鋫'), ('lí', '鲡'), ('lí', '縭'), ('lí', '錅'), ('lí', '蟍'), ('lí', '謧'), ('lí', '醨'),
            ('lí', '嚟'), ('lí', '邌'), ('lí', '釐'), ('lí', '離'), ('lí', '鯏'), ('lí', '斄'), ('lí', '瓈'), ('lí', '蟸'),
            ('lí', '鏫'), ('lí', '鯬'), ('lí', '鵹'), ('lí', '麗'), ('lí', '囄'), ('lí', '灕'), ('lí', '蘺'), ('lí', '蠫'),
            ('lí', '孋'), ('lí', '廲'), ('lí', '劙'), ('lí', '鑗'), ('lí', '穲'), ('lí', '籬'), ('lí', '纚'), ('lí', '驪'),
            ('lí', '鱺'), ('lí', '鸝'), ('lí', '㓯'), ('lí', '䣫'), ('lí', '㥎'), ('lí', '䣓'), ('lí', '㹈'), ('lí', '䊍'),
            ('lí', '䋥'), ('lí', '䔆'), ('lí', '䖽'), ('lí', '䖿'), ('lí', '㴝'), ('lí', '㷰'), ('lí', '䄜'), ('lí', '䔣'),
            ('lí', '䔧'), ('lí', '㦒'), ('lí', '䅻'), ('lí', '䍠'), ('lí', '䵓'), ('lí', '㠟'), ('lí', '䱘'), ('lí', '䴻'),
            ('lí', '㰀'), ('lí', '䵩'), ('lí', '䉫'), ('lí', '㒿'), ('lí', '㰚'), ('lí', '䍦'), ('lí', '䙰'), ('lí', '㿛')]
    li_2 = [('lǐ', '里'), ('lǐ', '理'), ('lǐ', '李'), ('lǐ', '礼'), ('lǐ', '哩'), ('lǐ', '鲤'), ('lǐ', '俚'), ('lǐ', '逦'),
            ('lǐ', '澧'), ('lǐ', '醴'), ('lǐ', '蠡'), ('lǐ', '娌'), ('lǐ', '峛'), ('lǐ', '峢'), ('lǐ', '峲'), ('lǐ', '悝'),
            ('lǐ', '浬'), ('lǐ', '裡'), ('lǐ', '锂'), ('lǐ', '粴'), ('lǐ', '裏'), ('lǐ', '豊'), ('lǐ', '鋰'), ('lǐ', '禮'),
            ('lǐ', '鯉'), ('lǐ', '鳢'), ('lǐ', '邐'), ('lǐ', '鱧'), ('lǐ', '欚'), ('lǐ', '鱱'), ('lǐ', '㸚'), ('lǐ', '䧉'),
            ('lǐ', '䤚'), ('lǐ', '㾖'), ('lǐ', '䗍')]
    li_3 = [('lì', '力'), ('lì', '立'), ('lì', '利'), ('lì', '丽'), ('lì', '历'), ('lì', '例'), ('lì', '厉'), ('lì', '莉'),
            ('lì', '吏'), ('lì', '励'), ('lì', '粒'), ('lì', '隶'), ('lì', '栗'), ('lì', '俐'), ('lì', '笠'), ('lì', '雳'),
            ('lì', '沥'), ('lì', '戾'), ('lì', '荔'), ('lì', '俪'), ('lì', '砾'), ('lì', '砺'), ('lì', '莅'), ('lì', '痢'),
            ('lì', '呖'), ('lì', '枥'), ('lì', '栎'), ('lì', '郦'), ('lì', '鬲'), ('lì', '唳'), ('lì', '蛎'), ('lì', '詈'),
            ('lì', '溧'), ('lì', '屴'), ('lì', '扐'), ('lì', '扚'), ('lì', '朸'), ('lì', '叓'), ('lì', '坜'), ('lì', '杝'),
            ('lì', '苈'), ('lì', '叕'), ('lì', '岦'), ('lì', '沴'), ('lì', '沵'), ('lì', '疠'), ('lì', '苙'), ('lì', '迣'),
            ('lì', '栃'), ('lì', '疬'), ('lì', '砅'), ('lì', '茘'), ('lì', '赲'), ('lì', '轹'), ('lì', '唎'), ('lì', '娳'),
            ('lì', '悧'), ('lì', '栛'), ('lì', '浰'), ('lì', '涖'), ('lì', '猁'), ('lì', '珕'), ('lì', '砬'), ('lì', '秝'),
            ('lì', '婯'), ('lì', '悷'), ('lì', '粝'), ('lì', '脷'), ('lì', '蚸'), ('lì', '傈'), ('lì', '凓'), ('lì', '厤'),
            ('lì', '棙'), ('lì', '蛠'), ('lì', '跞'), ('lì', '厯'), ('lì', '塛'), ('lì', '慄'), ('lì', '搮'), ('lì', '睙'),
            ('lì', '蒚'), ('lì', '蒞'), ('lì', '蜊'), ('lì', '鉝'), ('lì', '鳨'), ('lì', '厲'), ('lì', '暦'), ('lì', '歴'),
            ('lì', '瑮'), ('lì', '綟'), ('lì', '蜧'), ('lì', '銐'), ('lì', '蝷'), ('lì', '镉'), ('lì', '勵'), ('lì', '曆'),
            ('lì', '歷'), ('lì', '篥'), ('lì', '隷'), ('lì', '鴗'), ('lì', '巁'), ('lì', '檪'), ('lì', '濿'), ('lì', '癘'),
            ('lì', '磿'), ('lì', '隸'), ('lì', '鬁'), ('lì', '儮'), ('lì', '擽'), ('lì', '曞'), ('lì', '櫔'), ('lì', '爄'),
            ('lì', '犡'), ('lì', '禲'), ('lì', '蠇'), ('lì', '鎘'), ('lì', '嚦'), ('lì', '壢'), ('lì', '攊'), ('lì', '櫟'),
            ('lì', '瀝'), ('lì', '瓅'), ('lì', '礪'), ('lì', '藶'), ('lì', '櫪'), ('lì', '爏'), ('lì', '瓑'), ('lì', '皪'),
            ('lì', '盭'), ('lì', '礫'), ('lì', '糲'), ('lì', '蠣'), ('lì', '儷'), ('lì', '癧'), ('lì', '礰'), ('lì', '纅'),
            ('lì', '酈'), ('lì', '鷅'), ('lì', '麜'), ('lì', '囇'), ('lì', '攦'), ('lì', '觻'), ('lì', '躒'), ('lì', '轢'),
            ('lì', '欐'), ('lì', '讈'), ('lì', '轣'), ('lì', '攭'), ('lì', '瓥'), ('lì', '靂'), ('lì', '靋'), ('lì', '㕸'),
            ('lì', '㧰'), ('lì', '㡂'), ('lì', '㤡'), ('lì', '㤦'), ('lì', '䡃'), ('lì', '㑦'), ('lì', '㴃'), ('lì', '㻎'),
            ('lì', '㽝'), ('lì', '㾐'), ('lì', '䅄'), ('lì', '䓞'), ('lì', '㗚'), ('lì', '㟳'), ('lì', '㮚'), ('lì', '䇐'),
            ('lì', '䔁'), ('lì', '䔉'), ('lì', '䲞'), ('lì', '㬏'), ('lì', '䰛'), ('lì', '䬅'), ('lì', '䴡'), ('lì', '㯤'),
            ('lì', '㷴'), ('lì', '㽁'), ('lì', '䬆'), ('lì', '䮋'), ('lì', '䰜'), ('lì', '㔏'), ('lì', '㻺'), ('lì', '䃯'),
            ('lì', '䊪'), ('lì', '䗶'), ('lì', '㘑'), ('lì', '㠣'), ('lì', '㺡'), ('lì', '䚏'), ('lì', '㒧'), ('lì', '㱹'),
            ('lì', '䁻'), ('lì', '䮥'), ('lì', '䶘'), ('lì', '㿨'), ('lì', '䍥'), ('lì', '䍽'), ('lì', '䕻'), ('lì', '䘈'),
            ('lì', '䟏'), ('lì', '䟐'), ('lì', '䴄'), ('lì', '䥶'), ('lì', '㼖'), ('lì', '䚕'), ('lì', '䤙'), ('lì', '兼')]
    lia_1 = [('liǎ', '俩'), ('liǎ', '倆')]
    lian_1 = [('lián', '连'), ('lián', '联'), ('lián', '怜'), ('lián', '莲'), ('lián', '廉'), ('lián', '帘'), ('lián', '涟'),
              ('lián', '奁'), ('lián', '镰'), ('lián', '濂'), ('lián', '蠊'), ('lián', '裢'), ('lián', '連'), ('lián', '梿'),
              ('lián', '亷'), ('lián', '嗹'), ('lián', '慩'), ('lián', '溓'), ('lián', '漣'), ('lián', '蓮'), ('lián', '匲'),
              ('lián', '奩'), ('lián', '槏'), ('lián', '槤'), ('lián', '熑'), ('lián', '覝'), ('lián', '劆'), ('lián', '匳'),
              ('lián', '噒'), ('lián', '嫾'), ('lián', '憐'), ('lián', '磏'), ('lián', '聨'), ('lián', '聫'), ('lián', '褳'),
              ('lián', '鲢'), ('lián', '濓'), ('lián', '縺'), ('lián', '翴'), ('lián', '聮'), ('lián', '薕'), ('lián', '螊'),
              ('lián', '櫣'), ('lián', '燫'), ('lián', '聯'), ('lián', '臁'), ('lián', '謰'), ('lián', '蹥'), ('lián', '檶'),
              ('lián', '鎌'), ('lián', '瀮'), ('lián', '簾'), ('lián', '鬑'), ('lián', '鐮'), ('lián', '鰱'), ('lián', '籢'),
              ('lián', '籨'), ('lián', '㟀'), ('lián', '䙺'), ('lián', '㥕'), ('lián', '㜕'), ('lián', '㡘'), ('lián', '㝺'),
              ('lián', '㦁'), ('lián', '㢘'), ('lián', '㼓'), ('lián', '㾾'), ('lián', '䁠'), ('lián', '䃛'), ('lián', '䆂'),
              ('lián', '䏈'), ('lián', '䭑'), ('lián', '䨬'), ('lián', '㶌'), ('lián', '㺦'), ('lián', '䥥')]
    lian_2 = [('liǎn', '脸'), ('liǎn', '敛'), ('liǎn', '琏'), ('liǎn', '莶'), ('liǎn', '裣'), ('liǎn', '摙'), ('liǎn', '璉'),
              ('liǎn', '蔹'), ('liǎn', '嬚'), ('liǎn', '薟'), ('liǎn', '斂'), ('liǎn', '歛'), ('liǎn', '臉'), ('liǎn', '鄻'),
              ('liǎn', '襝'), ('liǎn', '羷'), ('liǎn', '蘝'), ('liǎn', '蘞'), ('liǎn', '醶'), ('liǎn', '䇜'), ('liǎn', '㪘'),
              ('liǎn', '㰸'), ('liǎn', '䐄'), ('liǎn', '㦑'), ('liǎn', '㯬'), ('liǎn', '㰈'), ('liǎn', '䌞')]
    lian_3 = [('liàn', '练'), ('liàn', '恋'), ('liàn', '链'), ('liàn', '炼'), ('liàn', '殓'), ('liàn', '潋'), ('liàn', '僆'),
              ('liàn', '堜'), ('liàn', '媡'), ('liàn', '湅'), ('liàn', '萰'), ('liàn', '楝'), ('liàn', '煉'), ('liàn', '瑓'),
              ('liàn', '稴'), ('liàn', '練'), ('liàn', '澰'), ('liàn', '錬'), ('liàn', '殮'), ('liàn', '鍊'), ('liàn', '鏈'),
              ('liàn', '瀲'), ('liàn', '鰊'), ('liàn', '戀'), ('liàn', '纞'), ('liàn', '㜃'), ('liàn', '㱨'), ('liàn', '㪝'),
              ('liàn', '㼑'), ('liàn', '㶑'), ('liàn', '㜻')]
    liang_1 = []
    liang_2 = [('liáng', '量'), ('liáng', '良'), ('liáng', '梁'), ('liáng', '凉'), ('liáng', '粮'), ('liáng', '踉'),
               ('liáng', '粱'), ('liáng', '俍'), ('liáng', '莨'), ('liáng', '涼'), ('liáng', '椋'), ('liáng', '辌'),
               ('liáng', '墚'), ('liáng', '樑'), ('liáng', '輬'), ('liáng', '駺'), ('liáng', '糧'), ('liáng', '㹁'),
               ('liáng', '䝶'), ('liáng', '䣼'), ('liáng', '䭪'), ('liáng', '补')]
    liang_3 = [('liǎng', '两'), ('liǎng', '俩'), ('liǎng', '魉'), ('liǎng', '両'), ('liǎng', '兩'), ('liǎng', '倆'),
               ('liǎng', '唡'), ('liǎng', '啢'), ('liǎng', '掚'), ('liǎng', '脼'), ('liǎng', '裲'), ('liǎng', '緉'),
               ('liǎng', '蜽'), ('liǎng', '魎'), ('liǎng', '㒳'), ('liǎng', '㔝'), ('liǎng', '䓣'), ('liǎng', '䠃'),
               ('liǎng', '䩫')]
    liang_4 = [('liàng', '亮'), ('liàng', '辆'), ('liàng', '谅'), ('liàng', '靓'), ('liàng', '晾'), ('liàng', '倞'),
               ('liàng', '哴'), ('liàng', '悢'), ('liàng', '喨'), ('liàng', '湸'), ('liàng', '輌'), ('liàng', '諒'),
               ('liàng', '輛'), ('liàng', '鍄'), ('liàng', '㾗'), ('liàng', '䀶'), ('liàng', '䁁')]
    liao_1 = [('liāo', '撩'), ('liāo', '蹽')]
    liao_2 = [('liáo', '聊'), ('liáo', '疗'), ('liáo', '辽'), ('liáo', '缪'), ('liáo', '僚'), ('liáo', '寥'), ('liáo', '缭'),
              ('liáo', '潦'), ('liáo', '燎'), ('liáo', '嘹'), ('liáo', '獠'), ('liáo', '寮'), ('liáo', '窌'), ('liáo', '尞'),
              ('liáo', '嵺'), ('liáo', '憀'), ('liáo', '摎'), ('liáo', '漻'), ('liáo', '膋'), ('liáo', '嫽'), ('liáo', '嶚'),
              ('liáo', '嶛'), ('liáo', '敹'), ('liáo', '樛'), ('liáo', '遼'), ('liáo', '暸'), ('liáo', '橑'), ('liáo', '璙'),
              ('liáo', '膫'), ('liáo', '療'), ('liáo', '竂'), ('liáo', '鹩'), ('liáo', '屪'), ('liáo', '廫'), ('liáo', '簝'),
              ('liáo', '繚'), ('liáo', '藔'), ('liáo', '蟟'), ('liáo', '蟧'), ('liáo', '豂'), ('liáo', '賿'), ('liáo', '蹘'),
              ('liáo', '爎'), ('liáo', '爒'), ('liáo', '飂'), ('liáo', '髎'), ('liáo', '飉'), ('liáo', '鷯'), ('liáo', '㝋'),
              ('liáo', '䒿'), ('liáo', '㜃'), ('liáo', '㨓'), ('liáo', '䜮'), ('liáo', '䣈'), ('liáo', '㙩'), ('liáo', '㞠'),
              ('liáo', '㵳'), ('liáo', '䝀'), ('liáo', '䕞'), ('liáo', '䜍'), ('liáo', '䝤'), ('liáo', '䨅')]
    liao_3 = [('liǎo', '了'), ('liǎo', '蓼'), ('liǎo', '钌'), ('liǎo', '釕'), ('liǎo', '鄝'), ('liǎo', '憭'), ('liǎo', '瞭'),
              ('liǎo', '繆'), ('liǎo', '曢'), ('liǎo', '镽'), ('liǎo', '䄦'), ('liǎo', '䑠'), ('liǎo', '㶫'), ('liǎo', '䩍')]
    liao_4 = [('liào', '料'), ('liào', '廖'), ('liào', '撂'), ('liào', '镣'), ('liào', '尥'), ('liào', '尦'), ('liào', '炓'),
              ('liào', '窷'), ('liào', '鐐'), ('liào', '㡻'), ('liào', '䉼'), ('liào', '䎆'), ('liào', '㺒'), ('liào', '䢧'),
              ('liào', '䍡')]
    lie_1 = []
    lie_2 = [('liě', '咧'), ('liě', '忚'), ('liě', '毟'), ('liě', '挘'), ('liě', '䟩')]
    lie_3 = [('liè', '列'), ('liè', '烈'), ('liè', '裂'), ('liè', '猎'), ('liè', '劣'), ('liè', '冽'), ('liè', '趔'),
             ('liè', '鬣'), ('liè', '劦'), ('liè', '劽'), ('liè', '姴'), ('liè', '挒'), ('liè', '洌'), ('liè', '茢'),
             ('liè', '迾'), ('liè', '哷'), ('liè', '埒'), ('liè', '埓'), ('liè', '栵'), ('liè', '浖'), ('liè', '烮'),
             ('liè', '捩'), ('liè', '猟'), ('liè', '脟'), ('liè', '棙'), ('liè', '蛚'), ('liè', '煭'), ('liè', '聗'),
             ('liè', '綟'), ('liè', '巤'), ('liè', '獦'), ('liè', '颲'), ('liè', '燤'), ('liè', '儠'), ('liè', '巁'),
             ('liè', '鮤'), ('liè', '鴷'), ('liè', '擸'), ('liè', '爄'), ('liè', '獵'), ('liè', '爉'), ('liè', '犣'),
             ('liè', '躐'), ('liè', '鬛'), ('liè', '鱲'), ('liè', '㧜'), ('liè', '㤠'), ('liè', '㭞'), ('liè', '㭩'),
             ('liè', '㸹'), ('liè', '䅀'), ('liè', '䓟'), ('liè', '䴕'), ('liè', '㽟'), ('liè', '㼲'), ('liè', '䟹'),
             ('liè', '䬅'), ('liè', '䮋'), ('liè', '㻺'), ('liè', '㯿'), ('liè', '㲱'), ('liè', '㸊'), ('liè', '䁽'),
             ('liè', '䉭'), ('liè', '䶛'), ('liè', '䜲'), ('liè', '䝓'), ('liè', '㬯'), ('liè', '䪉')]
    lin_1 = [('līn', '拎')]
    lin_2 = [('lín', '林'), ('lín', '临'), ('lín', '邻'), ('lín', '琳'), ('lín', '麟'), ('lín', '淋'), ('lín', '霖'),
             ('lín', '鳞'), ('lín', '磷'), ('lín', '粼'), ('lín', '嶙'), ('lín', '遴'), ('lín', '辚'), ('lín', '瞵'),
             ('lín', '厸'), ('lín', '阾'), ('lín', '冧'), ('lín', '啉'), ('lín', '崊'), ('lín', '惏'), ('lín', '晽'),
             ('lín', '粦'), ('lín', '碄'), ('lín', '箖'), ('lín', '綝'), ('lín', '鄰'), ('lín', '隣'), ('lín', '潾'),
             ('lín', '獜'), ('lín', '斴'), ('lín', '暽'), ('lín', '燐'), ('lín', '璘'), ('lín', '疄'), ('lín', '臨'),
             ('lín', '繗'), ('lín', '翷'), ('lín', '麐'), ('lín', '轔'), ('lín', '壣'), ('lín', '瀶'), ('lín', '鏻'),
             ('lín', '驎'), ('lín', '鱗'), ('lín', '㝝'), ('lín', '㖼'), ('lín', '㔂'), ('lín', '㝺'), ('lín', '㷠'),
             ('lín', '䢯'), ('lín', '䫐'), ('lín', '䚬'), ('lín', '䮼')]
    lin_3 = [('lǐn', '凛'), ('lǐn', '廪'), ('lǐn', '懔'), ('lǐn', '菻'), ('lǐn', '亃'), ('lǐn', '僯'), ('lǐn', '凜'),
             ('lǐn', '撛'), ('lǐn', '廩'), ('lǐn', '懍'), ('lǐn', '澟'), ('lǐn', '檁'), ('lǐn', '檩'), ('lǐn', '癛'),
             ('lǐn', '癝'), ('lǐn', '㐭'), ('lǐn', '㨆'), ('lǐn', '䢧'), ('lǐn', '䕲')]
    lin_4 = [('lìn', '吝'), ('lìn', '赁'), ('lìn', '躏'), ('lìn', '蔺'), ('lìn', '恡'), ('lìn', '悋'), ('lìn', '焛'),
             ('lìn', '痳'), ('lìn', '賃'), ('lìn', '橉'), ('lìn', '甐'), ('lìn', '膦'), ('lìn', '閵'), ('lìn', '藺'),
             ('lìn', '蹸'), ('lìn', '躙'), ('lìn', '躪'), ('lìn', '轥'), ('lìn', '㖁'), ('lìn', '䟹'), ('lìn', '䗲'),
             ('lìn', '䚏'), ('lìn', '䫰'), ('lìn', '䉮')]
    ling_1 = [('líng', '令'), ('líng', '灵'), ('líng', '凌'), ('líng', '陵'), ('líng', '零'), ('líng', '铃'), ('líng', '龄'),
              ('líng', '玲'), ('líng', '翎'), ('líng', '菱'), ('líng', '伶'), ('líng', '绫'), ('líng', '聆'), ('líng', '棱'),
              ('líng', '符'), ('líng', '苓'), ('líng', '泠'), ('líng', '棂'), ('líng', '羚'), ('líng', '囹'), ('líng', '蛉'),
              ('líng', '刢'), ('líng', '呤'), ('líng', '坽'), ('líng', '夌'), ('líng', '姈'), ('líng', '彾'), ('líng', '狑'),
              ('líng', '昤'), ('líng', '朎'), ('líng', '柃'), ('líng', '瓴'), ('líng', '皊'), ('líng', '砱'), ('líng', '秢'),
              ('líng', '竛'), ('líng', '羐'), ('líng', '鸰'), ('líng', '婈'), ('líng', '崚'), ('líng', '掕'), ('líng', '淩'),
              ('líng', '琌'), ('líng', '笭'), ('líng', '紷'), ('líng', '舲'), ('líng', '衑'), ('líng', '祾'), ('líng', '詅'),
              ('líng', '跉'), ('líng', '軨'), ('líng', '稜'), ('líng', '蓤'), ('líng', '裬'), ('líng', '鈴'), ('líng', '閝'),
              ('líng', '綾'), ('líng', '蔆'), ('líng', '輘'), ('líng', '霊'), ('líng', '駖'), ('líng', '澪'), ('líng', '蕶'),
              ('líng', '錂'), ('líng', '霗'), ('líng', '魿'), ('líng', '鲮'), ('líng', '鴒'), ('líng', '鹷'), ('líng', '燯'),
              ('líng', '霛'), ('líng', '霝'), ('líng', '齢'), ('líng', '酃'), ('líng', '鯪'), ('líng', '孁'), ('líng', '齡'),
              ('líng', '櫺'), ('líng', '醽'), ('líng', '靈'), ('líng', '欞'), ('líng', '爧'), ('líng', '麢'), ('líng', '龗'),
              ('líng', '㡵'), ('líng', '㸳'), ('líng', '㾉'), ('líng', '㖫'), ('líng', '㥄'), ('líng', '㭩'), ('líng', '㻏'),
              ('líng', '䍅'), ('líng', '䧙'), ('líng', '㱥'), ('líng', '䠲'), ('líng', '䈊'), ('líng', '䔖'), ('líng', '䯍'),
              ('líng', '㲆'), ('líng', '㬡'), ('líng', '㯪'), ('líng', '䉁'), ('líng', '䕘'), ('líng', '䨩'), ('líng', '䉖'),
              ('líng', '䙥'), ('líng', '䌢'), ('líng', '㪮'), ('líng', '䡼'), ('líng', '䴇'), ('líng', '䴫'), ('líng', '㦭'),
              ('líng', '䖅'), ('líng', '䄥'), ('líng', '䉹'), ('líng', '䚖'), ('líng', '䡿'), ('líng', '䰱'), ('líng', '䴒')]
    ling_2 = [('lǐng', '领'), ('lǐng', '岭'), ('lǐng', '袊'), ('lǐng', '岺'), ('lǐng', '領'), ('lǐng', '嶺')]
    ling_3 = [('lìng', '另'), ('lìng', '炩'), ('lìng', '蘦')]
    liu_1 = [('liū', '溜'), ('liū', '蹓'), ('liū', '熘'), ('liū', '澑')]
    liu_2 = [('liú', '流'), ('liú', '留'), ('liú', '刘'), ('liú', '浏'), ('liú', '琉'), ('liú', '瘤'), ('liú', '榴'),
             ('liú', '硫'), ('liú', '旒'), ('liú', '骝'), ('liú', '畄'), ('liú', '斿'), ('liú', '旈'), ('liú', '畱'),
             ('liú', '裗'), ('liú', '媹'), ('liú', '嵧'), ('liú', '蒥'), ('liú', '蓅'), ('liú', '摎'), ('liú', '漻'),
             ('liú', '瑠'), ('liú', '飗'), ('liú', '劉'), ('liú', '瑬'), ('liú', '磂'), ('liú', '镏'), ('liú', '駠'),
             ('liú', '鹠'), ('liú', '橊'), ('liú', '璢'), ('liú', '疁'), ('liú', '镠'), ('liú', '癅'), ('liú', '蟉'),
             ('liú', '駵'), ('liú', '嚠'), ('liú', '懰'), ('liú', '瀏'), ('liú', '藰'), ('liú', '鎏'), ('liú', '鎦'),
             ('liú', '麍'), ('liú', '鏐'), ('liú', '飀'), ('liú', '鐂'), ('liú', '騮'), ('liú', '飅'), ('liú', '鰡'),
             ('liú', '鶹'), ('liú', '驑'), ('liú', '㝋'), ('liú', '㐬'), ('liú', '㳅'), ('liú', '㽞'), ('liú', '䭷'),
             ('liú', '䋷'), ('liú', '䗜'), ('liú', '㵳'), ('liú', '䝀'), ('liú', '䚧'), ('liú', '䱖'), ('liú', '䱞'),
             ('liú', '䉧'), ('liú', '䰘'), ('liú', '䶉'), ('liú', '䬟')]
    liu_3 = [('liǔ', '柳'), ('liǔ', '绺'), ('liǔ', '栁'), ('liǔ', '桞'), ('liǔ', '珋'), ('liǔ', '桺'), ('liǔ', '锍'),
             ('liǔ', '綹'), ('liǔ', '熮'), ('liǔ', '罶'), ('liǔ', '鋶'), ('liǔ', '橮'), ('liǔ', '嬼'), ('liǔ', '羀'),
             ('liǔ', '䒥'), ('liǔ', '㧕'), ('liǔ', '䉹')]
    liu_4 = [('liù', '六'), ('liù', '碌'), ('liù', '遛'), ('liù', '窌'), ('liù', '翏'), ('liù', '塯'), ('liù', '廇'),
             ('liù', '馏'), ('liù', '磟'), ('liù', '鹨'), ('liù', '霤'), ('liù', '餾'), ('liù', '雡'), ('liù', '飂'),
             ('liù', '鬸'), ('liù', '鷚'), ('liù', '㶯'), ('liù', '䄂'), ('liù', '㙀'), ('liù', '㨨'), ('liù', '㽌')]
    lo_1 = [('lo', '咯')]
    long_1 = [('lóng', '龙'), ('lóng', '隆'), ('lóng', '笼'), ('lóng', '咙'), ('lóng', '胧'), ('lóng', '聋'), ('lóng', '珑'),
              ('lóng', '窿'), ('lóng', '泷'), ('lóng', '茏'), ('lóng', '栊'), ('lóng', '眬'), ('lóng', '屸'), ('lóng', '尨'),
              ('lóng', '昽'), ('lóng', '砻'), ('lóng', '竜'), ('lóng', '湰'), ('lóng', '滝'), ('lóng', '嶐'), ('lóng', '槞'),
              ('lóng', '漋'), ('lóng', '癃'), ('lóng', '篭'), ('lóng', '龍'), ('lóng', '蘢'), ('lóng', '鏧'), ('lóng', '霳'),
              ('lóng', '嚨'), ('lóng', '巃'), ('lóng', '巄'), ('lóng', '瀧'), ('lóng', '曨'), ('lóng', '朧'), ('lóng', '櫳'),
              ('lóng', '爖'), ('lóng', '瓏'), ('lóng', '襱'), ('lóng', '矓'), ('lóng', '礱'), ('lóng', '礲'), ('lóng', '蠪'),
              ('lóng', '蠬'), ('lóng', '龒'), ('lóng', '龓'), ('lóng', '籠'), ('lóng', '聾'), ('lóng', '豅'), ('lóng', '躘'),
              ('lóng', '靇'), ('lóng', '鑨'), ('lóng', '驡'), ('lóng', '鸗'), ('lóng', '㚅'), ('lóng', '㝫'), ('lóng', '㦕'),
              ('lóng', '㡣'), ('lóng', '䃧'), ('lóng', '㰍'), ('lóng', '䆍'), ('lóng', '䙪'), ('lóng', '䥢'), ('lóng', '䏊'),
              ('lóng', '䪊')]
    long_2 = [('lǒng', '拢'), ('lǒng', '陇'), ('lǒng', '垄'), ('lǒng', '垅'), ('lǒng', '篢'), ('lǒng', '隴'), ('lǒng', '儱'),
              ('lǒng', '壟'), ('lǒng', '壠'), ('lǒng', '攏'), ('lǒng', '竉'), ('lǒng', '㙙'), ('lǒng', '㴳'), ('lǒng', '䡁')]
    long_3 = [('lòng', '弄'), ('lòng', '哢'), ('lòng', '梇'), ('lòng', '硦'), ('lòng', '徿'), ('lòng', '贚'), ('lòng', '㑝'),
              ('lòng', '㛞'), ('lòng', '㟖'), ('lòng', '㢅'), ('lòng', '㳥')]
    lou_1 = [('lōu', '䁖')]
    lou_2 = [('lóu', '楼'), ('lóu', '喽'), ('lóu', '娄'), ('lóu', '髅'), ('lóu', '偻'), ('lóu', '蝼'), ('lóu', '剅'),
             ('lóu', '婁'), ('lóu', '溇'), ('lóu', '蒌'), ('lóu', '僂'), ('lóu', '嘍'), ('lóu', '寠'), ('lóu', '廔'),
             ('lóu', '慺'), ('lóu', '漊'), ('lóu', '蔞'), ('lóu', '遱'), ('lóu', '樓'), ('lóu', '熡'), ('lóu', '耧'),
             ('lóu', '瞜'), ('lóu', '耬'), ('lóu', '艛'), ('lóu', '螻'), ('lóu', '謱'), ('lóu', '貗'), ('lóu', '軁'),
             ('lóu', '鞻'), ('lóu', '髏'), ('lóu', '鷜'), ('lóu', '㲎'), ('lóu', '㥪'), ('lóu', '䣚'), ('lóu', '㟺'),
             ('lóu', '㡞'), ('lóu', '㺏'), ('lóu', '䄛'), ('lóu', '䅹'), ('lóu', '䝏'), ('lóu', '䫫'), ('lóu', '䮫'),
             ('lóu', '䱾')]
    lou_3 = [('lǒu', '搂'), ('lǒu', '篓'), ('lǒu', '嵝'), ('lǒu', '塿'), ('lǒu', '嶁'), ('lǒu', '摟'), ('lǒu', '甊'),
             ('lǒu', '簍'), ('lǒu', '㪹')]
    lou_4 = [('lòu', '露'), ('lòu', '漏'), ('lòu', '陋'), ('lòu', '镂'), ('lòu', '屚'), ('lòu', '瘘'), ('lòu', '瘺'),
             ('lòu', '瘻'), ('lòu', '鏤'), ('lòu', '㔷')]
    lou_5 = []
    lu_1 = [('lū', '噜'), ('lū', '撸'), ('lū', '謢'), ('lū', '嚕'), ('lū', '擼')]
    lu_2 = [('lú', '卢'), ('lú', '炉'), ('lú', '芦'), ('lú', '庐'), ('lú', '颅'), ('lú', '垆'), ('lú', '泸'), ('lú', '胪'),
            ('lú', '轳'), ('lú', '鲈'), ('lú', '枦'), ('lú', '栌'), ('lú', '舮'), ('lú', '鸬'), ('lú', '玈'), ('lú', '舻'),
            ('lú', '鈩'), ('lú', '馿'), ('lú', '魲'), ('lú', '盧'), ('lú', '嚧'), ('lú', '壚'), ('lú', '廬'), ('lú', '攎'),
            ('lú', '瀘'), ('lú', '獹'), ('lú', '璷'), ('lú', '蘆'), ('lú', '曥'), ('lú', '櫨'), ('lú', '爐'), ('lú', '瓐'),
            ('lú', '臚'), ('lú', '矑'), ('lú', '籚'), ('lú', '纑'), ('lú', '罏'), ('lú', '艫'), ('lú', '蠦'), ('lú', '轤'),
            ('lú', '鑪'), ('lú', '顱'), ('lú', '髗'), ('lú', '鱸'), ('lú', '鸕'), ('lú', '黸'), ('lú', '㢳'), ('lú', '㭔'),
            ('lú', '䡎'), ('lú', '䣚'), ('lú', '䮉'), ('lú', '㠠'), ('lú', '㪭'), ('lú', '㱺'), ('lú', '㿖'), ('lú', '䰕')]
    lu_3 = [('lǔ', '鲁'), ('lǔ', '虏'), ('lǔ', '掳'), ('lǔ', '卤'), ('lǔ', '橹'), ('lǔ', '鹵'), ('lǔ', '硵'), ('lǔ', '虜'),
            ('lǔ', '塷'), ('lǔ', '滷'), ('lǔ', '蓾'), ('lǔ', '樐'), ('lǔ', '澛'), ('lǔ', '魯'), ('lǔ', '擄'), ('lǔ', '氇'),
            ('lǔ', '磠'), ('lǔ', '穞'), ('lǔ', '镥'), ('lǔ', '瀂'), ('lǔ', '櫓'), ('lǔ', '氌'), ('lǔ', '艣'), ('lǔ', '鏀'),
            ('lǔ', '艪'), ('lǔ', '鐪'), ('lǔ', '鑥'), ('lǔ', '㔪'), ('lǔ', '㢚'), ('lǔ', '㯭'), ('lǔ', '䲐')]
    lu_4 = [('lù', '路'), ('lù', '六'), ('lù', '露'), ('lù', '录'), ('lù', '绿'), ('lù', '陆'), ('lù', '禄'), ('lù', '鹿'),
            ('lù', '碌'), ('lù', '戮'), ('lù', '赂'), ('lù', '璐'), ('lù', '漉'), ('lù', '麓'), ('lù', '辘'), ('lù', '鹭'),
            ('lù', '辂'), ('lù', '潞'), ('lù', '渌'), ('lù', '箓'), ('lù', '蓼'), ('lù', '圥'), ('lù', '甪'), ('lù', '侓'),
            ('lù', '坴'), ('lù', '彔'), ('lù', '峍'), ('lù', '勎'), ('lù', '陸'), ('lù', '娽'), ('lù', '淕'), ('lù', '淥'),
            ('lù', '硉'), ('lù', '菉'), ('lù', '逯'), ('lù', '椂'), ('lù', '琭'), ('lù', '祿'), ('lù', '僇'), ('lù', '剹'),
            ('lù', '勠'), ('lù', '盝'), ('lù', '睩'), ('lù', '稑'), ('lù', '賂'), ('lù', '輅'), ('lù', '塶'), ('lù', '廘'),
            ('lù', '摝'), ('lù', '粶'), ('lù', '緑'), ('lù', '蔍'), ('lù', '樚'), ('lù', '熝'), ('lù', '膔'), ('lù', '趢'),
            ('lù', '踛'), ('lù', '醁'), ('lù', '穋'), ('lù', '蕗'), ('lù', '錄'), ('lù', '録'), ('lù', '錴'), ('lù', '簏'),
            ('lù', '螰'), ('lù', '鴼'), ('lù', '簶'), ('lù', '蹗'), ('lù', '轆'), ('lù', '騄'), ('lù', '簬'), ('lù', '簵'),
            ('lù', '鏕'), ('lù', '鯥'), ('lù', '鵦'), ('lù', '鵱'), ('lù', '鏴'), ('lù', '騼'), ('lù', '籙'), ('lù', '觻'),
            ('lù', '虂'), ('lù', '鷺'), ('lù', '㓐'), ('lù', '㖨'), ('lù', '㛬'), ('lù', '㟤'), ('lù', '㪐'), ('lù', '㪖'),
            ('lù', '㫽'), ('lù', '䐂'), ('lù', '䘵'), ('lù', '㜙'), ('lù', '㦇'), ('lù', '䎑'), ('lù', '䎼'), ('lù', '㼾'),
            ('lù', '䚄'), ('lù', '䟿'), ('lù', '䡜'), ('lù', '㯟'), ('lù', '䃙'), ('lù', '䍡'), ('lù', '㯝'), ('lù', '䌒'),
            ('lù', '䩮'), ('lù', '䱚'), ('lù', '䴪')]
    luan_1 = [('luán', '鸾'), ('luán', '峦'), ('luán', '挛'), ('luán', '栾'), ('luán', '銮'), ('luán', '孪'), ('luán', '滦'),
              ('luán', '娈'), ('luán', '脔'), ('luán', '鵉'), ('luán', '圝'), ('luán', '奱'), ('luán', '孌'), ('luán', '孿'),
              ('luán', '巒'), ('luán', '攣'), ('luán', '曫'), ('luán', '欒'), ('luán', '灓'), ('luán', '羉'), ('luán', '臠'),
              ('luán', '臡'), ('luán', '圞'), ('luán', '灤'), ('luán', '虊'), ('luán', '鑾'), ('luán', '癴'), ('luán', '癵'),
              ('luán', '鸞'), ('luán', '㼑'), ('luán', '䜌'), ('luán', '㡩'), ('luán', '㱍'), ('luán', '㝈'), ('luán', '䖂'),
              ('luán', '䚕'), ('luán', '补')]
    luan_2 = [('luǎn', '卵'), ('luǎn', '覶'), ('luǎn', '㰸')]
    luan_3 = [('luàn', '乱'), ('luàn', '釠'), ('luàn', '乿'), ('luàn', '亂'), ('luàn', '薍')]
    lun_1 = [('lūn', '抡'), ('lūn', '掄')]
    lun_2 = [('lún', '轮'), ('lún', '伦'), ('lún', '仑'), ('lún', '沦'), ('lún', '纶'), ('lún', '囵'), ('lún', '芲'),
             ('lún', '侖'), ('lún', '倫'), ('lún', '陯'), ('lún', '圇'), ('lún', '婨'), ('lún', '崘'), ('lún', '崙'),
             ('lún', '淪'), ('lún', '菕'), ('lún', '棆'), ('lún', '腀'), ('lún', '碖'), ('lún', '綸'), ('lún', '耣'),
             ('lún', '蜦'), ('lún', '踚'), ('lún', '輪'), ('lún', '磮'), ('lún', '錀'), ('lún', '鯩'), ('lún', '㖮'),
             ('lún', '㷍'), ('lún', '䈁'), ('lún', '䑳')]
    lun_3 = [('lǔn', '埨'), ('lǔn', '惀'), ('lǔn', '稐'), ('lǔn', '㤻'), ('lǔn', '㕢')]
    lun_4 = [('lùn', '论'), ('lùn', '溣'), ('lùn', '論')]
    luo_1 = [('luō', '啰'), ('luō', '捋'), ('luō', '頱'), ('luō', '囉')]
    luo_2 = [('luó', '罗'), ('luó', '逻'), ('luó', '萝'), ('luó', '锣'), ('luó', '骡'), ('luó', '螺'), ('luó', '箩'),
             ('luó', '寽'), ('luó', '猡'), ('luó', '脶'), ('luó', '椤'), ('luó', '腡'), ('luó', '镙'), ('luó', '攎'),
             ('luó', '羅'), ('luó', '覶'), ('luó', '鏍'), ('luó', '儸'), ('luó', '覼'), ('luó', '騾'), ('luó', '攞'),
             ('luó', '玀'), ('luó', '蘿'), ('luó', '邏'), ('luó', '欏'), ('luó', '驘'), ('luó', '鸁'), ('luó', '籮'),
             ('luó', '鑼'), ('luó', '饠'), ('luó', '囖'), ('luó', '㑩'), ('luó', '㾖'), ('luó', '䊨'), ('luó', '㼈'),
             ('luó', '㽋'), ('luó', '䯁')]
    luo_3 = [('luǒ', '裸'), ('luǒ', '蠃'), ('luǒ', '剆'), ('luǒ', '倮'), ('luǒ', '砢'), ('luǒ', '蓏'), ('luǒ', '躶'),
             ('luǒ', '瘰'), ('luǒ', '臝'), ('luǒ', '曪'), ('luǒ', '攭'), ('luǒ', '癳'), ('luǒ', '㕵'), ('luǒ', '䲞'),
             ('luǒ', '㵣'), ('luǒ', '㩡'), ('luǒ', '㰁'), ('luǒ', '䙨'), ('luǒ', '㦬'), ('luǒ', '㒩'), ('luǒ', '㱻')]
    luo_4 = [('luò', '落'), ('luò', '络'), ('luò', '洛'), ('luò', '骆'), ('luò', '咯'), ('luò', '烙'), ('luò', '珞'),
             ('luò', '摞'), ('luò', '雒'), ('luò', '泺'), ('luò', '峈'), ('luò', '荦'), ('luò', '洜'), ('luò', '捰'),
             ('luò', '渃'), ('luò', '硌'), ('luò', '硦'), ('luò', '笿'), ('luò', '絡'), ('luò', '蛒'), ('luò', '跞'),
             ('luò', '詻'), ('luò', '漯'), ('luò', '犖'), ('luò', '駱'), ('luò', '磱'), ('luò', '鮥'), ('luò', '鵅'),
             ('luò', '擽'), ('luò', '濼'), ('luò', '攊'), ('luò', '皪'), ('luò', '躒'), ('luò', '纙'), ('luò', '㓢'),
             ('luò', '㖀'), ('luò', '㪾'), ('luò', '䀩'), ('luò', '䉿'), ('luò', '䎅'), ('luò', '㴖'), ('luò', '㮝'),
             ('luò', '䈁'), ('luò', '䃕'), ('luò', '䈷'), ('luò', '䇔'), ('luò', '䉓'), ('luò', '䌱'), ('luò', '㿚'),
             ('luò', '䌴')]
    lv_1 = [('lǘ', '驴'), ('lǘ', '闾'), ('lǘ', '榈'), ('lǘ', '閭'), ('lǘ', '氀'), ('lǘ', '膢'), ('lǘ', '瞜'), ('lǘ', '櫚'),
            ('lǘ', '藘'), ('lǘ', '驢'), ('lǘ', '䕡')]
    lv_2 = [('lǚ', '旅'), ('lǚ', '吕'), ('lǚ', '履'), ('lǚ', '屡'), ('lǚ', '侣'), ('lǚ', '缕'), ('lǚ', '捋'), ('lǚ', '铝'),
            ('lǚ', '褛'), ('lǚ', '偻'), ('lǚ', '膂'), ('lǚ', '呂'), ('lǚ', '郘'), ('lǚ', '侶'), ('lǚ', '挔'), ('lǚ', '捛'),
            ('lǚ', '梠'), ('lǚ', '焒'), ('lǚ', '祣'), ('lǚ', '稆'), ('lǚ', '絽'), ('lǚ', '僂'), ('lǚ', '屢'), ('lǚ', '慺'),
            ('lǚ', '鋁'), ('lǚ', '膐'), ('lǚ', '褸'), ('lǚ', '儢'), ('lǚ', '縷'), ('lǚ', '穭'), ('lǚ', '鷜')]
    lv_3 = [('lǜ', '率'), ('lǜ', '律'), ('lǜ', '绿'), ('lǜ', '虑'), ('lǜ', '滤'), ('lǜ', '氯'), ('lǜ', '垏'), ('lǜ', '哷'),
            ('lǜ', '嵂'), ('lǜ', '葎'), ('lǜ', '綠'), ('lǜ', '緑'), ('lǜ', '慮'), ('lǜ', '箻'), ('lǜ', '膟'), ('lǜ', '勴'),
            ('lǜ', '繂'), ('lǜ', '濾'), ('lǜ', '櫖'), ('lǜ', '爈'), ('lǜ', '卛'), ('lǜ', '鑢'), ('lǜ', '㲶'), ('lǜ', '㠥')]
    lve_1 = [('lüe', '略'), ('lüe', '掠'), ('lüe', '寽'), ('lüe', '畧'), ('lüe', '锊'), ('lüe', '稤'), ('lüe', '圙'),
             ('lüe', '鋝'), ('lüe', '鋢'), ('lüe', '䤚'), ('lüe', '㗉'), ('lüe', '㔀'), ('lüe', '㨼')]
    ma_1 = [('mā', '妈'), ('mā', '摩'), ('mā', '抹'), ('mā', '亇'), ('mā', '孖'), ('mā', '庅'), ('mā', '媽'), ('mā', '嫲')]
    ma_2 = [('má', '吗'), ('má', '麻'), ('má', '嘛'), ('má', '蟆'), ('má', '菻'), ('má', '嗎'), ('má', '痲'), ('má', '痳'),
            ('má', '蔴'), ('má', '犘'), ('má', '蟇'), ('má', '㦄'), ('má', '䗫'), ('má', '䳸')]
    ma_3 = [('mǎ', '马'), ('mǎ', '码'), ('mǎ', '玛'), ('mǎ', '蚂'), ('mǎ', '犸'), ('mǎ', '馬'), ('mǎ', '溤'), ('mǎ', '獁'),
            ('mǎ', '遤'), ('mǎ', '瑪'), ('mǎ', '碼'), ('mǎ', '螞'), ('mǎ', '鎷'), ('mǎ', '鰢'), ('mǎ', '鷌'), ('mǎ', '㐷'),
            ('mǎ', '䣕'), ('mǎ', '䣖')]
    ma_4 = [('mà', '骂'), ('mà', '杩'), ('mà', '祃'), ('mà', '閁'), ('mà', '傌'), ('mà', '睰'), ('mà', '嘜'), ('mà', '榪'),
            ('mà', '禡'), ('mà', '罵'), ('mà', '駡'), ('mà', '鬕'), ('mà', '䀣'), ('mà', '䧞'), ('mà', '㑻'), ('mà', '㨸'),
            ('mà', '㾺'), ('mà', '䠋'), ('mà', '㜫'), ('mà', '䠨'), ('mà', '䯦')]
    ma_5 = [('ma', '么'), ('ma', '麽')]
    mai_1 = [('mái', '埋'), ('mái', '霾'), ('mái', '薶'), ('mái', '㜥'), ('mái', '䁲'), ('mái', '㦟'), ('mái', '䨪'),
             ('mái', '䚑'), ('mái', '䳸')]
    mai_2 = [('mǎi', '买'), ('mǎi', '荬'), ('mǎi', '買'), ('mǎi', '嘪'), ('mǎi', '蕒'), ('mǎi', '鷶')]
    mai_3 = [('mài', '卖'), ('mài', '麦'), ('mài', '迈'), ('mài', '脉'), ('mài', '劢'), ('mài', '佅'), ('mài', '売'),
             ('mài', '唛'), ('mài', '脈'), ('mài', '麥'), ('mài', '衇'), ('mài', '勱'), ('mài', '賣'), ('mài', '邁'),
             ('mài', '霡'), ('mài', '霢'), ('mài', '䘑'), ('mài', '䈿'), ('mài', '䜕'), ('mài', '䨫'), ('mài', '䮮')]
    man_1 = [('mān', '颟'), ('mān', '顢')]
    man_2 = [('mán', '埋'), ('mán', '瞒'), ('mán', '蛮'), ('mán', '馒'), ('mán', '谩'), ('mán', '鳗'), ('mán', '姏'),
             ('mán', '悗'), ('mán', '絻'), ('mán', '慲'), ('mán', '摱'), ('mán', '樠'), ('mán', '瞞'), ('mán', '鞔'),
             ('mán', '謾'), ('mán', '饅'), ('mán', '鬗'), ('mán', '鬘'), ('mán', '鰻'), ('mán', '蠻'), ('mán', '䒥'),
             ('mán', '㒼'), ('mán', '㗄'), ('mán', '㙢'), ('mán', '䑱'), ('mán', '䛲'), ('mán', '䯶'), ('mán', '㿸'),
             ('mán', '䅼'), ('mán', '䊡'), ('mán', '䐽'), ('mán', '䟂'), ('mán', '䰋')]
    man_3 = [('mǎn', '满'), ('mǎn', '娨'), ('mǎn', '屘'), ('mǎn', '満'), ('mǎn', '滿'), ('mǎn', '螨'), ('mǎn', '襔'),
             ('mǎn', '蟎'), ('mǎn', '鏋'), ('mǎn', '矕'), ('mǎn', '㛧'), ('mǎn', '䜱')]
    man_4 = [('màn', '慢'), ('màn', '曼'), ('màn', '漫'), ('màn', '蔓'), ('màn', '幔'), ('màn', '嫚'), ('màn', '缦'),
             ('màn', '僈'), ('màn', '鄤'), ('màn', '墁'), ('màn', '獌'), ('màn', '蔄'), ('màn', '槾'), ('màn', '澫'),
             ('màn', '熳'), ('màn', '澷'), ('màn', '镘'), ('màn', '㵘'), ('màn', '縵'), ('màn', '鏝'), ('màn', '蘰'),
             ('màn', '㗈'), ('màn', '㬅'), ('màn', '㡢'), ('màn', '䕕'), ('màn', '䝡'), ('màn', '䝢'), ('màn', '䡬'),
             ('màn', '䨫')]
    mang_1 = [('māng', '牤')]
    mang_2 = [('máng', '忙'), ('máng', '茫'), ('máng', '芒'), ('máng', '盲'), ('máng', '氓'), ('máng', '邙'), ('máng', '吂'),
              ('máng', '汒'), ('máng', '尨'), ('máng', '杗'), ('máng', '杧'), ('máng', '盳'), ('máng', '厖'), ('máng', '恾'),
              ('máng', '笀'), ('máng', '哤'), ('máng', '娏'), ('máng', '庬'), ('máng', '浝'), ('máng', '狵'), ('máng', '朚'),
              ('máng', '牻'), ('máng', '硭'), ('máng', '釯'), ('máng', '铓'), ('máng', '痝'), ('máng', '蛖'), ('máng', '鋩'),
              ('máng', '駹'), ('máng', '蘉'), ('máng', '㝑'), ('máng', '㟌'), ('máng', '㻊'), ('máng', '䀮'), ('máng', '䅒'),
              ('máng', '㜃'), ('máng', '㡛'), ('máng', '䟥'), ('máng', '㟿'), ('máng', '䓼'), ('máng', '䈍'), ('máng', '䵨')]
    mang_3 = [('mǎng', '莽'), ('mǎng', '蟒'), ('mǎng', '莾'), ('mǎng', '硥'), ('mǎng', '茻'), ('mǎng', '壾'), ('mǎng', '漭'),
              ('mǎng', '蠎'), ('mǎng', '㟐'), ('mǎng', '䖟'), ('mǎng', '㙁'), ('mǎng', '㬒'), ('mǎng', '䁳'), ('mǎng', '䒎')]
    mang_4 = [('màng', '䙪')]
    mao_1 = [('māo', '猫'), ('māo', '貓')]
    mao_2 = [('máo', '毛'), ('máo', '矛'), ('máo', '茅'), ('máo', '髦'), ('máo', '锚'), ('máo', '牦'), ('máo', '旄'),
             ('máo', '楙'), ('máo', '芼'), ('máo', '枆'), ('máo', '茆'), ('máo', '罞'), ('máo', '渵'), ('máo', '軞'),
             ('máo', '酕'), ('máo', '堥'), ('máo', '嵍'), ('máo', '緢'), ('máo', '鉾'), ('máo', '氂'), ('máo', '犛'),
             ('máo', '蝥'), ('máo', '髳'), ('máo', '錨'), ('máo', '蟊'), ('máo', '鶜'), ('máo', '㝟'), ('máo', '䖥'),
             ('máo', '㲠'), ('máo', '㹈'), ('máo', '䅦'), ('máo', '䭷')]
    mao_3 = [('mǎo', '卯'), ('mǎo', '冇'), ('mǎo', '夘'), ('mǎo', '乮'), ('mǎo', '峁'), ('mǎo', '戼'), ('mǎo', '泖'),
             ('mǎo', '昴'), ('mǎo', '铆'), ('mǎo', '笷'), ('mǎo', '蓩'), ('mǎo', '鉚'), ('mǎo', '㧇'), ('mǎo', '㚹')]
    mao_4 = [('mào', '冒'), ('mào', '貌'), ('mào', '贸'), ('mào', '帽'), ('mào', '茂'), ('mào', '瑁'), ('mào', '懋'),
             ('mào', '耄'), ('mào', '袤'), ('mào', '冃'), ('mào', '皃'), ('mào', '冐'), ('mào', '柕'), ('mào', '眊'),
             ('mào', '秏'), ('mào', '覒'), ('mào', '媢'), ('mào', '萺'), ('mào', '貿'), ('mào', '鄚'), ('mào', '愗'),
             ('mào', '暓'), ('mào', '毷'), ('mào', '瞀'), ('mào', '鄮'), ('mào', '蝐'), ('mào', '㒵'), ('mào', '㧌'),
             ('mào', '㺺'), ('mào', '㿞'), ('mào', '䀤'), ('mào', '䋃'), ('mào', '㒻'), ('mào', '㡌'), ('mào', '㫯'),
             ('mào', '㴘'), ('mào', '䓮'), ('mào', '㪞'), ('mào', '㮘'), ('mào', '㬒'), ('mào', '䡚'), ('mào', '䫉')]
    me_1 = [('mē', '嚒')]
    me_2 = [('mè', '濹'), ('mè', '嚰')]
    me_3 = [('me', '么'), ('me', '麽'), ('me', '庅'), ('me', '麼'), ('me', '嚜')]
    mei_1 = [('méi', '没'), ('méi', '眉'), ('méi', '梅'), ('méi', '媒'), ('méi', '枚'), ('méi', '玫'), ('méi', '煤'),
             ('méi', '霉'), ('méi', '楣'), ('méi', '湄'), ('méi', '嵋'), ('méi', '糜'), ('méi', '莓'), ('méi', '酶'),
             ('méi', '坆'), ('méi', '沒'), ('méi', '苺'), ('méi', '栂'), ('méi', '脄'), ('méi', '珻'), ('méi', '脢'),
             ('méi', '郿'), ('méi', '堳'), ('méi', '湈'), ('méi', '猸'), ('méi', '睂'), ('méi', '葿'), ('méi', '楳'),
             ('méi', '瑂'), ('méi', '禖'), ('méi', '腜'), ('méi', '塺'), ('méi', '槑'), ('méi', '镅'), ('méi', '鹛'),
             ('méi', '鋂'), ('méi', '穈'), ('méi', '徾'), ('méi', '鎇'), ('méi', '攗'), ('méi', '鶥'), ('méi', '黴'),
             ('méi', '㺳'), ('méi', '㶬'), ('méi', '䒽'), ('méi', '㙁'), ('méi', '䍙'), ('méi', '䊈'), ('méi', '㜫'),
             ('méi', '䤂')]
    mei_2 = [('měi', '美'), ('měi', '每'), ('měi', '浼'), ('měi', '镁'), ('měi', '毎'), ('měi', '凂'), ('měi', '挴'),
             ('měi', '羙'), ('měi', '媄'), ('měi', '嵄'), ('měi', '渼'), ('měi', '媺'), ('měi', '嬍'), ('měi', '燘'),
             ('měi', '躾'), ('měi', '鎂'), ('měi', '黣'), ('měi', '䓺'), ('měi', '䜸'), ('měi', '䆀')]
    mei_3 = [('mèi', '妹'), ('mèi', '媚'), ('mèi', '魅'), ('mèi', '昧'), ('mèi', '寐'), ('mèi', '袂'), ('mèi', '抺'),
             ('mèi', '沬'), ('mèi', '旀'), ('mèi', '祙'), ('mèi', '眛'), ('mèi', '殙'), ('mèi', '痗'), ('mèi', '跊'),
             ('mèi', '鬽'), ('mèi', '煝'), ('mèi', '睸'), ('mèi', '韎'), ('mèi', '篃'), ('mèi', '蝞'), ('mèi', '嚜'),
             ('mèi', '櫗'), ('mèi', '㭑'), ('mèi', '䀛'), ('mèi', '䀜'), ('mèi', '㡌'), ('mèi', '䊊'), ('mèi', '䞼'),
             ('mèi', '䵢'), ('mèi', '䉋'), ('mèi', '䰨'), ('mèi', '䰪')]
    men_1 = [('mēn', '椚')]
    men_2 = [('mén', '们'), ('mén', '门'), ('mén', '瞒'), ('mén', '汶'), ('mén', '扪'), ('mén', '怋'), ('mén', '玧'),
             ('mén', '钔'), ('mén', '門'), ('mén', '們'), ('mén', '閅'), ('mén', '捫'), ('mén', '菛'), ('mén', '璊'),
             ('mén', '瞞'), ('mén', '穈'), ('mén', '鍆'), ('mén', '亹'), ('mén', '斖'), ('mén', '虋'), ('mén', '㡈'),
             ('mén', '㻊'), ('mén', '䝧'), ('mén', '㙢'), ('mén', '㨺'), ('mén', '䊟'), ('mén', '䫒')]
    men_3 = [('mèn', '闷'), ('mèn', '懑'), ('mèn', '悗'), ('mèn', '惛'), ('mèn', '焖'), ('mèn', '悶'), ('mèn', '暪'),
             ('mèn', '燜'), ('mèn', '鞔'), ('mèn', '懣'), ('mèn', '㥃'), ('mèn', '㱪'), ('mèn', '㦖'), ('mèn', '㵍')]
    meng_1 = [('mēng', '蒙'), ('mēng', '掹'), ('mēng', '擝'), ('mēng', '矇')]
    meng_2 = [('méng', '盟'), ('méng', '朦'), ('méng', '萌'), ('méng', '氓'), ('méng', '檬'), ('méng', '虻'), ('méng', '濛'),
              ('méng', '尨'), ('méng', '甿'), ('méng', '庬'), ('méng', '莔'), ('méng', '溕'), ('méng', '雺'), ('méng', '甍'),
              ('méng', '鄳'), ('méng', '儚'), ('méng', '橗'), ('méng', '瞢'), ('méng', '蕄'), ('méng', '蝱'), ('méng', '鄸'),
              ('méng', '鋂'), ('méng', '髳'), ('méng', '幪'), ('méng', '懞'), ('méng', '獴'), ('méng', '曚'), ('méng', '氋'),
              ('méng', '礞'), ('méng', '鯍'), ('méng', '鹲'), ('méng', '艨'), ('méng', '矒'), ('méng', '霿'), ('méng', '靀'),
              ('méng', '饛'), ('méng', '顭'), ('méng', '鸏'), ('méng', '䖟'), ('méng', '䇇'), ('méng', '䓝'), ('méng', '䟥'),
              ('méng', '䀄'), ('méng', '䗈'), ('méng', '㙹'), ('méng', '㠓'), ('méng', '㩚'), ('méng', '㽇'), ('méng', '䑃'),
              ('méng', '䑅'), ('méng', '䉚'), ('méng', '䙦'), ('méng', '䙩'), ('méng', '䝢'), ('méng', '䤓'), ('méng', '䒐'),
              ('méng', '䴿'), ('méng', '䰒'), ('méng', '䴌'), ('méng', '䵆'), ('méng', '䲛')]
    meng_3 = [('měng', '猛'), ('měng', '蟒'), ('měng', '懵'), ('měng', '蜢'), ('měng', '黾'), ('měng', '冡'), ('měng', '勐'),
              ('měng', '黽'), ('měng', '锰'), ('měng', '艋'), ('měng', '錳'), ('měng', '蠓'), ('měng', '鯭'), ('měng', '鼆'),
              ('měng', '㚞'), ('měng', '䏵'), ('měng', '䁅')]
    meng_4 = [('mèng', '梦'), ('mèng', '孟'), ('mèng', '夢'), ('mèng', '夣'), ('mèng', '懜'), ('mèng', '霥'), ('mèng', '癦'),
              ('mèng', '㒱'), ('mèng', '㻊'), ('mèng', '䠢'), ('mèng', '㜴'), ('mèng', '䥂'), ('mèng', '㝱'), ('mèng', '䥰')]
    mi_1 = [('mī', '咪'), ('mī', '眯'), ('mī', '瞇')]
    mi_2 = [('mí', '迷'), ('mí', '弥'), ('mí', '谜'), ('mí', '靡'), ('mí', '糜'), ('mí', '祢'), ('mí', '猕'), ('mí', '縻'),
            ('mí', '麋'), ('mí', '冞'), ('mí', '袮'), ('mí', '蒾'), ('mí', '詸'), ('mí', '摵'), ('mí', '謎'), ('mí', '醚'),
            ('mí', '彌'), ('mí', '擟'), ('mí', '瞴'), ('mí', '藌'), ('mí', '麊'), ('mí', '麿'), ('mí', '檷'), ('mí', '禰'),
            ('mí', '瀰'), ('mí', '獼'), ('mí', '蘪'), ('mí', '麛'), ('mí', '镾'), ('mí', '戂'), ('mí', '攠'), ('mí', '瓕'),
            ('mí', '蘼'), ('mí', '爢'), ('mí', '醾'), ('mí', '醿'), ('mí', '鸍'), ('mí', '釄'), ('mí', '㟜'), ('mí', '䍘'),
            ('mí', '䋛'), ('mí', '䛧'), ('mí', '䪾'), ('mí', '䴢'), ('mí', '㩢'), ('mí', '䌕'), ('mí', '䌘'), ('mí', '䤍'),
            ('mí', '䊫'), ('mí', '㜷'), ('mí', '䕳'), ('mí', '䕷'), ('mí', '㠧'), ('mí', '㣆'), ('mí', '㸏'), ('mí', '䉲'),
            ('mí', '䊳'), ('mí', '䥸')]
    mi_3 = [('mǐ', '米'), ('mǐ', '弭'), ('mǐ', '芈'), ('mǐ', '侎'), ('mǐ', '沵'), ('mǐ', '羋'), ('mǐ', '洣'), ('mǐ', '敉'),
            ('mǐ', '粎'), ('mǐ', '脒'), ('mǐ', '渳'), ('mǐ', '葞'), ('mǐ', '蔝'), ('mǐ', '銤'), ('mǐ', '濔'), ('mǐ', '孊'),
            ('mǐ', '灖'), ('mǐ', '㐘'), ('mǐ', '㳽'), ('mǐ', '㥝'), ('mǐ', '㝥'), ('mǐ', '㰽'), ('mǐ', '䱊'), ('mǐ', '䭧')]
    mi_4 = [('mì', '密'), ('mì', '秘'), ('mì', '蜜'), ('mì', '觅'), ('mì', '泌'), ('mì', '宓'), ('mì', '谧'), ('mì', '幂'),
            ('mì', '汨'), ('mì', '冖'), ('mì', '糸'), ('mì', '沕'), ('mì', '怽'), ('mì', '枈'), ('mì', '峚'), ('mì', '祕'),
            ('mì', '宻'), ('mì', '淧'), ('mì', '覓'), ('mì', '覔'), ('mì', '塓'), ('mì', '幎'), ('mì', '覛'), ('mì', '嘧'),
            ('mì', '榓'), ('mì', '滵'), ('mì', '漞'), ('mì', '熐'), ('mì', '蔤'), ('mì', '鼏'), ('mì', '冪'), ('mì', '樒'),
            ('mì', '幦'), ('mì', '濗'), ('mì', '謐'), ('mì', '櫁'), ('mì', '簚'), ('mì', '羃'), ('mì', '㘠'), ('mì', '㫘'),
            ('mì', '㸓'), ('mì', '䣥'), ('mì', '㳴'), ('mì', '䉾'), ('mì', '㜆'), ('mì', '䖑'), ('mì', '䛉'), ('mì', '䛑'),
            ('mì', '㨠'), ('mì', '㴵'), ('mì', '䁇'), ('mì', '㨺'), ('mì', '㦄'), ('mì', '㵋'), ('mì', '䋳'), ('mì', '䣾'),
            ('mì', '㵥'), ('mì', '䈿'), ('mì', '䤉'), ('mì', '䈼'), ('mì', '䌏'), ('mì', '䌐'), ('mì', '䌩'), ('mì', '䮭'),
            ('mì', '䭩')]
    mian_1 = [('mián', '棉'), ('mián', '绵'), ('mián', '眠'), ('mián', '宀'), ('mián', '芇'), ('mián', '杣'), ('mián', '婂'),
              ('mián', '媔'), ('mián', '綿'), ('mián', '緜'), ('mián', '臱'), ('mián', '蝒'), ('mián', '嬵'), ('mián', '檰'),
              ('mián', '櫋'), ('mián', '矈'), ('mián', '矊'), ('mián', '矏'), ('mián', '㐷'), ('mián', '㬆'), ('mián', '㮌'),
              ('mián', '䃇'), ('mián', '㒙'), ('mián', '䏃'), ('mián', '㝰'), ('mián', '㰃'), ('mián', '䫵'), ('mián', '䰓')]
    mian_2 = [('miǎn', '免'), ('miǎn', '勉'), ('miǎn', '缅'), ('miǎn', '冕'), ('miǎn', '腼'), ('miǎn', '娩'), ('miǎn', '眄'),
              ('miǎn', '渑'), ('miǎn', '湎'), ('miǎn', '丏'), ('miǎn', '汅'), ('miǎn', '沔'), ('miǎn', '黾'), ('miǎn', '莬'),
              ('miǎn', '偭'), ('miǎn', '勔'), ('miǎn', '喕'), ('miǎn', '愐'), ('miǎn', '睌'), ('miǎn', '葂'), ('miǎn', '黽'),
              ('miǎn', '絻'), ('miǎn', '澠'), ('miǎn', '緬'), ('miǎn', '靦'), ('miǎn', '鮸'), ('miǎn', '䀎'), ('miǎn', '㤁'),
              ('miǎn', '㫘'), ('miǎn', '㝃'), ('miǎn', '㛯'), ('miǎn', '㥝'), ('miǎn', '㨺'), ('miǎn', '㻰'), ('miǎn', '䤄')]
    mian_3 = [('miàn', '面'), ('miàn', '靣'), ('miàn', '牑'), ('miàn', '糆'), ('miàn', '麪'), ('miàn', '麫'), ('miàn', '麺'),
              ('miàn', '麵'), ('miàn', '㴐'), ('miàn', '䛉'), ('miàn', '䌏')]
    miao_1 = [('miāo', '喵')]
    miao_2 = [('miáo', '描'), ('miáo', '苗'), ('miáo', '瞄'), ('miáo', '媌'), ('miáo', '鹋'), ('miáo', '嫹'), ('miáo', '緢'),
              ('miáo', '鶓'), ('miáo', '㠺'), ('miáo', '㑤'), ('miáo', '䖢'), ('miáo', '䁧')]
    miao_3 = [('miǎo', '秒'), ('miǎo', '渺'), ('miǎo', '藐'), ('miǎo', '缈'), ('miǎo', '邈'), ('miǎo', '眇'), ('miǎo', '杪'),
              ('miǎo', '厸'), ('miǎo', '仯'), ('miǎo', '劰'), ('miǎo', '淼'), ('miǎo', '篎'), ('miǎo', '緲'), ('miǎo', '䏚'),
              ('miǎo', '㷅'), ('miǎo', '䅺'), ('miǎo', '㦝')]
    miao_4 = [('miào', '妙'), ('miào', '庙'), ('miào', '缪'), ('miào', '玅'), ('miào', '竗'), ('miào', '庿'), ('miào', '廟'),
              ('miào', '繆')]
    mie_1 = [('miē', '乜'), ('miē', '咩'), ('miē', '吀'), ('miē', '哶'), ('miē', '孭')]
    mie_2 = []
    mie_3 = [('miè', '灭'), ('miè', '蔑'), ('miè', '篾'), ('miè', '烕'), ('miè', '眜'), ('miè', '覕'), ('miè', '搣'),
             ('miè', '滅'), ('miè', '薎'), ('miè', '鴓'), ('miè', '幭'), ('miè', '懱'), ('miè', '瀎'), ('miè', '櫗'),
             ('miè', '簚'), ('miè', '礣'), ('miè', '蠛'), ('miè', '衊'), ('miè', '鑖'), ('miè', '鱴'), ('miè', '㒝'),
             ('miè', '㩢'), ('miè', '䈼'), ('miè', '䁾'), ('miè', '䌩'), ('miè', '䘊'), ('miè', '䩏')]
    min_1 = [('mín', '民'), ('mín', '珉'), ('mín', '玟'), ('mín', '岷'), ('mín', '缗'), ('mín', '垊'), ('mín', '姄'),
             ('mín', '怋'), ('mín', '旻'), ('mín', '旼'), ('mín', '苠'), ('mín', '盿'), ('mín', '砇'), ('mín', '罠'),
             ('mín', '崏'), ('mín', '捪'), ('mín', '渂'), ('mín', '琘'), ('mín', '琝'), ('mín', '瑉'), ('mín', '痻'),
             ('mín', '碈'), ('mín', '鈱'), ('mín', '緍'), ('mín', '緡'), ('mín', '賯'), ('mín', '錉'), ('mín', '鴖'),
             ('mín', '鍲'), ('mín', '㢯'), ('mín', '䂥'), ('mín', '䋋'), ('mín', '䝧'), ('mín', '㟩'), ('mín', '㟭'),
             ('mín', '䟨'), ('mín', '䡑'), ('mín', '䁕'), ('mín', '䃉'), ('mín', '䪸'), ('mín', '䶔'), ('mín', '䡻'),
             ('mín', '䲄')]
    min_2 = [('mǐn', '敏'), ('mǐn', '悯'), ('mǐn', '抿'), ('mǐn', '闵'), ('mǐn', '闽'), ('mǐn', '皿'), ('mǐn', '泯'),
             ('mǐn', '愍'), ('mǐn', '冺'), ('mǐn', '刡'), ('mǐn', '忟'), ('mǐn', '呡'), ('mǐn', '忞'), ('mǐn', '黾'),
             ('mǐn', '勄'), ('mǐn', '敃'), ('mǐn', '笢'), ('mǐn', '笽'), ('mǐn', '惽'), ('mǐn', '湏'), ('mǐn', '湣'),
             ('mǐn', '閔'), ('mǐn', '黽'), ('mǐn', '敯'), ('mǐn', '暋'), ('mǐn', '僶'), ('mǐn', '閩'), ('mǐn', '慜'),
             ('mǐn', '憫'), ('mǐn', '潣'), ('mǐn', '簢'), ('mǐn', '鳘'), ('mǐn', '蠠'), ('mǐn', '鰵'), ('mǐn', '㞶'),
             ('mǐn', '䡅'), ('mǐn', '㨉'), ('mǐn', '㬆'), ('mǐn', '㮌'), ('mǐn', '㥸'), ('mǐn', '䞀')]
    ming_1 = [('míng', '明'), ('míng', '名'), ('míng', '鸣'), ('míng', '冥'), ('míng', '铭'), ('míng', '茗'), ('míng', '瞑'),
              ('míng', '溟'), ('míng', '暝'), ('míng', '螟'), ('míng', '洺'), ('míng', '眀'), ('míng', '朙'), ('míng', '眳'),
              ('míng', '鄍'), ('míng', '嫇'), ('míng', '猽'), ('míng', '蓂'), ('míng', '詺'), ('míng', '榠'), ('míng', '銘'),
              ('míng', '鳴'), ('míng', '覭'), ('míng', '㝠'), ('míng', '䊅'), ('míng', '䆨'), ('míng', '䆩'), ('míng', '䄙'),
              ('míng', '䤉'), ('míng', '䫤'), ('míng', '䳟')]
    ming_2 = [('mǐng', '酩'), ('mǐng', '佲'), ('mǐng', '姳'), ('mǐng', '凕'), ('mǐng', '慏'), ('mǐng', '㫥'), ('mǐng', '㟰')]
    ming_3 = [('mìng', '命'), ('mìng', '掵'), ('mìng', '䒌')]
    miu_1 = []
    miu_2 = [('miù', '谬'), ('miù', '缪'), ('miù', '繆'), ('miù', '謬')]
    mo_1 = [('mō', '摸'), ('mō', '嚤')]
    mo_2 = [('mó', '么'), ('mó', '模'), ('mó', '魔'), ('mó', '磨'), ('mó', '摩'), ('mó', '麽'), ('mó', '嬷'), ('mó', '膜'),
            ('mó', '摹'), ('mó', '谟'), ('mó', '馍'), ('mó', '蘑'), ('mó', '嫫'), ('mó', '庅'), ('mó', '尛'), ('mó', '骳'),
            ('mó', '麼'), ('mó', '魹'), ('mó', '橅'), ('mó', '糢'), ('mó', '嬤'), ('mó', '謨'), ('mó', '謩'), ('mó', '擵'),
            ('mó', '饃'), ('mó', '髍'), ('mó', '劘'), ('mó', '戂'), ('mó', '攠'), ('mó', '饝'), ('mó', '㜥'), ('mó', '䌕'),
            ('mó', '䉑'), ('mó', '䯢'), ('mó', '䃺'), ('mó', '䭩')]
    mo_3 = [('mǒ', '抹'), ('mǒ', '懡'), ('mǒ', '䳟'), ('mǒ', '䩋')]
    mo_4 = [('mò', '没'), ('mò', '万'), ('mò', '莫'), ('mò', '默'), ('mò', '冒'), ('mò', '末'), ('mò', '墨'), ('mò', '漠'),
            ('mò', '脉'), ('mò', '嘿'), ('mò', '陌'), ('mò', '寞'), ('mò', '蓦'), ('mò', '沫'), ('mò', '茉'), ('mò', '蟆'),
            ('mò', '殁'), ('mò', '秣'), ('mò', '獏'), ('mò', '貉'), ('mò', '圽'), ('mò', '沒'), ('mò', '妺'), ('mò', '帓'),
            ('mò', '歾'), ('mò', '歿'), ('mò', '帞'), ('mò', '昩'), ('mò', '枺'), ('mò', '狢'), ('mò', '皌'), ('mò', '眜'),
            ('mò', '眿'), ('mò', '砞'), ('mò', '莈'), ('mò', '眽'), ('mò', '絈'), ('mò', '袹'), ('mò', '絔'), ('mò', '蛨'),
            ('mò', '貃'), ('mò', '嗼'), ('mò', '塻'), ('mò', '貈'), ('mò', '貊'), ('mò', '銆'), ('mò', '靺'), ('mò', '嫼'),
            ('mò', '瘼'), ('mò', '瞐'), ('mò', '瞙'), ('mò', '镆'), ('mò', '魩'), ('mò', '黙'), ('mò', '縸'), ('mò', '瀎'),
            ('mò', '貘'), ('mò', '嚜'), ('mò', '藦'), ('mò', '蟔'), ('mò', '鏌'), ('mò', '爅'), ('mò', '驀'), ('mò', '礳'),
            ('mò', '纆'), ('mò', '耱'), ('mò', '䒬'), ('mò', '㶬'), ('mò', '㹮'), ('mò', '䏞'), ('mò', '䘑'), ('mò', '䬴'),
            ('mò', '㱳'), ('mò', '㷬'), ('mò', '㾺'), ('mò', '㱄'), ('mò', '㷵'), ('mò', '䤉'), ('mò', '䱅'), ('mò', '䴲'),
            ('mò', '䜆'), ('mò', '䁼'), ('mò', '䮬'), ('mò', '䳮'), ('mò', '䁿'), ('mò', '䘃')]
    mou_1 = [('mōu', '哞')]
    mou_2 = [('móu', '谋'), ('móu', '眸'), ('móu', '牟'), ('móu', '缪'), ('móu', '侔'), ('móu', '劺'), ('móu', '呣'),
             ('móu', '恈'), ('móu', '敄'), ('móu', '桙'), ('móu', '堥'), ('móu', '蛑'), ('móu', '踎'), ('móu', '謀'),
             ('móu', '繆'), ('móu', '鍪'), ('móu', '鴾'), ('móu', '麰'), ('móu', '鞪'), ('móu', '㭌'), ('móu', '㼋'),
             ('móu', '䏬'), ('móu', '㖼'), ('móu', '䋷'), ('móu', '䗋'), ('móu', '䥐'), ('móu', '䱕')]
    mou_3 = [('mǒu', '某'), ('mǒu', '厶'), ('mǒu', '䍒'), ('mǒu', '䦈')]
    mou_4 = []
    mu_1 = [('mú', '模'), ('mú', '毪'), ('mú', '氁'), ('mú', '䱯'), ('mú', '䮸')]
    mu_2 = [('mǔ', '母'), ('mǔ', '姆'), ('mǔ', '亩'), ('mǔ', '姥'), ('mǔ', '牡'), ('mǔ', '拇'), ('mǔ', '畂'), ('mǔ', '峔'),
            ('mǔ', '牳'), ('mǔ', '畆'), ('mǔ', '畒'), ('mǔ', '胟'), ('mǔ', '娒'), ('mǔ', '畝'), ('mǔ', '畞'), ('mǔ', '砪'),
            ('mǔ', '畮'), ('mǔ', '鉧'), ('mǔ', '踇'), ('mǔ', '㟂'), ('mǔ', '㫛'), ('mǔ', '䥈')]
    mu_3 = [('mù', '目'), ('mù', '木'), ('mù', '莫'), ('mù', '幕'), ('mù', '慕'), ('mù', '牧'), ('mù', '穆'), ('mù', '墓'),
            ('mù', '暮'), ('mù', '沐'), ('mù', '牟'), ('mù', '缪'), ('mù', '睦'), ('mù', '募'), ('mù', '苜'), ('mù', '仫'),
            ('mù', '凩'), ('mù', '朷'), ('mù', '狇'), ('mù', '坶'), ('mù', '炑'), ('mù', '毣'), ('mù', '莯'), ('mù', '蚞'),
            ('mù', '钼'), ('mù', '雮'), ('mù', '幙'), ('mù', '慔'), ('mù', '楘'), ('mù', '鉬'), ('mù', '暯'), ('mù', '樢'),
            ('mù', '艒'), ('mù', '霂'), ('mù', '縸'), ('mù', '繆'), ('mù', '鞪'), ('mù', '㧅'), ('mù', '㣎'), ('mù', '㙁'),
            ('mù', '㾇'), ('mù', '䊾'), ('mù', '䧔'), ('mù', '㡔'), ('mù', '䀲'), ('mù', '㜈'), ('mù', '㒇'), ('mù', '䑵'),
            ('mù', '䁼')]
    na_1 = [('nā', '南')]
    na_2 = [('ná', '拿'), ('ná', '秅'), ('ná', '拏'), ('ná', '挐'), ('ná', '嗱'), ('ná', '蒘'), ('ná', '搻'), ('ná', '誽'),
            ('ná', '镎'), ('ná', '鎿'), ('ná', '㧱'), ('ná', '䏧'), ('ná', '䛔'), ('ná', '䫱')]
    na_3 = [('nǎ', '哪'), ('nǎ', '乸'), ('nǎ', '雫'), ('nǎ', '䞕')]
    na_4 = [('nà', '那'), ('nà', '内'), ('nà', '纳'), ('nà', '娜'), ('nà', '呐'), ('nà', '捺'), ('nà', '衲'), ('nà', '吶'),
            ('nà', '钠'), ('nà', '妠'), ('nà', '抐'), ('nà', '肭'), ('nà', '郍'), ('nà', '納'), ('nà', '袦'), ('nà', '笚'),
            ('nà', '笝'), ('nà', '豽'), ('nà', '軜'), ('nà', '貀'), ('nà', '鈉'), ('nà', '蒳'), ('nà', '靹'), ('nà', '魶'),
            ('nà', '㘝'), ('nà', '䀑'), ('nà', '㙁'), ('nà', '㭯'), ('nà', '䇣'), ('nà', '䖧'), ('nà', '䟜'), ('nà', '䇱'),
            ('nà', '㗙'), ('nà', '㨥'), ('nà', '㴸'), ('nà', '䅞'), ('nà', '䎎'), ('nà', '䖓'), ('nà', '䪏'), ('nà', '䈫'),
            ('nà', '䱹')]
    nai_1 = [('nái', '腉'), ('nái', '搱'), ('nái', '摨'), ('nái', '孻'), ('nái', '㾍'), ('nái', '䯮'), ('nái', '䍲'),
             ('nái', '㜨'), ('nái', '䘅')]
    nai_2 = [('nǎi', '乃'), ('nǎi', '奶'), ('nǎi', '妳'), ('nǎi', '艿'), ('nǎi', '氖'), ('nǎi', '疓'), ('nǎi', '廼'),
             ('nǎi', '迺'), ('nǎi', '倷'), ('nǎi', '釢'), ('nǎi', '嬭'), ('nǎi', '㚷'), ('nǎi', '㜷')]
    nai_3 = [('nài', '能'), ('nài', '耐'), ('nài', '奈'), ('nài', '柰'), ('nài', '鼐'), ('nài', '佴'), ('nài', '耏'),
             ('nài', '萘'), ('nài', '渿'), ('nài', '褦'), ('nài', '螚'), ('nài', '錼'), ('nài', '㮈'), ('nài', '㮏'),
             ('nài', '㲡'), ('nài', '䅞'), ('nài', '䱞')]
    nan_1 = [('nān', '囡'), ('nān', '囝')]
    nan_2 = [('nán', '难'), ('nán', '南'), ('nán', '男'), ('nán', '喃'), ('nán', '楠'), ('nán', '柟'), ('nán', '抩'),
             ('nán', '枏'), ('nán', '侽'), ('nán', '娚'), ('nán', '畘'), ('nán', '莮'), ('nán', '遖'), ('nán', '暔'),
             ('nán', '諵'), ('nán', '難'), ('nán', '㽖'), ('nán', '㓓'), ('nán', '䛁'), ('nán', '䔜'), ('nán', '䶲'),
             ('nán', '䕼')]
    nan_3 = [('nǎn', '赧'), ('nǎn', '揇'), ('nǎn', '湳'), ('nǎn', '萳'), ('nǎn', '煵'), ('nǎn', '腩'), ('nǎn', '嫨'),
             ('nǎn', '蝻'), ('nǎn', '戁'), ('nǎn', '㫱'), ('nǎn', '䈒'), ('nǎn', '䊖'), ('nǎn', '䔳'), ('nǎn', '䁪')]
    nan_4 = [('nàn', '妠'), ('nàn', '婻'), ('nàn', '㬮')]
    nang_1 = [('nāng', '囔')]
    nang_2 = [('náng', '囊'), ('náng', '乪'), ('náng', '涳'), ('náng', '搑'), ('náng', '憹'), ('náng', '嚢'), ('náng', '蠰'),
              ('náng', '饟'), ('náng', '馕'), ('náng', '欜'), ('náng', '饢'), ('náng', '䂇')]
    nang_3 = [('nǎng', '曩'), ('nǎng', '擃'), ('nǎng', '瀼'), ('nǎng', '攮'), ('nǎng', '灢'), ('nǎng', '㶞')]
    nang_4 = [('nàng', '儾'), ('nàng', '齉'), ('nàng', '㒄')]
    nao_1 = [('nāo', '孬')]
    nao_2 = [('náo', '挠'), ('náo', '呶'), ('náo', '桡'), ('náo', '铙'), ('náo', '猱'), ('náo', '怓'), ('náo', '峱'),
             ('náo', '硇'), ('náo', '蛲'), ('náo', '詉'), ('náo', '碙'), ('náo', '摎'), ('náo', '撓'), ('náo', '嶩'),
             ('náo', '憹'), ('náo', '橈'), ('náo', '獶'), ('náo', '蟯'), ('náo', '夒'), ('náo', '譊'), ('náo', '鐃'),
             ('náo', '巎'), ('náo', '獿'), ('náo', '㞪'), ('náo', '䄩'), ('náo', '㺀'), ('náo', '䫸'), ('náo', '䛝'),
             ('náo', '䃩'), ('náo', '䑋'), ('náo', '䴃')]
    nao_3 = [('nǎo', '脑'), ('nǎo', '恼'), ('nǎo', '瑙'), ('nǎo', '垴'), ('nǎo', '悩'), ('nǎo', '匘'), ('nǎo', '脳'),
             ('nǎo', '堖'), ('nǎo', '惱'), ('nǎo', '嫐'), ('nǎo', '腦'), ('nǎo', '碯'), ('nǎo', '㑎'), ('nǎo', '㧘'),
             ('nǎo', '㺁'), ('nǎo', '䙹'), ('nǎo', '㛴'), ('nǎo', '䜧'), ('nǎo', '䜀')]
    nao_4 = [('nào', '闹'), ('nào', '淖'), ('nào', '婥'), ('nào', '閙'), ('nào', '鬧'), ('nào', '臑')]
    ne_1 = [('né', '哪')]
    ne_2 = [('nè', '呐'), ('nè', '讷'), ('nè', '吶'), ('nè', '疒'), ('nè', '抐'), ('nè', '眲'), ('nè', '訥'), ('nè', '㕯'),
            ('nè', '䅞'), ('nè', '䎪'), ('nè', '䭆'), ('nè', '䭚')]
    ne_3 = [('ne', '呢')]
    nei_1 = []
    nei_2 = [('něi', '哪'), ('něi', '馁'), ('něi', '娞'), ('něi', '浽'), ('něi', '脮'), ('něi', '腇'), ('něi', '餒'),
             ('něi', '鮾'), ('něi', '鯘'), ('něi', '㼏'), ('něi', '䲎')]
    nei_3 = [('nèi', '那'), ('nèi', '内'), ('nèi', '內'), ('nèi', '氝'), ('nèi', '氞'), ('nèi', '錗'), ('nèi', '㐻'),
             ('nèi', '㘨'), ('nèi', '㖏'), ('nèi', '㨅'), ('nèi', '䇣'), ('nèi', '䜆'), ('nèi', '䳖'), ('nèi', '䡾')]
    nen_1 = [('nèn', '嫩'), ('nèn', '恁'), ('nèn', '媆'), ('nèn', '嫰'), ('nèn', '㶧'), ('nèn', '㒄'), ('nèn', '㜛'),
             ('nèn', '㯎')]
    neng_1 = [('néng', '能'), ('néng', '䏻'), ('néng', '㴰')]
    neng_2 = [('něng', '螚'), ('něng', '䘅')]
    neng_3 = [('nèng', '㲌')]
    ni_1 = [('nī', '妮')]
    ni_2 = [('ní', '呢'), ('ní', '尼'), ('ní', '泥'), ('ní', '倪'), ('ní', '霓'), ('ní', '怩'), ('ní', '猊'), ('ní', '坭'),
            ('ní', '籾'), ('ní', '屔'), ('ní', '秜'), ('ní', '郳'), ('ní', '铌'), ('ní', '埿'), ('ní', '婗'), ('ní', '淣'),
            ('ní', '蚭'), ('ní', '棿'), ('ní', '蛪'), ('ní', '跜'), ('ní', '鈮'), ('ní', '聣'), ('ní', '蜺'), ('ní', '馜'),
            ('ní', '觬'), ('ní', '貎'), ('ní', '輗'), ('ní', '鲵'), ('ní', '鯢'), ('ní', '麑'), ('ní', '齯'), ('ní', '臡'),
            ('ní', '㞾'), ('ní', '㹸'), ('ní', '䘦'), ('ní', '㪒'), ('ní', '䛏'), ('ní', '䝚'), ('ní', '㮞'), ('ní', '䘽'),
            ('ní', '䍲'), ('ní', '䮘')]
    ni_3 = [('nǐ', '你'), ('nǐ', '疑'), ('nǐ', '拟'), ('nǐ', '妳'), ('nǐ', '旎'), ('nǐ', '伱'), ('nǐ', '伲'), ('nǐ', '抳'),
            ('nǐ', '狔'), ('nǐ', '苨'), ('nǐ', '柅'), ('nǐ', '掜'), ('nǐ', '晲'), ('nǐ', '孴'), ('nǐ', '儗'), ('nǐ', '儞'),
            ('nǐ', '隬'), ('nǐ', '懝'), ('nǐ', '擬'), ('nǐ', '濔'), ('nǐ', '薿'), ('nǐ', '檷'), ('nǐ', '聻'), ('nǐ', '㣇'),
            ('nǐ', '䧇'), ('nǐ', '㵫'), ('nǐ', '䭲'), ('nǐ', '䕥'), ('nǐ', '䦵'), ('nǐ', '䰯')]
    ni_4 = [('nì', '逆'), ('nì', '腻'), ('nì', '溺'), ('nì', '匿'), ('nì', '睨'), ('nì', '昵'), ('nì', '屰'), ('nì', '氼'),
            ('nì', '抐'), ('nì', '胒'), ('nì', '眤'), ('nì', '堄'), ('nì', '惄'), ('nì', '嫟'), ('nì', '愵'), ('nì', '暱'),
            ('nì', '縌'), ('nì', '誽'), ('nì', '膩'), ('nì', '嬺'), ('nì', '㲻'), ('nì', '䀑'), ('nì', '㧱'), ('nì', '㥾'),
            ('nì', '㲡'), ('nì', '㦐'), ('nì', '䁥'), ('nì', '䵑'), ('nì', '䵒'), ('nì', '㠜'), ('nì', '䘌')]
    nian_1 = [('niān', '拈'), ('niān', '蔫')]
    nian_2 = [('nián', '年'), ('nián', '粘'), ('nián', '黏'), ('nián', '秊'), ('nián', '哖'), ('nián', '姩'), ('nián', '秥'),
              ('nián', '溓'), ('nián', '鲇'), ('nián', '鮎'), ('nián', '鲶'), ('nián', '鵇'), ('nián', '鯰'), ('nián', '䄭'),
              ('nián', '䄹'), ('nián', '䬯'), ('nián', '䩞'), ('nián', '䴴')]
    nian_3 = [('niǎn', '捻'), ('niǎn', '辗'), ('niǎn', '辇'), ('niǎn', '撵'), ('niǎn', '碾'), ('niǎn', '涊'), ('niǎn', '淰'),
              ('niǎn', '焾'), ('niǎn', '榐'), ('niǎn', '撚'), ('niǎn', '輦'), ('niǎn', '簐'), ('niǎn', '蹍'), ('niǎn', '攆'),
              ('niǎn', '蹨'), ('niǎn', '躎'), ('niǎn', '㘝'), ('niǎn', '㞋'), ('niǎn', '䟢'), ('niǎn', '㮟'), ('niǎn', '㜤'),
              ('niǎn', '䚓')]
    nian_4 = [('niàn', '念'), ('niàn', '廿'), ('niàn', '卄'), ('niàn', '唸'), ('niàn', '埝'), ('niàn', '悥'), ('niàn', '惗'),
              ('niàn', '艌'), ('niàn', '㲽'), ('niàn', '䧔'), ('niàn', '㜣')]
    niang_1 = [('niáng', '娘'), ('niáng', '嬢'), ('niáng', '孃')]
    niang_2 = []
    niang_3 = [('niàng', '酿'), ('niàng', '醸'), ('niàng', '釀'), ('niàng', '䖆')]
    niao_1 = [('niǎo', '鸟'), ('niǎo', '袅'), ('niǎo', '茑'), ('niǎo', '鳥'), ('niǎo', '嫋'), ('niǎo', '裊'), ('niǎo', '蔦'),
              ('niǎo', '樢'), ('niǎo', '嬝'), ('niǎo', '褭'), ('niǎo', '嬲'), ('niǎo', '㭤'), ('niǎo', '䐁'), ('niǎo', '㼭'),
              ('niǎo', '䦊'), ('niǎo', '䮍'), ('niǎo', '䙚'), ('niǎo', '㒟'), ('niǎo', '㜵'), ('niǎo', '㠡'), ('niǎo', '䃵')]
    niao_2 = [('niào', '溺'), ('niào', '尿'), ('niào', '脲'), ('niào', '㳮'), ('niào', '㞙')]
    nie_1 = [('niē', '捏'), ('niē', '捻'), ('niē', '揑')]
    nie_2 = [('nié', '苶'), ('nié', '㡪')]
    nie_3 = []
    nie_4 = [('niè', '摄'), ('niè', '聂'), ('niè', '孽'), ('niè', '涅'), ('niè', '蹑'), ('niè', '嗫'), ('niè', '臬'),
             ('niè', '啮'), ('niè', '乜'), ('niè', '镍'), ('niè', '帇'), ('niè', '圼'), ('niè', '峊'), ('niè', '枿'),
             ('niè', '陧'), ('niè', '痆'), ('niè', '掜'), ('niè', '菍'), ('niè', '隉'), ('niè', '敜'), ('niè', '湼'),
             ('niè', '嵲'), ('niè', '踂'), ('niè', '噛'), ('niè', '摰'), ('niè', '槷'), ('niè', '踗'), ('niè', '踙'),
             ('niè', '銸'), ('niè', '镊'), ('niè', '嶭'), ('niè', '篞'), ('niè', '臲'), ('niè', '鋷'), ('niè', '錜'),
             ('niè', '颞'), ('niè', '嚙'), ('niè', '聶'), ('niè', '鎳'), ('niè', '闑'), ('niè', '孼'), ('niè', '櫱'),
             ('niè', '籋'), ('niè', '蘖'), ('niè', '囁'), ('niè', '攝'), ('niè', '齧'), ('niè', '巕'), ('niè', '糱'),
             ('niè', '糵'), ('niè', '蠥'), ('niè', '鑈'), ('niè', '囐'), ('niè', '囓'), ('niè', '讘'), ('niè', '躡'),
             ('niè', '鑷'), ('niè', '顳'), ('niè', '钀'), ('niè', '㘝'), ('niè', '㚔'), ('niè', '㖕'), ('niè', '㖖'),
             ('niè', '㘿'), ('niè', '㟧'), ('niè', '㮆'), ('niè', '䄒'), ('niè', '㙞'), ('niè', '㴪'), ('niè', '䂼'),
             ('niè', '䯅'), ('niè', '㜦'), ('niè', '䯵'), ('niè', '㜸'), ('niè', '䌜'), ('niè', '䜓'), ('niè', '䞕'),
             ('niè', '㸎'), ('niè', '㩶'), ('niè', '䡾'), ('niè', '䯀')]
    nin_1 = [('nín', '您'), ('nín', '恁'), ('nín', '囜'), ('nín', '脌'), ('nín', '㤛'), ('nín', '䚾'), ('nín', '䛘'),
             ('nín', '䋻')]
    nin_2 = [('nǐn', '拰')]
    ning_1 = [('níng', '宁'), ('níng', '凝'), ('níng', '拧'), ('níng', '狞'), ('níng', '咛'), ('níng', '柠'), ('níng', '甯'),
              ('níng', '苧'), ('níng', '聍'), ('níng', '寍'), ('níng', '寕'), ('níng', '寗'), ('níng', '寜'), ('níng', '寧'),
              ('níng', '儜'), ('níng', '橣'), ('níng', '嚀'), ('níng', '嬣'), ('níng', '擰'), ('níng', '獰'), ('níng', '薴'),
              ('níng', '檸'), ('níng', '聹'), ('níng', '鑏'), ('níng', '鬡'), ('níng', '鸋'), ('níng', '㝕'), ('níng', '㲰'),
              ('níng', '䗿'), ('níng', '䭢')]
    ning_2 = [('nǐng', '矃'), ('nǐng', '㩶')]
    ning_3 = [('nìng', '佞'), ('nìng', '泞'), ('nìng', '侫'), ('nìng', '倿'), ('nìng', '澝'), ('nìng', '濘'), ('nìng', '䔭'),
              ('nìng', '㿦'), ('nìng', '㣷')]
    niu_1 = [('niū', '妞'), ('niū', '孧')]
    niu_2 = [('niú', '牛'), ('niú', '牜'), ('niú', '汼'), ('niú', '怓'), ('niú', '㽱'), ('niú', '䒜'), ('niú', '䀔'),
             ('niú', '䤔')]
    niu_3 = [('niǔ', '扭'), ('niǔ', '纽'), ('niǔ', '钮'), ('niǔ', '忸'), ('niǔ', '沑'), ('niǔ', '狃'), ('niǔ', '杻'),
             ('niǔ', '炄'), ('niǔ', '紐'), ('niǔ', '莥'), ('niǔ', '鈕'), ('niǔ', '靵'), ('niǔ', '㺲'), ('niǔ', '䏔'),
             ('niǔ', '䂇')]
    niu_4 = [('niù', '拗'), ('niù', '抝'), ('niù', '䋴'), ('niù', '䮗')]
    nong_1 = [('nóng', '农'), ('nóng', '浓'), ('nóng', '哝'), ('nóng', '侬'), ('nóng', '脓'), ('nóng', '秾'), ('nóng', '農'),
              ('nóng', '儂'), ('nóng', '辳'), ('nóng', '噥'), ('nóng', '濃'), ('nóng', '蕽'), ('nóng', '檂'), ('nóng', '燶'),
              ('nóng', '禯'), ('nóng', '膿'), ('nóng', '穠'), ('nóng', '襛'), ('nóng', '譨'), ('nóng', '醲'), ('nóng', '欁'),
              ('nóng', '鬞'), ('nóng', '㶶'), ('nóng', '㺜'), ('nóng', '䁸'), ('nóng', '䢉')]
    nong_2 = [('nǒng', '繷'), ('nǒng', '䂇'), ('nǒng', '䵜')]
    nong_3 = [('nòng', '弄'), ('nòng', '挊'), ('nòng', '挵'), ('nòng', '癑'), ('nòng', '齈')]
    nou_1 = [('nóu', '羺'), ('nóu', '㝹'), ('nóu', '䨲')]
    nou_2 = [('nǒu', '㳶'), ('nǒu', '䔈'), ('nǒu', '㕢')]
    nou_3 = [('nòu', '搙'), ('nòu', '槈'), ('nòu', '耨'), ('nòu', '獳'), ('nòu', '檽'), ('nòu', '鎒'), ('nòu', '鐞'),
             ('nòu', '䘫'), ('nòu', '䅶'), ('nòu', '䫖'), ('nòu', '䰭')]
    nu_1 = [('nú', '奴'), ('nú', '孥'), ('nú', '帑'), ('nú', '驽'), ('nú', '伮'), ('nú', '笯'), ('nú', '駑'), ('nú', '㚢'),
            ('nú', '㐐')]
    nu_2 = [('nǔ', '努'), ('nǔ', '弩'), ('nǔ', '砮'), ('nǔ', '胬'), ('nǔ', '䢪')]
    nu_3 = [('nù', '怒'), ('nù', '傉'), ('nù', '搙'), ('nù', '䢞')]
    nuan_1 = [('nuán', '奻')]
    nuan_2 = [('nuǎn', '暖'), ('nuǎn', '渜'), ('nuǎn', '湪'), ('nuǎn', '煖'), ('nuǎn', '煗'), ('nuǎn', '餪'), ('nuǎn', '䎡'),
              ('nuǎn', '㬉'), ('nuǎn', '䙇')]
    nuan_3 = []
    nun_1 = [('nún', '黁')]
    nuo_1 = [('nuó', '难'), ('nuó', '娜'), ('nuó', '挪'), ('nuó', '傩'), ('nuó', '梛'), ('nuó', '橠'), ('nuó', '難'),
             ('nuó', '儺'), ('nuó', '㑚'), ('nuó', '䎠'), ('nuó', '㔮'), ('nuó', '㰙')]
    nuo_2 = [('nuǒ', '袳'), ('nuǒ', '袲'), ('nuǒ', '㛂'), ('nuǒ', '㡅')]
    nuo_3 = [('nuò', '诺'), ('nuò', '懦'), ('nuò', '喏'), ('nuò', '搦'), ('nuò', '糯'), ('nuò', '耎'), ('nuò', '掿'),
             ('nuò', '毭'), ('nuò', '逽'), ('nuò', '愞'), ('nuò', '搙'), ('nuò', '锘'), ('nuò', '搻'), ('nuò', '榒'),
             ('nuò', '稬'), ('nuò', '諾'), ('nuò', '蹃'), ('nuò', '糑'), ('nuò', '鍩'), ('nuò', '懧'), ('nuò', '糥'),
             ('nuò', '穤'), ('nuò', '䎟'), ('nuò', '㐡'), ('nuò', '㖠'), ('nuò', '䚥'), ('nuò', '䇔')]
    nv_1 = []
    nv_2 = [('nǚ', '女'), ('nǚ', '钕'), ('nǚ', '籹'), ('nǚ', '釹')]
    nv_3 = [('nǜ', '沑'), ('nǜ', '衂'), ('nǜ', '恧'), ('nǜ', '朒'), ('nǜ', '衄'), ('nǜ', '聏')]
    nve_1 = [('nüe', '虐'), ('nüe', '疟'), ('nüe', '婩'), ('nüe', '硸'), ('nüe', '瘧'), ('nüe', '䖈'), ('nüe', '䖋')]
    o_1 = [('ō', '噢'), ('ō', '喔')]
    o_2 = [('ó', '哦')]
    o_3 = [('ǒ', '嚄')]
    o_4 = [('o', '筽')]
    ou_1 = [('ōu', '区'), ('ōu', '欧'), ('ōu', '殴'), ('ōu', '鸥'), ('ōu', '讴'), ('ōu', '瓯'), ('ōu', '吽'), ('ōu', '區'),
            ('ōu', '塸'), ('ōu', '歐'), ('ōu', '毆'), ('ōu', '熰'), ('ōu', '甌'), ('ōu', '膒'), ('ōu', '鴎'), ('ōu', '櫙'),
            ('ōu', '藲'), ('ōu', '謳'), ('ōu', '鏂'), ('ōu', '鷗'), ('ōu', '䳼')]
    ou_2 = []
    ou_3 = [('ǒu', '偶'), ('ǒu', '呕'), ('ǒu', '耦'), ('ǒu', '藕'), ('ǒu', '禺'), ('ǒu', '吘'), ('ǒu', '腢'), ('ǒu', '嘔'),
            ('ǒu', '蕅'), ('ǒu', '㸸'), ('ǒu', '㼴'), ('ǒu', '㒖'), ('ǒu', '䚆'), ('ǒu', '䯚')]
    ou_4 = [('òu', '怄'), ('òu', '沤'), ('òu', '慪'), ('òu', '漚'), ('òu', '㛏'), ('òu', '䌂'), ('òu', '䌔')]
    pa_1 = [('pā', '啪'), ('pā', '趴'), ('pā', '葩'), ('pā', '妑'), ('pā', '苩'), ('pā', '皅'), ('pā', '舥'), ('pā', '䔤')]
    pa_2 = [('pá', '爬'), ('pá', '扒'), ('pá', '琶'), ('pá', '钯'), ('pá', '耙'), ('pá', '杷'), ('pá', '掱'), ('pá', '筢'),
            ('pá', '潖'), ('pá', '㞎'), ('pá', '䯲'), ('pá', '䶕')]
    pa_3 = []
    pa_4 = [('pà', '怕'), ('pà', '帕'), ('pà', '汃'), ('pà', '帊'), ('pà', '袙')]
    pai_1 = [('pāi', '拍')]
    pai_2 = [('pái', '排'), ('pái', '牌'), ('pái', '徘'), ('pái', '俳'), ('pái', '猅'), ('pái', '棑'), ('pái', '箄'),
             ('pái', '輫'), ('pái', '簰'), ('pái', '簲'), ('pái', '犤'), ('pái', '㵺'), ('pái', '䱝'), ('pái', '䃻')]
    pai_3 = [('pǎi', '迫'), ('pǎi', '廹')]
    pai_4 = [('pài', '派'), ('pài', '湃'), ('pài', '沠'), ('pài', '哌'), ('pài', '渒'), ('pài', '蒎'), ('pài', '鎃'),
             ('pài', '㭛'), ('pài', '䖰'), ('pài', '䮘')]
    pan_1 = [('pān', '番'), ('pān', '潘'), ('pān', '攀'), ('pān', '眅'), ('pān', '畨'), ('pān', '萠'), ('pān', '籓')]
    pan_2 = [('pán', '盘'), ('pán', '胖'), ('pán', '蟠'), ('pán', '磐'), ('pán', '蹒'), ('pán', '爿'), ('pán', '槃'),
             ('pán', '磻'), ('pán', '丬'), ('pán', '肨'), ('pán', '柈'), ('pán', '洀'), ('pán', '眫'), ('pán', '湴'),
             ('pán', '跘'), ('pán', '媻'), ('pán', '幋'), ('pán', '蒰'), ('pán', '搫'), ('pán', '盤'), ('pán', '縏'),
             ('pán', '膰'), ('pán', '瀊'), ('pán', '蹣'), ('pán', '鎜'), ('pán', '鞶'), ('pán', '䋣'), ('pán', '䙃'),
             ('pán', '䃑'), ('pán', '㵗'), ('pán', '䈲'), ('pán', '㩯'), ('pán', '䃲'), ('pán', '䰉'), ('pán', '䰔')]
    pan_3 = [('pǎn', '坢'), ('pǎn', '盻')]
    pan_4 = [('pàn', '判'), ('pàn', '盼'), ('pàn', '叛'), ('pàn', '拚'), ('pàn', '畔'), ('pàn', '拌'), ('pàn', '泮'),
             ('pàn', '冸'), ('pàn', '沜'), ('pàn', '炍'), ('pàn', '牉'), ('pàn', '聁'), ('pàn', '袢'), ('pàn', '詊'),
             ('pàn', '溿'), ('pàn', '頖'), ('pàn', '鋬'), ('pàn', '闆'), ('pàn', '鵥'), ('pàn', '襻'), ('pàn', '鑻'),
             ('pàn', '㳪'), ('pàn', '䙪')]
    pang_1 = [('pāng', '乓'), ('pāng', '滂'), ('pāng', '汸'), ('pāng', '沗'), ('pāng', '胮'), ('pāng', '雱'), ('pāng', '膖'),
              ('pāng', '霶')]
    pang_2 = [('páng', '旁'), ('páng', '庞'), ('páng', '膀'), ('páng', '彷'), ('páng', '磅'), ('páng', '螃'), ('páng', '厐'),
              ('páng', '夆'), ('páng', '尨'), ('páng', '逄'), ('páng', '庬'), ('páng', '趽'), ('páng', '舽'), ('páng', '嫎'),
              ('páng', '徬'), ('páng', '篣'), ('páng', '鳑'), ('páng', '龎'), ('páng', '龐'), ('páng', '鰟'), ('páng', '㑂'),
              ('páng', '㝑'), ('páng', '㫄'), ('páng', '䂇'), ('páng', '㤶'), ('páng', '㥬'), ('páng', '䅭'), ('páng', '䠙'),
              ('páng', '䨦'), ('páng', '䮾')]
    pang_3 = [('pǎng', '嗙'), ('pǎng', '耪'), ('pǎng', '覫'), ('pǎng', '䒍')]
    pang_4 = [('pàng', '胖'), ('pàng', '炐'), ('pàng', '肨'), ('pàng', '眫'), ('pàng', '㜊')]
    pao_1 = [('pāo', '抛'), ('pāo', '拋'), ('pāo', '脬'), ('pāo', '萢'), ('pāo', '藨'), ('pāo', '穮'), ('pāo', '㯱')]
    pao_2 = [('páo', '袍'), ('páo', '炮'), ('páo', '咆'), ('páo', '刨'), ('páo', '庖'), ('páo', '垉'), ('páo', '狍'),
             ('páo', '炰'), ('páo', '爮'), ('páo', '瓟'), ('páo', '铇'), ('páo', '匏'), ('páo', '烰'), ('páo', '袌'),
             ('páo', '跁'), ('páo', '軳'), ('páo', '鉋'), ('páo', '鞄'), ('páo', '褜'), ('páo', '麃'), ('páo', '麅'),
             ('páo', '㚿'), ('páo', '䛌'), ('páo', '䩝'), ('páo', '䠙')]
    pao_3 = [('pǎo', '跑')]
    pao_4 = [('pào', '泡'), ('pào', '奅'), ('pào', '疱'), ('pào', '皰'), ('pào', '砲'), ('pào', '靤'), ('pào', '麭'),
             ('pào', '嚗'), ('pào', '礟'), ('pào', '礮'), ('pào', '㯡'), ('pào', '㘐'), ('pào', '䶌')]
    pei_1 = [('pēi', '呸'), ('pēi', '胚'), ('pēi', '妚'), ('pēi', '怌'), ('pēi', '抷'), ('pēi', '肧'), ('pēi', '柸'),
             ('pēi', '衃'), ('pēi', '醅'), ('pēi', '䯱')]
    pei_2 = [('péi', '陪'), ('péi', '培'), ('péi', '裴'), ('péi', '赔'), ('péi', '阫'), ('péi', '婄'), ('péi', '毰'),
             ('péi', '锫'), ('péi', '裵'), ('péi', '賠'), ('péi', '錇'), ('péi', '䂜'), ('péi', '㟝'), ('péi', '㨐'),
             ('péi', '䣙'), ('péi', '䪹'), ('péi', '䫊'), ('péi', '䲹'), ('péi', '䫠')]
    pei_3 = [('pěi', '俖'), ('pěi', '琣')]
    pei_4 = [('pèi', '配'), ('pèi', '佩'), ('pèi', '妃'), ('pèi', '沛'), ('pèi', '珮'), ('pèi', '辔'), ('pèi', '霈'),
             ('pèi', '帔'), ('pèi', '旆'), ('pèi', '伂'), ('pèi', '犻'), ('pèi', '姵'), ('pèi', '斾'), ('pèi', '昢'),
             ('pèi', '柭'), ('pèi', '浿'), ('pèi', '淠'), ('pèi', '棑'), ('pèi', '媐'), ('pèi', '蓜'), ('pèi', '馷'),
             ('pèi', '嶏'), ('pèi', '攈'), ('pèi', '轡'), ('pèi', '㤄'), ('pèi', '㳈'), ('pèi', '㸬'), ('pèi', '㧩'),
             ('pèi', '㫲'), ('pèi', '䡊'), ('pèi', '䊃'), ('pèi', '㾦'), ('pèi', '䟺'), ('pèi', '䕗'), ('pèi', '㣆')]
    pen_1 = [('pēn', '喷'), ('pēn', '噴'), ('pēn', '濆'), ('pēn', '歕')]
    pen_2 = [('pén', '盆'), ('pén', '瓫'), ('pén', '湓'), ('pén', '葐'), ('pén', '㾦')]
    pen_3 = [('pěn', '呠'), ('pěn', '翸')]
    pen_4 = [('pèn', '喯')]
    peng_1 = [('pēng', '苹'), ('pēng', '亨'), ('pēng', '砰'), ('pēng', '怦'), ('pēng', '烹'), ('pēng', '抨'), ('pēng', '嘭'),
              ('pēng', '匉'), ('pēng', '泙'), ('pēng', '恲'), ('pēng', '胓'), ('pēng', '梈'), ('pēng', '硑'), ('pēng', '絣'),
              ('pēng', '軯'), ('pēng', '剻'), ('pēng', '閛'), ('pēng', '漰'), ('pēng', '駍'), ('pēng', '磞')]
    peng_2 = [('péng', '朋'), ('péng', '鹏'), ('péng', '彭'), ('péng', '蓬'), ('péng', '棚'), ('péng', '篷'), ('péng', '膨'),
              ('péng', '澎'), ('péng', '芃'), ('péng', '挷'), ('péng', '竼'), ('péng', '倗'), ('péng', '捀'), ('péng', '莑'),
              ('péng', '堋'), ('péng', '弸'), ('péng', '淜'), ('péng', '袶'), ('péng', '椖'), ('péng', '傰'), ('péng', '塜'),
              ('péng', '塳'), ('péng', '搒'), ('péng', '漨'), ('péng', '痭'), ('péng', '硼'), ('péng', '稝'), ('péng', '樥'),
              ('péng', '熢'), ('péng', '憉'), ('péng', '輣'), ('péng', '篣'), ('péng', '錋'), ('péng', '韸'), ('péng', '髼'),
              ('péng', '蟚'), ('péng', '蟛'), ('péng', '鬅'), ('péng', '纄'), ('péng', '蘕'), ('péng', '韼'), ('péng', '鵬'),
              ('péng', '騯'), ('péng', '鬔'), ('péng', '鑝'), ('péng', '㔙'), ('péng', '㛔'), ('péng', '㥊'), ('péng', '㮄'),
              ('péng', '䄘'), ('péng', '㱶'), ('péng', '䡫'), ('péng', '䰃'), ('péng', '䴶')]
    peng_3 = [('pěng', '捧'), ('pěng', '淎'), ('pěng', '皏'), ('pěng', '摓'), ('pěng', '㑟'), ('pěng', '䋽'), ('pěng', '㘐'),
              ('pěng', '䵄')]
    peng_4 = [('pèng', '碰'), ('pèng', '掽'), ('pèng', '椪'), ('pèng', '槰'), ('pèng', '踫'), ('pèng', '㼞'), ('pèng', '㮟')]
    pi_1 = [('pī', '被'), ('pī', '批'), ('pī', '披'), ('pī', '劈'), ('pī', '霹'), ('pī', '丕'), ('pī', '坯'), ('pī', '噼'),
            ('pī', '纰'), ('pī', '邳'), ('pī', '砒'), ('pī', '伓'), ('pī', '伾'), ('pī', '妚'), ('pī', '岯'), ('pī', '怶'),
            ('pī', '抷'), ('pī', '枈'), ('pī', '炋'), ('pī', '狉'), ('pī', '狓'), ('pī', '悂'), ('pī', '秛'), ('pī', '秠'),
            ('pī', '紕'), ('pī', '陴'), ('pī', '旇'), ('pī', '翍'), ('pī', '耚'), ('pī', '豾'), ('pī', '釽'), ('pī', '鈚'),
            ('pī', '鉟'), ('pī', '銔'), ('pī', '磇'), ('pī', '駓'), ('pī', '髬'), ('pī', '錃'), ('pī', '錍'), ('pī', '魾'),
            ('pī', '憵'), ('pī', '礔'), ('pī', '礕'), ('pī', '鎞'), ('pī', '㔻'), ('pī', '䯱'), ('pī', '䫠')]
    pi_2 = [('pí', '罢'), ('pí', '皮'), ('pí', '疲'), ('pí', '脾'), ('pí', '啤'), ('pí', '琵'), ('pí', '毗'), ('pí', '陂'),
            ('pí', '裨'), ('pí', '枇'), ('pí', '罴'), ('pí', '貔'), ('pí', '阰'), ('pí', '芘'), ('pí', '肶'), ('pí', '毘'),
            ('pí', '笓'), ('pí', '蚍'), ('pí', '郫'), ('pí', '铍'), ('pí', '埤'), ('pí', '崥'), ('pí', '猈'), ('pí', '蚽'),
            ('pí', '蚾'), ('pí', '豼'), ('pí', '焷'), ('pí', '禆'), ('pí', '腗'), ('pí', '鈹'), ('pí', '鲏'), ('pí', '膍'),
            ('pí', '蜱'), ('pí', '罷'), ('pí', '隦'), ('pí', '魮'), ('pí', '壀'), ('pí', '螕'), ('pí', '鮍'), ('pí', '篺'),
            ('pí', '螷'), ('pí', '鞞'), ('pí', '鵧'), ('pí', '羆'), ('pí', '朇'), ('pí', '鼙'), ('pí', '蠯'), ('pí', '㓟'),
            ('pí', '㱟'), ('pí', '㼰'), ('pí', '㡙'), ('pí', '㮰'), ('pí', '㯅'), ('pí', '㔥'), ('pí', '䴽')]
    pi_3 = [('pǐ', '否'), ('pǐ', '匹'), ('pǐ', '癖'), ('pǐ', '痞'), ('pǐ', '疋'), ('pǐ', '庀'), ('pǐ', '仳'), ('pǐ', '圮'),
            ('pǐ', '吡'), ('pǐ', '苉'), ('pǐ', '脴'), ('pǐ', '銢'), ('pǐ', '嶏'), ('pǐ', '諀'), ('pǐ', '鴄'), ('pǐ', '擗'),
            ('pǐ', '噽'), ('pǐ', '嚭'), ('pǐ', '䏘'), ('pǐ', '䚰'), ('pǐ', '䚹'), ('pǐ', '㨽'), ('pǐ', '䫌'), ('pǐ', '䰦'),
            ('pǐ', '䤏')]
    pi_4 = [('pì', '副'), ('pì', '屁'), ('pì', '辟'), ('pì', '僻'), ('pì', '譬'), ('pì', '媲'), ('pì', '睥'), ('pì', '淠'),
            ('pì', '揊'), ('pì', '嫓'), ('pì', '潎'), ('pì', '稫'), ('pì', '澼'), ('pì', '嚊'), ('pì', '濞'), ('pì', '甓'),
            ('pì', '疈'), ('pì', '闢'), ('pì', '鷿'), ('pì', '鸊'), ('pì', '㳪'), ('pì', '䖩'), ('pì', '㔃'), ('pì', '䗄'),
            ('pì', '䤨'), ('pì', '䪐'), ('pì', '䡟'), ('pì', '㵨'), ('pì', '䑀'), ('pì', '䠘'), ('pì', '䑄'), ('pì', '䴙'),
            ('pì', '䡶'), ('pì', '㿙')]
    pi_5 = [('pi', '榌')]
    pian_1 = [('piān', '篇'), ('piān', '偏'), ('piān', '翩'), ('piān', '扁'), ('piān', '囨'), ('piān', '媥'), ('piān', '楄'),
              ('piān', '犏'), ('piān', '鍂'), ('piān', '鶣'), ('piān', '㾫')]
    pian_2 = [('pián', '便'), ('pián', '骈'), ('pián', '胼'), ('pián', '缏'), ('pián', '腁'), ('pián', '楩'), ('pián', '賆'),
              ('pián', '跰'), ('pián', '瑸'), ('pián', '緶'), ('pián', '骿'), ('pián', '蹁'), ('pián', '駢'), ('pián', '璸'),
              ('pián', '騈'), ('pián', '㛹'), ('pián', '㼐'), ('pián', '䮁')]
    pian_3 = [('piǎn', '覑'), ('piǎn', '谝'), ('piǎn', '貵'), ('piǎn', '諞')]
    pian_4 = [('piàn', '片'), ('piàn', '骗'), ('piàn', '猵'), ('piàn', '魸'), ('piàn', '獱'), ('piàn', '騗'), ('piàn', '騙'),
              ('piàn', '䏒'), ('piàn', '㓲'), ('piàn', '㸤')]
    piao_1 = [('piāo', '飘'), ('piāo', '漂'), ('piāo', '剽'), ('piāo', '勡'), ('piāo', '嘌'), ('piāo', '彯'), ('piāo', '慓'),
              ('piāo', '旚'), ('piāo', '翲'), ('piāo', '螵'), ('piāo', '犥'), ('piāo', '飃'), ('piāo', '飄'), ('piāo', '魒')]
    piao_2 = [('piáo', '朴'), ('piáo', '瓢'), ('piáo', '嫖'), ('piáo', '薸'), ('piáo', '闝'), ('piáo', '㼼'), ('piáo', '㯱'),
              ('piáo', '䕯'), ('piáo', '䴩')]
    piao_3 = [('piǎo', '瞟'), ('piǎo', '缥'), ('piǎo', '莩'), ('piǎo', '殍'), ('piǎo', '篻'), ('piǎo', '縹'), ('piǎo', '醥'),
              ('piǎo', '皫'), ('piǎo', '顠'), ('piǎo', '㲏'), ('piǎo', '㹾'), ('piǎo', '㵱'), ('piǎo', '㩠')]
    piao_4 = [('piào', '票'), ('piào', '骠'), ('piào', '僄'), ('piào', '徱'), ('piào', '驃'), ('piào', '鰾'), ('piào', '㺓'),
              ('piào', '㬓'), ('piào', '䏇')]
    pie_1 = [('piē', '瞥'), ('piē', '撇'), ('piē', '氕'), ('piē', '覕'), ('piē', '潎'), ('piē', '撆'), ('piē', '暼')]
    pie_2 = [('piě', '丿'), ('piě', '苤'), ('piě', '鐅'), ('piě', '䥕')]
    pie_3 = [('piè', '嫳')]
    pin_1 = [('pīn', '拼'), ('pīn', '拚'), ('pīn', '姘'), ('pīn', '砏'), ('pīn', '礗'), ('pīn', '穦'), ('pīn', '馪'),
             ('pīn', '驞')]
    pin_2 = [('pín', '贫'), ('pín', '频'), ('pín', '嫔'), ('pín', '颦'), ('pín', '玭'), ('pín', '娦'), ('pín', '貧'),
             ('pín', '琕'), ('pín', '嬪'), ('pín', '薲'), ('pín', '嚬'), ('pín', '矉'), ('pín', '蘋'), ('pín', '蠙'),
             ('pín', '顰'), ('pín', '㲏'), ('pín', '㰋')]
    pin_3 = [('pǐn', '品'), ('pǐn', '榀')]
    pin_4 = [('pìn', '聘'), ('pìn', '牝'), ('pìn', '汖'), ('pìn', '䀻'), ('pìn', '㻞')]
    ping_1 = [('pīng', '乒'), ('pīng', '娉'), ('pīng', '甹'), ('pīng', '俜'), ('pīng', '涄'), ('pīng', '砯'), ('pīng', '聠'),
              ('pīng', '艵'), ('pīng', '頩')]
    ping_2 = [('píng', '平'), ('píng', '评'), ('píng', '凭'), ('píng', '瓶'), ('píng', '冯'), ('píng', '屏'), ('píng', '萍'),
              ('píng', '苹'), ('píng', '坪'), ('píng', '枰'), ('píng', '蓱'), ('píng', '呯'), ('píng', '岼'), ('píng', '泙'),
              ('píng', '郱'), ('píng', '帡'), ('píng', '庰'), ('píng', '洴'), ('píng', '玶'), ('píng', '胓'), ('píng', '荓'),
              ('píng', '帲'), ('píng', '淜'), ('píng', '硑'), ('píng', '蚲'), ('píng', '塀'), ('píng', '幈'), ('píng', '焩'),
              ('píng', '甁'), ('píng', '缾'), ('píng', '蛢'), ('píng', '評'), ('píng', '馮'), ('píng', '軿'), ('píng', '鲆'),
              ('píng', '凴'), ('píng', '竮'), ('píng', '鉼'), ('píng', '慿'), ('píng', '箳'), ('píng', '輧'), ('píng', '憑'),
              ('píng', '鮃'), ('píng', '檘'), ('píng', '簈'), ('píng', '蘋'), ('píng', '㺸'), ('píng', '㻂'), ('píng', '䓑'),
              ('píng', '䍈'), ('píng', '䈂'), ('píng', '㵗'), ('píng', '䶄')]
    ping_3 = [('pǐng', '屛')]
    ping_4 = [('pìng', '㲏')]
    po_1 = [('pō', '颇'), ('pō', '坡'), ('pō', '泼'), ('pō', '泊'), ('pō', '陂'), ('pō', '钋'), ('pō', '岥'), ('pō', '泺'),
            ('pō', '釙'), ('pō', '翍'), ('pō', '溌'), ('pō', '酦'), ('pō', '頗'), ('pō', '潑'), ('pō', '醗'), ('pō', '濼'),
            ('pō', '醱'), ('pō', '鏺'), ('pō', '㧊'), ('pō', '㔇')]
    po_2 = [('pó', '婆'), ('pó', '繁'), ('pó', '鄱'), ('pó', '皤'), ('pó', '嘙'), ('pó', '搫'), ('pó', '蔢'), ('pó', '櫇'),
            ('pó', '嚩'), ('pó', '㨇'), ('pó', '㰴'), ('pó', '㜑'), ('pó', '䮘'), ('pó', '㩯')]
    po_3 = [('pǒ', '叵'), ('pǒ', '尀'), ('pǒ', '钷'), ('pǒ', '笸'), ('pǒ', '鉕'), ('pǒ', '箥'), ('pǒ', '駊'), ('pǒ', '髲')]
    po_4 = [('pò', '破'), ('pò', '迫'), ('pò', '朴'), ('pò', '魄'), ('pò', '珀'), ('pò', '粕'), ('pò', '廹'), ('pò', '岶'),
            ('pò', '敀'), ('pò', '昢'), ('pò', '洦'), ('pò', '哱'), ('pò', '烞'), ('pò', '砶'), ('pò', '奤'), ('pò', '湐'),
            ('pò', '猼'), ('pò', '蒪'), ('pò', '䘠'), ('pò', '㛘'), ('pò', '䄸'), ('pò', '䎅'), ('pò', '䣪'), ('pò', '䦌'),
            ('pò', '䎊'), ('pò', '䞟'), ('pò', '䣮'), ('pò', '䯙'), ('pò', '䪖'), ('pò', '䪙'), ('pò', '䨰')]
    pou_1 = [('pōu', '剖'), ('pōu', '娝')]
    pou_2 = [('póu', '抔'), ('póu', '抙'), ('póu', '垺'), ('póu', '捊'), ('póu', '裒'), ('póu', '箁'), ('póu', '㼜'),
             ('póu', '㧵'), ('póu', '䎧'), ('póu', '䯽')]
    pou_3 = [('pǒu', '咅'), ('pǒu', '哣'), ('pǒu', '婄'), ('pǒu', '掊'), ('pǒu', '棓'), ('pǒu', '犃'), ('pǒu', '㟝'),
             ('pǒu', '㰴'), ('pǒu', '䳝')]
    pu_1 = [('pū', '扑'), ('pū', '仆'), ('pū', '铺'), ('pū', '噗'), ('pū', '攴'), ('pū', '攵'), ('pū', '抪'), ('pū', '炇'),
            ('pū', '柨'), ('pū', '陠'), ('pū', '痡'), ('pū', '秿'), ('pū', '撲'), ('pū', '潽'), ('pū', '鋪'), ('pū', '鯆')]
    pu_2 = [('pú', '葡'), ('pú', '菩'), ('pú', '蒲'), ('pú', '璞'), ('pú', '濮'), ('pú', '匍'), ('pú', '莆'), ('pú', '圤'),
            ('pú', '捗'), ('pú', '菐'), ('pú', '蒱'), ('pú', '僕'), ('pú', '箁'), ('pú', '酺'), ('pú', '墣'), ('pú', '獛'),
            ('pú', '瞨'), ('pú', '穙'), ('pú', '镤'), ('pú', '贌'), ('pú', '纀'), ('pú', '鏷'), ('pú', '㺪'), ('pú', '䔕'),
            ('pú', '䧤'), ('pú', '㒒'), ('pú', '㲫'), ('pú', '䈬'), ('pú', '䪬'), ('pú', '㙸'), ('pú', '䈻'), ('pú', '㯷'),
            ('pú', '䑑'), ('pú', '䗱'), ('pú', '䴆')]
    pu_3 = [('pǔ', '普'), ('pǔ', '朴'), ('pǔ', '谱'), ('pǔ', '浦'), ('pǔ', '圃'), ('pǔ', '埔'), ('pǔ', '溥'), ('pǔ', '烳'),
            ('pǔ', '圑'), ('pǔ', '暜'), ('pǔ', '諩'), ('pǔ', '擈'), ('pǔ', '樸'), ('pǔ', '氆'), ('pǔ', '檏'), ('pǔ', '镨'),
            ('pǔ', '譜'), ('pǔ', '蹼'), ('pǔ', '鐠'), ('pǔ', '㹒'), ('pǔ', '䲕')]
    pu_4 = [('pù', '堡'), ('pù', '暴'), ('pù', '瀑'), ('pù', '曝'), ('pù', '舖'), ('pù', '舗'), ('pù', '㬥')]
    qi_1 = [('qī', '期'), ('qī', '七'), ('qī', '妻'), ('qī', '欺'), ('qī', '戚'), ('qī', '凄'), ('qī', '漆'), ('qī', '栖'),
            ('qī', '缉'), ('qī', '蹊'), ('qī', '沏'), ('qī', '欹'), ('qī', '萋'), ('qī', '嘁'), ('qī', '迉'), ('qī', '恓'),
            ('qī', '柒'), ('qī', '倛'), ('qī', '桤'), ('qī', '郪'), ('qī', '娸'), ('qī', '悽'), ('qī', '捿'), ('qī', '桼'),
            ('qī', '淒'), ('qī', '喰'), ('qī', '攲'), ('qī', '敧'), ('qī', '棲'), ('qī', '紪'), ('qī', '傶'), ('qī', '褄'),
            ('qī', '僛'), ('qī', '墄'), ('qī', '慽'), ('qī', '榿'), ('qī', '緀'), ('qī', '慼'), ('qī', '緝'), ('qī', '諆'),
            ('qī', '踦'), ('qī', '螇'), ('qī', '霋'), ('qī', '魌'), ('qī', '鏚'), ('qī', '鶈'), ('qī', '㩻'), ('qī', '㱦'),
            ('qī', '䣛'), ('qī', '䗁'), ('qī', '䫏'), ('qī', '䰍')]
    qi_2 = [('qí', '其'), ('qí', '奇'), ('qí', '齐'), ('qí', '骑'), ('qí', '枝'), ('qí', '旗'), ('qí', '棋'), ('qí', '琪'),
            ('qí', '祈'), ('qí', '歧'), ('qí', '祁'), ('qí', '琦'), ('qí', '麒'), ('qí', '俟'), ('qí', '岐'), ('qí', '崎'),
            ('qí', '祺'), ('qí', '淇'), ('qí', '伎'), ('qí', '颀'), ('qí', '耆'), ('qí', '脐'), ('qí', '畦'), ('qí', '蕲'),
            ('qí', '圻'), ('qí', '荠'), ('qí', '锜'), ('qí', '綦'), ('qí', '鳍'), ('qí', '丌'), ('qí', '亓'), ('qí', '岓'),
            ('qí', '忯'), ('qí', '芪'), ('qí', '亝'), ('qí', '斉'), ('qí', '畁'), ('qí', '祇'), ('qí', '肵'), ('qí', '疧'),
            ('qí', '剘'), ('qí', '斊'), ('qí', '旂'), ('qí', '竒'), ('qí', '蚑'), ('qí', '蚔'), ('qí', '蚚'), ('qí', '陭'),
            ('qí', '埼'), ('qí', '帺'), ('qí', '掑'), ('qí', '猉'), ('qí', '萁'), ('qí', '萕'), ('qí', '跂'), ('qí', '軝'),
            ('qí', '釮'), ('qí', '骐'), ('qí', '嵜'), ('qí', '棊'), ('qí', '蛴'), ('qí', '隑'), ('qí', '愭'), ('qí', '碁'),
            ('qí', '碕'), ('qí', '稘'), ('qí', '褀'), ('qí', '頎'), ('qí', '鬿'), ('qí', '粸'), ('qí', '綥'), ('qí', '綨'),
            ('qí', '蜝'), ('qí', '蜞'), ('qí', '齊'), ('qí', '璂'), ('qí', '禥'), ('qí', '觭'), ('qí', '螧'), ('qí', '錡'),
            ('qí', '鲯'), ('qí', '懠'), ('qí', '濝'), ('qí', '薺'), ('qí', '藄'), ('qí', '鄿'), ('qí', '檱'), ('qí', '櫀'),
            ('qí', '簯'), ('qí', '簱'), ('qí', '臍'), ('qí', '騎'), ('qí', '騏'), ('qí', '蘄'), ('qí', '鯕'), ('qí', '鵸'),
            ('qí', '鶀'), ('qí', '籏'), ('qí', '艩'), ('qí', '蠐'), ('qí', '鬐'), ('qí', '騹'), ('qí', '鰭'), ('qí', '玂'),
            ('qí', '麡'), ('qí', '㞿'), ('qí', '㫅'), ('qí', '㐞'), ('qí', '㟓'), ('qí', '䉻'), ('qí', '䓅'), ('qí', '㟚'),
            ('qí', '㟢'), ('qí', '㩽'), ('qí', '䓫'), ('qí', '䞚'), ('qí', '䟚'), ('qí', '䡋'), ('qí', '䧘'), ('qí', '㖢'),
            ('qí', '䧵'), ('qí', '䩓'), ('qí', '䭶'), ('qí', '䑴'), ('qí', '䭼'), ('qí', '㙨'), ('qí', '䅲'), ('qí', '䲬'),
            ('qí', '㯦'), ('qí', '䐡'), ('qí', '䱈'), ('qí', '䕤'), ('qí', '䶒'), ('qí', '䄢'), ('qí', '䠞'), ('qí', '䰇'),
            ('qí', '䳢'), ('qí', '䶞')]
    qi_3 = [('qǐ', '起'), ('qǐ', '企'), ('qǐ', '岂'), ('qǐ', '启'), ('qǐ', '乞'), ('qǐ', '稽'), ('qǐ', '绮'), ('qǐ', '杞'),
            ('qǐ', '邔'), ('qǐ', '屺'), ('qǐ', '芑'), ('qǐ', '呇'), ('qǐ', '玘'), ('qǐ', '盀'), ('qǐ', '唘'), ('qǐ', '豈'),
            ('qǐ', '啓'), ('qǐ', '啔'), ('qǐ', '啟'), ('qǐ', '婍'), ('qǐ', '梩'), ('qǐ', '袳'), ('qǐ', '晵'), ('qǐ', '棨'),
            ('qǐ', '綮'), ('qǐ', '綺'), ('qǐ', '諬'), ('qǐ', '闙'), ('qǐ', '㫓'), ('qǐ', '䄫'), ('qǐ', '㞓'), ('qǐ', '䎢'),
            ('qǐ', '䒻'), ('qǐ', '㠱'), ('qǐ', '㥓'), ('qǐ', '䄎'), ('qǐ', '䏿'), ('qǐ', '㾨'), ('qǐ', '䔇'), ('qǐ', '䡔'),
            ('qǐ', '㒅'), ('qǐ', '㓗'), ('qǐ', '䋯'), ('qǐ', '䛴'), ('qǐ', '䭫'), ('qǐ', '䭬'), ('qǐ', '㩩'), ('qǐ', '䉝')]
    qi_4 = [('qì', '气'), ('qì', '器'), ('qì', '弃'), ('qì', '汽'), ('qì', '泣'), ('qì', '揭'), ('qì', '契'), ('qì', '讫'),
            ('qì', '迄'), ('qì', '砌'), ('qì', '亟'), ('qì', '憩'), ('qì', '葺'), ('qì', '忔'), ('qì', '扱'), ('qì', '気'),
            ('qì', '汔'), ('qì', '呚'), ('qì', '矵'), ('qì', '芞'), ('qì', '呮'), ('qì', '炁'), ('qì', '盵'), ('qì', '咠'),
            ('qì', '洓'), ('qì', '竐'), ('qì', '栔'), ('qì', '欫'), ('qì', '氣'), ('qì', '訖'), ('qì', '唭'), ('qì', '焏'),
            ('qì', '夡'), ('qì', '愒'), ('qì', '棄'), ('qì', '湆'), ('qì', '湇'), ('qì', '滊'), ('qì', '碛'), ('qì', '摖'),
            ('qì', '暣'), ('qì', '甈'), ('qì', '碶'), ('qì', '噐'), ('qì', '憇'), ('qì', '槭'), ('qì', '趞'), ('qì', '磜'),
            ('qì', '磧'), ('qì', '磩'), ('qì', '藒'), ('qì', '礘'), ('qì', '罊'), ('qì', '蟿'), ('qì', '鐑'), ('qì', '㓞'),
            ('qì', '䏌'), ('qì', '䒗'), ('qì', '䢀'), ('qì', '㰟'), ('qì', '䀙'), ('qì', '䏠'), ('qì', '㼤'), ('qì', '䬣'),
            ('qì', '㗊'), ('qì', '㝄'), ('qì', '㞚'), ('qì', '㣬'), ('qì', '㼮'), ('qì', '㮑'), ('qì', '䁈'), ('qì', '䁉'),
            ('qì', '䐤'), ('qì', '䛛'), ('qì', '㹄'), ('qì', '䀈'), ('qì', '䅤'), ('qì', '䙄'), ('qì', '䟷'), ('qì', '䰴'),
            ('qì', '㠍'), ('qì', '㠎'), ('qì', '䔾'), ('qì', '㦢'), ('qì', '䚉'), ('qì', '䌌'), ('qì', '䏅'), ('qì', '䶓'),
            ('qì', '㔑'), ('qì', '㘍'), ('qì', '䚍'), ('qì', '䟄'), ('qì', '䫔'), ('qì', '䯥')]
    qi_5 = [('qi', '啐')]
    qia_1 = [('qiā', '掐'), ('qiā', '抲'), ('qiā', '袷'), ('qiā', '揢'), ('qiā', '葜'), ('qiā', '擖'), ('qiā', '㤉'),
             ('qiā', '㧎'), ('qiā', '䶗')]
    qia_2 = [('qiá', '䠍')]
    qia_3 = [('qiǎ', '卡'), ('qiǎ', '拤'), ('qiǎ', '峠'), ('qiǎ', '跒'), ('qiǎ', '酠'), ('qiǎ', '鞐')]
    qia_4 = [('qià', '恰'), ('qià', '洽'), ('qià', '咭'), ('qià', '圶'), ('qià', '冾'), ('qià', '匼'), ('qià', '帢'),
             ('qià', '胢'), ('qià', '殎'), ('qià', '硈'), ('qià', '愘'), ('qià', '磍'), ('qià', '髂'), ('qià', '㓞'),
             ('qià', '㓣'), ('qià', '㓤'), ('qià', '㦴'), ('qià', '㡊'), ('qià', '䂒'), ('qià', '㵄'), ('qià', '䁍'),
             ('qià', '䨐'), ('qià', '䯊'), ('qià', '䜑'), ('qià', '䶝')]
    qian_1 = [('qiān', '千'), ('qiān', '签'), ('qiān', '牵'), ('qiān', '迁'), ('qiān', '谦'), ('qiān', '铅'), ('qiān', '芊'),
              ('qiān', '佥'), ('qiān', '骞'), ('qiān', '愆'), ('qiān', '仟'), ('qiān', '阡'), ('qiān', '悭'), ('qiān', '搴'),
              ('qiān', '圱'), ('qiān', '圲'), ('qiān', '奷'), ('qiān', '扦'), ('qiān', '汘'), ('qiān', '岍'), ('qiān', '杄'),
              ('qiān', '汧'), ('qiān', '茾'), ('qiān', '欦'), ('qiān', '竏'), ('qiān', '臤'), ('qiān', '钎'), ('qiān', '拪'),
              ('qiān', '粁'), ('qiān', '挳'), ('qiān', '蚈'), ('qiān', '谸'), ('qiān', '婜'), ('qiān', '孯'), ('qiān', '牽'),
              ('qiān', '釺'), ('qiān', '掔'), ('qiān', '鈆'), ('qiān', '僉'), ('qiān', '鉛'), ('qiān', '鹐'), ('qiān', '慳'),
              ('qiān', '摼'), ('qiān', '撁'), ('qiān', '厱'), ('qiān', '磏'), ('qiān', '諐'), ('qiān', '遷'), ('qiān', '鳽'),
              ('qiān', '褰'), ('qiān', '謙'), ('qiān', '顅'), ('qiān', '檶'), ('qiān', '攐'), ('qiān', '攑'), ('qiān', '櫏'),
              ('qiān', '簽'), ('qiān', '鏲'), ('qiān', '鵮'), ('qiān', '孅'), ('qiān', '攓'), ('qiān', '騫'), ('qiān', '籖'),
              ('qiān', '鬜'), ('qiān', '鬝'), ('qiān', '籤'), ('qiān', '韆'), ('qiān', '䇂'), ('qiān', '㩃'), ('qiān', '䞿'),
              ('qiān', '㡨')]
    qian_2 = [('qián', '前'), ('qián', '钱'), ('qián', '潜'), ('qián', '乾'), ('qián', '虔'), ('qián', '钳'), ('qián', '黔'),
              ('qián', '箝'), ('qián', '钤'), ('qián', '掮'), ('qián', '仱'), ('qián', '岒'), ('qián', '忴'), ('qián', '扲'),
              ('qián', '拑'), ('qián', '玪'), ('qián', '乹'), ('qián', '炶'), ('qián', '荨'), ('qián', '歬'), ('qián', '蚙'),
              ('qián', '偂'), ('qián', '揵'), ('qián', '軡'), ('qián', '亁'), ('qián', '媊'), ('qián', '朁'), ('qián', '犍'),
              ('qián', '葥'), ('qián', '鈐'), ('qián', '煔'), ('qián', '鉗'), ('qián', '墘'), ('qián', '榩'), ('qián', '銭'),
              ('qián', '撍'), ('qián', '潛'), ('qián', '羬'), ('qián', '蕁'), ('qián', '橬'), ('qián', '錢'), ('qián', '鎆'),
              ('qián', '黚'), ('qián', '騝'), ('qián', '濳'), ('qián', '騚'), ('qián', '灊'), ('qián', '鰬'), ('qián', '㦮'),
              ('qián', '㸫'), ('qián', '䖍'), ('qián', '䍉'), ('qián', '䅐'), ('qián', '䨿'), ('qián', '㨜'), ('qián', '䋮'),
              ('qián', '䈤'), ('qián', '䢪'), ('qián', '䁮'), ('qián', '䅾'), ('qián', '䕭'), ('qián', '㩮')]
    qian_3 = [('qiǎn', '浅'), ('qiǎn', '遣'), ('qiǎn', '谴'), ('qiǎn', '缱'), ('qiǎn', '凵'), ('qiǎn', '肷'), ('qiǎn', '唊'),
              ('qiǎn', '淺'), ('qiǎn', '嵰'), ('qiǎn', '槏'), ('qiǎn', '膁'), ('qiǎn', '蜸'), ('qiǎn', '繾'), ('qiǎn', '譴'),
              ('qiǎn', '鑓'), ('qiǎn', '㧄'), ('qiǎn', '㡊'), ('qiǎn', '䙺'), ('qiǎn', '㹂'), ('qiǎn', '䔔'), ('qiǎn', '䭤'),
              ('qiǎn', '䪈'), ('qiǎn', '䤘')]
    qian_4 = [('qiàn', '欠'), ('qiàn', '纤'), ('qiàn', '歉'), ('qiàn', '嵌'), ('qiàn', '倩'), ('qiàn', '茜'), ('qiàn', '堑'),
              ('qiàn', '慊'), ('qiàn', '刋'), ('qiàn', '伣'), ('qiàn', '芡'), ('qiàn', '俔'), ('qiàn', '悓'), ('qiàn', '掅'),
              ('qiàn', '傔'), ('qiàn', '棈'), ('qiàn', '椠'), ('qiàn', '欿'), ('qiàn', '嗛'), ('qiàn', '皘'), ('qiàn', '蒨'),
              ('qiàn', '塹'), ('qiàn', '綪'), ('qiàn', '蔳'), ('qiàn', '儙'), ('qiàn', '槧'), ('qiàn', '篏'), ('qiàn', '輤'),
              ('qiàn', '篟'), ('qiàn', '壍'), ('qiàn', '嬱'), ('qiàn', '縴'), ('qiàn', '㐸'), ('qiàn', '㝿'), ('qiàn', '㥞'),
              ('qiàn', '㜞'), ('qiàn', '㟻'), ('qiàn', '㪠'), ('qiàn', '䑶'), ('qiàn', '㯠'), ('qiàn', '䃛'), ('qiàn', '䈴'),
              ('qiàn', '䆂'), ('qiàn', '䥅'), ('qiàn', '䭑'), ('qiàn', '䫡'), ('qiàn', '䯡'), ('qiàn', '䵖'), ('qiàn', '䦲'),
              ('qiàn', '䭠'), ('qiàn', '䊴')]
    qiang_1 = [('qiāng', '枪'), ('qiāng', '抢'), ('qiāng', '腔'), ('qiāng', '跄'), ('qiāng', '呛'), ('qiāng', '锵'),
               ('qiāng', '羌'), ('qiāng', '戕'), ('qiāng', '戗'), ('qiāng', '斨'), ('qiāng', '玱'), ('qiāng', '矼'),
               ('qiāng', '羗'), ('qiāng', '猐'), ('qiāng', '啌'), ('qiāng', '嗴'), ('qiāng', '椌'), ('qiāng', '溬'),
               ('qiāng', '獇'), ('qiāng', '嗆'), ('qiāng', '搶'), ('qiāng', '蜣'), ('qiāng', '锖'), ('qiāng', '嶈'),
               ('qiāng', '戧'), ('qiāng', '摤'), ('qiāng', '槍'), ('qiāng', '牄'), ('qiāng', '瑲'), ('qiāng', '羫'),
               ('qiāng', '篬'), ('qiāng', '謒'), ('qiāng', '蹌'), ('qiāng', '蹡'), ('qiāng', '鎗'), ('qiāng', '鏘'),
               ('qiāng', '鶬')]
    qiang_2 = [('qiáng', '强'), ('qiáng', '墙'), ('qiáng', '疆'), ('qiáng', '蔷'), ('qiáng', '嫱'), ('qiáng', '樯'),
               ('qiáng', '強'), ('qiáng', '漒'), ('qiáng', '蔃'), ('qiáng', '墻'), ('qiáng', '嬙'), ('qiáng', '廧'),
               ('qiáng', '彊'), ('qiáng', '薔'), ('qiáng', '檣'), ('qiáng', '牆'), ('qiáng', '艢'), ('qiáng', '蘠'),
               ('qiáng', '㩖')]
    qiang_3 = [('qiǎng', '襁'), ('qiǎng', '羟'), ('qiǎng', '羥'), ('qiǎng', '墏'), ('qiǎng', '繈'), ('qiǎng', '镪'),
               ('qiǎng', '繦'), ('qiǎng', '鏹'), ('qiǎng', '㛨'), ('qiǎng', '䅚')]
    qiang_4 = [('qiàng', '炝'), ('qiàng', '唴'), ('qiàng', '摪'), ('qiàng', '熗'), ('qiàng', '羻'), ('qiàng', '䵁')]
    qiao_1 = [('qiāo', '敲'), ('qiāo', '雀'), ('qiāo', '跷'), ('qiāo', '锹'), ('qiāo', '橇'), ('qiāo', '帩'), ('qiāo', '硗'),
              ('qiāo', '郻'), ('qiāo', '喿'), ('qiāo', '嵪'), ('qiāo', '煍'), ('qiāo', '鄡'), ('qiāo', '鄥'), ('qiāo', '劁'),
              ('qiāo', '勪'), ('qiāo', '幓'), ('qiāo', '毃'), ('qiāo', '踍'), ('qiāo', '墝'), ('qiāo', '碻'), ('qiāo', '磝'),
              ('qiāo', '頝'), ('qiāo', '骹'), ('qiāo', '墽'), ('qiāo', '幧'), ('qiāo', '燆'), ('qiāo', '缲'), ('qiāo', '橾'),
              ('qiāo', '磽'), ('qiāo', '鍫'), ('qiāo', '鍬'), ('qiāo', '礉'), ('qiāo', '繑'), ('qiāo', '繰'), ('qiāo', '趬'),
              ('qiāo', '蹺'), ('qiāo', '蹻'), ('qiāo', '鏒'), ('qiāo', '鐰'), ('qiāo', '䂭'), ('qiāo', '䫞')]
    qiao_2 = [('qiáo', '瞧'), ('qiáo', '乔'), ('qiáo', '桥'), ('qiáo', '樵'), ('qiáo', '侨'), ('qiáo', '翘'), ('qiáo', '憔'),
              ('qiáo', '峤'), ('qiáo', '荞'), ('qiáo', '谯'), ('qiáo', '荍'), ('qiáo', '硚'), ('qiáo', '菬'), ('qiáo', '喬'),
              ('qiáo', '睄'), ('qiáo', '僑'), ('qiáo', '摮'), ('qiáo', '槗'), ('qiáo', '嘺'), ('qiáo', '墧'), ('qiáo', '嫶'),
              ('qiáo', '嶠'), ('qiáo', '潐'), ('qiáo', '蕎'), ('qiáo', '鞒'), ('qiáo', '橋'), ('qiáo', '燋'), ('qiáo', '犞'),
              ('qiáo', '癄'), ('qiáo', '礄'), ('qiáo', '翹'), ('qiáo', '櫵'), ('qiáo', '藮'), ('qiáo', '譙'), ('qiáo', '趫'),
              ('qiáo', '鐈'), ('qiáo', '鞽'), ('qiáo', '顦'), ('qiáo', '㝯'), ('qiáo', '䱁'), ('qiáo', '䀉'), ('qiáo', '䎗'),
              ('qiáo', '㩰'), ('qiáo', '䩌'), ('qiáo', '㚁')]
    qiao_3 = [('qiǎo', '巧'), ('qiǎo', '悄'), ('qiǎo', '愀'), ('qiǎo', '丂'), ('qiǎo', '釥'), ('qiǎo', '髜'), ('qiǎo', '㚽'),
              ('qiǎo', '㤍'), ('qiǎo', '㡑'), ('qiǎo', '㨽'), ('qiǎo', '㱶'), ('qiǎo', '䲾')]
    qiao_4 = [('qiào', '俏'), ('qiào', '壳'), ('qiào', '窍'), ('qiào', '鞘'), ('qiào', '峭'), ('qiào', '诮'), ('qiào', '撬'),
              ('qiào', '陗'), ('qiào', '偢'), ('qiào', '殻'), ('qiào', '殼'), ('qiào', '誚'), ('qiào', '髚'), ('qiào', '僺'),
              ('qiào', '箾'), ('qiào', '噭'), ('qiào', '撽'), ('qiào', '韒'), ('qiào', '竅'), ('qiào', '鞩'), ('qiào', '躈'),
              ('qiào', '䇌'), ('qiào', '㴥'), ('qiào', '㪣'), ('qiào', '㢗'), ('qiào', '䃝'), ('qiào', '䆻')]
    qie_1 = [('qiē', '切'), ('qiē', '苆'), ('qiē', '㛗')]
    qie_2 = [('qié', '茄'), ('qié', '伽'), ('qié', '癿'), ('qié', '聺'), ('qié', '㚗'), ('qié', '䦧')]
    qie_3 = [('qiě', '且')]
    qie_4 = [('qiè', '妾'), ('qiè', '契'), ('qiè', '窃'), ('qiè', '怯'), ('qiè', '砌'), ('qiè', '惬'), ('qiè', '挈'),
             ('qiè', '箧'), ('qiè', '郄'), ('qiè', '趄'), ('qiè', '慊'), ('qiè', '锲'), ('qiè', '厒'), ('qiè', '疌'),
             ('qiè', '匧'), ('qiè', '悏'), ('qiè', '栔'), ('qiè', '洯'), ('qiè', '帹'), ('qiè', '淁'), ('qiè', '笡'),
             ('qiè', '愜'), ('qiè', '椄'), ('qiè', '猰'), ('qiè', '蛪'), ('qiè', '跙'), ('qiè', '嗛'), ('qiè', '朅'),
             ('qiè', '稧'), ('qiè', '篋'), ('qiè', '踥'), ('qiè', '穕'), ('qiè', '鍥'), ('qiè', '鯜'), ('qiè', '竊'),
             ('qiè', '籡'), ('qiè', '㹤'), ('qiè', '㰤'), ('qiè', '㛍'), ('qiè', '㛙'), ('qiè', '㼤'), ('qiè', '㾀'),
             ('qiè', '㓶'), ('qiè', '㤲'), ('qiè', '㰰'), ('qiè', '䟙'), ('qiè', '㫸'), ('qiè', '㾜'), ('qiè', '䞣'),
             ('qiè', '㥦'), ('qiè', '㰼'), ('qiè', '㗫'), ('qiè', '䬊'), ('qiè', '䌌'), ('qiè', '㙻'), ('qiè', '䤿'),
             ('qiè', '䫔')]
    qin_1 = [('qīn', '亲'), ('qīn', '侵'), ('qīn', '钦'), ('qīn', '衾'), ('qīn', '兓'), ('qīn', '骎'), ('qīn', '媇'),
             ('qīn', '嵚'), ('qīn', '欽'), ('qīn', '嵰'), ('qīn', '綅'), ('qīn', '誛'), ('qīn', '嶔'), ('qīn', '親'),
             ('qīn', '顉'), ('qīn', '駸'), ('qīn', '鮼'), ('qīn', '寴'), ('qīn', '㓎')]
    qin_2 = [('qín', '秦'), ('qín', '琴'), ('qín', '勤'), ('qín', '擒'), ('qín', '禽'), ('qín', '矜'), ('qín', '芹'),
             ('qín', '噙'), ('qín', '覃'), ('qín', '螓'), ('qín', '庈'), ('qín', '忴'), ('qín', '扲'), ('qín', '芩'),
             ('qín', '肣'), ('qín', '埐'), ('qín', '珡'), ('qín', '矝'), ('qín', '耹'), ('qín', '菦'), ('qín', '蚙'),
             ('qín', '捦'), ('qín', '菳'), ('qín', '琹'), ('qín', '鈙'), ('qín', '鈫'), ('qín', '雂'), ('qín', '嗪'),
             ('qín', '嫀'), ('qín', '溱'), ('qín', '靲'), ('qín', '廑'), ('qín', '慬'), ('qín', '嶜'), ('qín', '斳'),
             ('qín', '鳹'), ('qín', '懄'), ('qín', '檎'), ('qín', '澿'), ('qín', '瘽'), ('qín', '懃'), ('qín', '蠄'),
             ('qín', '鵭'), ('qín', '㘦'), ('qín', '㪁'), ('qín', '㱽'), ('qín', '㕋'), ('qín', '㛙'), ('qín', '䖌'),
             ('qín', '㮗'), ('qín', '䇒'), ('qín', '䔷'), ('qín', '䰼'), ('qín', '㢙'), ('qín', '㩒'), ('qín', '䦦'),
             ('qín', '䅾'), ('qín', '䥅'), ('qín', '䥆'), ('qín', '䶖'), ('qín', '䢈')]
    qin_3 = [('qǐn', '寝'), ('qǐn', '坅'), ('qǐn', '昑'), ('qǐn', '笉'), ('qǐn', '梫'), ('qǐn', '赾'), ('qǐn', '寑'),
             ('qǐn', '锓'), ('qǐn', '寖'), ('qǐn', '寢'), ('qǐn', '鋟'), ('qǐn', '螼'), ('qǐn', '㾛'), ('qǐn', '䠴'),
             ('qǐn', '㝲')]
    qin_4 = [('qìn', '沁'), ('qìn', '揿'), ('qìn', '吢'), ('qìn', '吣'), ('qìn', '抋'), ('qìn', '唚'), ('qìn', '菣'),
             ('qìn', '搇'), ('qìn', '撳'), ('qìn', '瀙'), ('qìn', '藽'), ('qìn', '㞬'), ('qìn', '㤈'), ('qìn', '䈜')]
    qing_1 = [('qīng', '清'), ('qīng', '轻'), ('qīng', '青'), ('qīng', '卿'), ('qīng', '倾'), ('qīng', '蜻'), ('qīng', '氢'),
              ('qīng', '鲭'), ('qīng', '靑'), ('qīng', '郬'), ('qīng', '圊'), ('qīng', '埥'), ('qīng', '寈'), ('qīng', '氫'),
              ('qīng', '淸'), ('qīng', '軽'), ('qīng', '傾'), ('qīng', '綪'), ('qīng', '輕'), ('qīng', '錆'), ('qīng', '鯖'),
              ('qīng', '鑋')]
    qing_2 = [('qíng', '情'), ('qíng', '晴'), ('qíng', '擎'), ('qíng', '黥'), ('qíng', '夝'), ('qíng', '甠'), ('qíng', '剠'),
              ('qíng', '勍'), ('qíng', '啨'), ('qíng', '殑'), ('qíng', '硘'), ('qíng', '棾'), ('qíng', '氰'), ('qíng', '葝'),
              ('qíng', '暒'), ('qíng', '擏'), ('qíng', '樈'), ('qíng', '檠'), ('qíng', '䞍'), ('qíng', '㔀'), ('qíng', '䵞'),
              ('qíng', '㢣'), ('qíng', '䝼'), ('qíng', '㯳'), ('qíng', '䲔')]
    qing_3 = [('qǐng', '请'), ('qǐng', '顷'), ('qǐng', '苘'), ('qǐng', '庼'), ('qǐng', '頃'), ('qǐng', '廎'), ('qǐng', '漀'),
              ('qǐng', '請'), ('qǐng', '檾'), ('qǐng', '謦'), ('qǐng', '䯧'), ('qǐng', '䔛'), ('qǐng', '㷫'), ('qǐng', '㩩')]
    qing_4 = [('qìng', '亲'), ('qìng', '庆'), ('qìng', '磬'), ('qìng', '罄'), ('qìng', '凊'), ('qìng', '掅'), ('qìng', '殸'),
              ('qìng', '渹'), ('qìng', '碃'), ('qìng', '箐'), ('qìng', '綮'), ('qìng', '靘'), ('qìng', '慶'), ('qìng', '親'),
              ('qìng', '儬'), ('qìng', '濪'), ('qìng', '櫦'), ('qìng', '䋜'), ('qìng', '䋯'), ('qìng', '㵾'), ('qìng', '䌠')]
    qiong_1 = []
    qiong_2 = [('qióng', '穷'), ('qióng', '琼'), ('qióng', '穹'), ('qióng', '邛'), ('qióng', '茕'), ('qióng', '蛩'),
               ('qióng', '嬛'), ('qióng', '卭'), ('qióng', '宆'), ('qióng', '桏'), ('qióng', '惸'), ('qióng', '琁'),
               ('qióng', '笻'), ('qióng', '筇'), ('qióng', '赹'), ('qióng', '焪'), ('qióng', '焭'), ('qióng', '舼'),
               ('qióng', '蛬'), ('qióng', '煢'), ('qióng', '熍'), ('qióng', '睘'), ('qióng', '跫'), ('qióng', '銎'),
               ('qióng', '瞏'), ('qióng', '窮'), ('qióng', '儝'), ('qióng', '憌'), ('qióng', '橩'), ('qióng', '璚'),
               ('qióng', '藑'), ('qióng', '瓊'), ('qióng', '竆'), ('qióng', '藭'), ('qióng', '瓗'), ('qióng', '㑋'),
               ('qióng', '䧆'), ('qióng', '㤨'), ('qióng', '㧭'), ('qióng', '䓖'), ('qióng', '㷀'), ('qióng', '䅃'),
               ('qióng', '䊄'), ('qióng', '㒌'), ('qióng', '㮪'), ('qióng', '㵌'), ('qióng', '䆳'), ('qióng', '䛪'),
               ('qióng', '䠻'), ('qióng', '㼇')]
    qiong_3 = []
    qiu_1 = [('qiū', '秋'), ('qiū', '丘'), ('qiū', '龟'), ('qiū', '邱'), ('qiū', '蚯'), ('qiū', '湫'), ('qiū', '鳅'),
             ('qiū', '丠'), ('qiū', '坵'), ('qiū', '恘'), ('qiū', '秌'), ('qiū', '恷'), ('qiū', '媝'), ('qiū', '萩'),
             ('qiū', '楸'), ('qiū', '湬'), ('qiū', '塸'), ('qiū', '蓲'), ('qiū', '鹙'), ('qiū', '篍'), ('qiū', '緧'),
             ('qiū', '蝵'), ('qiū', '穐'), ('qiū', '趥'), ('qiū', '龜'), ('qiū', '橚'), ('qiū', '蟗'), ('qiū', '鞦'),
             ('qiū', '鞧'), ('qiū', '蘒'), ('qiū', '鰌'), ('qiū', '鰍'), ('qiū', '鶖'), ('qiū', '蠤'), ('qiū', '龝'),
             ('qiū', '㐀'), ('qiū', '䲡'), ('qiū', '䱸')]
    qiu_2 = [('qiú', '求'), ('qiú', '球'), ('qiú', '仇'), ('qiú', '囚'), ('qiú', '裘'), ('qiú', '酋'), ('qiú', '虬'),
             ('qiú', '泅'), ('qiú', '俅'), ('qiú', '遒'), ('qiú', '厹'), ('qiú', '叴'), ('qiú', '扏'), ('qiú', '犰'),
             ('qiú', '玌'), ('qiú', '艽'), ('qiú', '芁'), ('qiú', '朹'), ('qiú', '汓'), ('qiú', '肍'), ('qiú', '牫'),
             ('qiú', '虯'), ('qiú', '觓'), ('qiú', '訄'), ('qiú', '訅'), ('qiú', '唒'), ('qiú', '浗'), ('qiú', '紌'),
             ('qiú', '莍'), ('qiú', '逎'), ('qiú', '逑'), ('qiú', '釚'), ('qiú', '梂'), ('qiú', '殏'), ('qiú', '毬'),
             ('qiú', '赇'), ('qiú', '釻'), ('qiú', '頄'), ('qiú', '崷'), ('qiú', '巯'), ('qiú', '渞'), ('qiú', '湭'),
             ('qiú', '皳'), ('qiú', '盚'), ('qiú', '煪'), ('qiú', '絿'), ('qiú', '蛷'), ('qiú', '巰'), ('qiú', '觩'),
             ('qiú', '賕'), ('qiú', '璆'), ('qiú', '蝤'), ('qiú', '銶'), ('qiú', '醔'), ('qiú', '鮂'), ('qiú', '鼽'),
             ('qiú', '鯄'), ('qiú', '鰽'), ('qiú', '㕤'), ('qiú', '㧄'), ('qiú', '㲹'), ('qiú', '㺫'), ('qiú', '䊵'),
             ('qiú', '㧨'), ('qiú', '䜪'), ('qiú', '䣇'), ('qiú', '㛏'), ('qiú', '㞗'), ('qiú', '㟈'), ('qiú', '㤹'),
             ('qiú', '㭝'), ('qiú', '䤛'), ('qiú', '㐤'), ('qiú', '㥢'), ('qiú', '㷕'), ('qiú', '䔔'), ('qiú', '䟵'),
             ('qiú', '䎿')]
    qiu_3 = [('qiǔ', '糗'), ('qiǔ', '搝'), ('qiǔ', '䊆'), ('qiǔ', '㼒'), ('qiǔ', '䞭')]
    qiu_4 = [('qiù', '䟬'), ('qiù', '䠗')]
    qu_1 = [('qū', '区'), ('qū', '曲'), ('qū', '屈'), ('qū', '驱'), ('qū', '趋'), ('qū', '躯'), ('qū', '岖'), ('qū', '蛆'),
            ('qū', '诎'), ('qū', '祛'), ('qū', '蛐'), ('qū', '伹'), ('qū', '佉'), ('qū', '匤'), ('qū', '阹'), ('qū', '呿'),
            ('qū', '坥'), ('qū', '岴'), ('qū', '抾'), ('qū', '浀'), ('qū', '胠'), ('qū', '袪'), ('qū', '區'), ('qū', '焌'),
            ('qū', '紶'), ('qū', '煀'), ('qū', '筁'), ('qū', '粬'), ('qū', '詘'), ('qū', '趍'), ('qū', '嶇'), ('qū', '憈'),
            ('qū', '駆'), ('qū', '敺'), ('qū', '誳'), ('qū', '駈'), ('qū', '麹'), ('qū', '髷'), ('qū', '魼'), ('qū', '趨'),
            ('qū', '麯'), ('qū', '覰'), ('qū', '軀'), ('qū', '鶌'), ('qū', '麴'), ('qū', '黢'), ('qū', '驅'), ('qū', '鰸'),
            ('qū', '鱋'), ('qū', '㭕'), ('qū', '䒼'), ('qū', '㻃'), ('qū', '䓛'), ('qū', '䖦'), ('qū', '䧢')]
    qu_2 = [('qú', '渠'), ('qú', '瞿'), ('qú', '衢'), ('qú', '蘧'), ('qú', '劬'), ('qú', '蕖'), ('qú', '癯'), ('qú', '佢'),
            ('qú', '斪'), ('qú', '朐'), ('qú', '胊'), ('qú', '菃'), ('qú', '衐'), ('qú', '鸲'), ('qú', '淭'), ('qú', '絇'),
            ('qú', '翑'), ('qú', '蚼'), ('qú', '葋'), ('qú', '軥'), ('qú', '璖'), ('qú', '磲'), ('qú', '螶'), ('qú', '鴝'),
            ('qú', '璩'), ('qú', '翵'), ('qú', '蟝'), ('qú', '鼩'), ('qú', '忂'), ('qú', '灈'), ('qú', '戵'), ('qú', '欋'),
            ('qú', '氍'), ('qú', '爠'), ('qú', '籧'), ('qú', '臞'), ('qú', '欔'), ('qú', '蠷'), ('qú', '躣'), ('qú', '蠼'),
            ('qú', '鑺'), ('qú', '鸜'), ('qú', '㪯'), ('qú', '㖆'), ('qú', '㽛'), ('qú', '䀠'), ('qú', '㲘'), ('qú', '䞤'),
            ('qú', '䪨'), ('qú', '㣄'), ('qú', '䋧'), ('qú', '䗇'), ('qú', '㯫'), ('qú', '䵶'), ('qú', '䆽'), ('qú', '䝣'),
            ('qú', '䟊'), ('qú', '㜹'), ('qú', '䂂')]
    qu_3 = [('qǔ', '取'), ('qǔ', '娶'), ('qǔ', '苣'), ('qǔ', '竘'), ('qǔ', '詓'), ('qǔ', '竬'), ('qǔ', '蝺'), ('qǔ', '龋'),
            ('qǔ', '齲'), ('qǔ', '䢗'), ('qǔ', '䌌'), ('qǔ', '䶚')]
    qu_4 = [('qù', '去'), ('qù', '趣'), ('qù', '觑'), ('qù', '阒'), ('qù', '厺'), ('qù', '刞'), ('qù', '欪'), ('qù', '耝'),
            ('qù', '閴'), ('qù', '麮'), ('qù', '闃'), ('qù', '鼁'), ('qù', '覷'), ('qù', '覻'), ('qù', '䒧'), ('qù', '㧁'),
            ('qù', '㫢'), ('qù', '㰦'), ('qù', '䏣'), ('qù', '㤲'), ('qù', '䅓'), ('qù', '䁦'), ('qù', '䠐'), ('qù', '䠓'),
            ('qù', '㚁')]
    quan_1 = [('quān', '圈'), ('quān', '奍'), ('quān', '弮'), ('quān', '悛'), ('quān', '圏'), ('quān', '棬'), ('quān', '椦'),
              ('quān', '箞'), ('quān', '鐉')]
    quan_2 = [('quán', '全'), ('quán', '权'), ('quán', '拳'), ('quán', '泉'), ('quán', '痊'), ('quán', '铨'), ('quán', '蜷'),
              ('quán', '诠'), ('quán', '荃'), ('quán', '鬈'), ('quán', '颧'), ('quán', '筌'), ('quán', '騡'), ('quán', '佺'),
              ('quán', '狋'), ('quán', '姾'), ('quán', '峑'), ('quán', '恮'), ('quán', '洤'), ('quán', '牷'), ('quán', '辁'),
              ('quán', '啳'), ('quán', '埢'), ('quán', '婘'), ('quán', '惓'), ('quán', '捲'), ('quán', '硂'), ('quán', '湶'),
              ('quán', '犈'), ('quán', '絟'), ('quán', '葲'), ('quán', '搼'), ('quán', '楾'), ('quán', '瑔'), ('quán', '觠'),
              ('quán', '詮'), ('quán', '跧'), ('quán', '輇'), ('quán', '銓'), ('quán', '槫'), ('quán', '権'), ('quán', '踡'),
              ('quán', '縓'), ('quán', '醛'), ('quán', '駩'), ('quán', '闎'), ('quán', '鳈'), ('quán', '孉'), ('quán', '巏'),
              ('quán', '鰁'), ('quán', '權'), ('quán', '齤'), ('quán', '矔'), ('quán', '蠸'), ('quán', '顴'), ('quán', '灥'),
              ('quán', '㒰'), ('quán', '䀬'), ('quán', '㟨'), ('quán', '㟫'), ('quán', '㩲'), ('quán', '䑏'), ('quán', '䌯'),
              ('quán', '䟒'), ('quán', '䠰')]
    quan_3 = [('quǎn', '犬'), ('quǎn', '犭'), ('quǎn', '绻'), ('quǎn', '犮'), ('quǎn', '畎'), ('quǎn', '烇'), ('quǎn', '綣'),
              ('quǎn', '虇'), ('quǎn', '䅚'), ('quǎn', '䊎')]
    quan_4 = [('quàn', '劝'), ('quàn', '券'), ('quàn', '牶'), ('quàn', '勧'), ('quàn', '韏'), ('quàn', '勸'), ('quàn', '䄐')]
    que_1 = [('quē', '缺'), ('quē', '阙'), ('quē', '炔'), ('quē', '缼'), ('quē', '蚗'), ('quē', '蒛')]
    que_2 = [('qué', '瘸')]
    que_3 = [('què', '却'), ('què', '确'), ('què', '雀'), ('què', '鹊'), ('què', '阕'), ('què', '悫'), ('què', '傕'),
             ('què', '榷'), ('què', '汋'), ('què', '卻'), ('què', '埆'), ('què', '崅'), ('què', '琷'), ('què', '敠'),
             ('què', '敪'), ('què', '棤'), ('què', '硞'), ('què', '塙'), ('què', '搉'), ('què', '皵'), ('què', '碏'),
             ('què', '愨'), ('què', '墧'), ('què', '慤'), ('què', '確'), ('què', '碻'), ('què', '趞'), ('què', '燩'),
             ('què', '闋'), ('què', '礐'), ('què', '闕'), ('què', '鵲'), ('què', '礭'), ('què', '㕁'), ('què', '㹤'),
             ('què', '㱿'), ('què', '㹱'), ('què', '㾡'), ('què', '㴶'), ('què', '䇎'), ('què', '㩁'), ('què', '䍳'),
             ('què', '䢧'), ('què', '䲵'), ('què', '䀇'), ('què', '䧿'), ('què', '㲉'), ('què', '䦬'), ('què', '䱜'),
             ('què', '㰌'), ('què', '㱋')]
    qun_1 = [('qūn', '逡'), ('qūn', '夋'), ('qūn', '囷'), ('qūn', '箘'), ('qūn', '歏'), ('qūn', '䞭')]
    qun_2 = [('qún', '群'), ('qún', '裙'), ('qún', '宭'), ('qún', '峮'), ('qún', '帬'), ('qún', '羣'), ('qún', '裠'),
             ('qún', '麇'), ('qún', '㪊'), ('qún', '䭽'), ('qún', '㿏'), ('qún', '䆽')]
    qun_3 = []
    ran_1 = [('rán', '然'), ('rán', '燃'), ('rán', '髯'), ('rán', '呥'), ('rán', '肰'), ('rán', '衻'), ('rán', '袇'),
             ('rán', '蚦'), ('rán', '袡'), ('rán', '蚺'), ('rán', '髥'), ('rán', '嘫'), ('rán', '繎'), ('rán', '㾆'),
             ('rán', '䑙'), ('rán', '㜣'), ('rán', '䔳'), ('rán', '䫇'), ('rán', '㲯'), ('rán', '䶲'), ('rán', '䕼'),
             ('rán', '㸐'), ('rán', '䰯'), ('rán', '䳿'), ('rán', '䖄')]
    ran_2 = [('rǎn', '染'), ('rǎn', '冉'), ('rǎn', '苒'), ('rǎn', '冄'), ('rǎn', '姌'), ('rǎn', '珃'), ('rǎn', '媣'),
             ('rǎn', '蒅'), ('rǎn', '熯'), ('rǎn', '橪'), ('rǎn', '㚩'), ('rǎn', '䒣'), ('rǎn', '㹱'), ('rǎn', '䇋'),
             ('rǎn', '䎃'), ('rǎn', '䣸'), ('rǎn', '䤡'), ('rǎn', '㒄'), ('rǎn', '㿵'), ('rǎn', '㯗')]
    ran_3 = []
    rang_1 = [('ráng', '禳'), ('ráng', '穰'), ('ráng', '穣'), ('ráng', '儴'), ('ráng', '勷'), ('ráng', '瀼'), ('ráng', '獽'),
              ('ráng', '蘘'), ('ráng', '瓤'), ('ráng', '躟'), ('ráng', '鬤'), ('ráng', '䉴'), ('ráng', '㚂')]
    rang_2 = [('rǎng', '嚷'), ('rǎng', '壤'), ('rǎng', '攘'), ('rǎng', '壌'), ('rǎng', '爙'), ('rǎng', '纕'), ('rǎng', '䑋')]
    rang_3 = [('ràng', '让'), ('ràng', '懹'), ('ràng', '譲'), ('ràng', '讓')]
    rao_1 = [('ráo', '饶'), ('ráo', '娆'), ('ráo', '桡'), ('ráo', '荛'), ('ráo', '嬈'), ('ráo', '蕘'), ('ráo', '橈'),
             ('ráo', '襓'), ('ráo', '饒'), ('ráo', '䫞'), ('ráo', '㹛')]
    rao_2 = [('rǎo', '扰'), ('rǎo', '隢'), ('rǎo', '擾'), ('rǎo', '㑱')]
    rao_3 = [('rào', '绕'), ('rào', '遶'), ('rào', '穘'), ('rào', '繞')]
    re_1 = [('ré', '捼')]
    re_2 = [('rě', '若'), ('rě', '惹'), ('rě', '喏')]
    re_3 = [('rè', '热'), ('rè', '渃'), ('rè', '熱'), ('rè', '㻰')]
    ren_1 = [('rén', '人'), ('rén', '仁'), ('rén', '壬'), ('rén', '亻'), ('rén', '忈'), ('rén', '朲'), ('rén', '忎'),
             ('rén', '秂'), ('rén', '芢'), ('rén', '魜'), ('rén', '銋'), ('rén', '鵀'), ('rén', '䚾'), ('rén', '䌾'),
             ('rén', '䛘'), ('rén', '䴦')]
    ren_2 = [('rěn', '忍'), ('rěn', '荏'), ('rěn', '稔'), ('rěn', '栠'), ('rěn', '栣'), ('rěn', '荵'), ('rěn', '秹'),
             ('rěn', '菍'), ('rěn', '棯'), ('rěn', '綛'), ('rěn', '躵'), ('rěn', '㣼'), ('rěn', '㲽'), ('rěn', '䏕'),
             ('rěn', '䏰'), ('rěn', '䄒'), ('rěn', '䭃')]
    ren_3 = [('rèn', '任'), ('rèn', '认'), ('rèn', '刃'), ('rèn', '韧'), ('rèn', '仞'), ('rèn', '纫'), ('rèn', '妊'),
             ('rèn', '饪'), ('rèn', '衽'), ('rèn', '刄'), ('rèn', '仭'), ('rèn', '讱'), ('rèn', '屻'), ('rèn', '岃'),
             ('rèn', '扨'), ('rèn', '杒'), ('rèn', '牣'), ('rèn', '纴'), ('rèn', '肕'), ('rèn', '轫'), ('rèn', '祍'),
             ('rèn', '姙'), ('rèn', '紉'), ('rèn', '紝'), ('rèn', '訒'), ('rèn', '軔'), ('rèn', '梕'), ('rèn', '袵'),
             ('rèn', '釰'), ('rèn', '釼'), ('rèn', '絍'), ('rèn', '腍'), ('rèn', '鈓'), ('rèn', '靭'), ('rèn', '靱'),
             ('rèn', '韌'), ('rèn', '飪'), ('rèn', '認'), ('rèn', '餁'), ('rèn', '㠴'), ('rèn', '䀔'), ('rèn', '㤛'),
             ('rèn', '㶵'), ('rèn', '㸾'), ('rèn', '䀼'), ('rèn', '䇮'), ('rèn', '䋕')]
    reng_1 = [('rēng', '扔')]
    reng_2 = [('réng', '仍'), ('réng', '辸'), ('réng', '礽'), ('réng', '芿'), ('réng', '陾'), ('réng', '㭁'), ('réng', '䄧'),
              ('réng', '㺱'), ('réng', '䚮')]
    ri_1 = [('rì', '日'), ('rì', '驲'), ('rì', '囸'), ('rì', '氜'), ('rì', '衵'), ('rì', '釰'), ('rì', '釼'), ('rì', '鈤'),
            ('rì', '馹'), ('rì', '䒤')]
    rong_1 = [('róng', '容'), ('róng', '荣'), ('róng', '融'), ('róng', '蓉'), ('róng', '绒'), ('róng', '戎'), ('róng', '溶'),
              ('róng', '镕'), ('róng', '茸'), ('róng', '熔'), ('róng', '榕'), ('róng', '嵘'), ('róng', '肜'), ('róng', '栄'),
              ('róng', '狨'), ('róng', '茙'), ('róng', '峵'), ('róng', '毧'), ('róng', '烿'), ('róng', '傛'), ('róng', '媶'),
              ('róng', '搑'), ('róng', '絨'), ('róng', '羢'), ('róng', '嫆'), ('róng', '嵤'), ('róng', '搈'), ('róng', '榵'),
              ('róng', '榮'), ('róng', '瑢'), ('róng', '穁'), ('róng', '槦'), ('róng', '縙'), ('róng', '蝾'), ('róng', '褣'),
              ('róng', '螎'), ('róng', '駥'), ('róng', '嬫'), ('róng', '嶸'), ('róng', '爃'), ('róng', '鎔'), ('róng', '瀜'),
              ('róng', '曧'), ('róng', '蠑'), ('róng', '㝐'), ('róng', '㭜'), ('róng', '㲓'), ('róng', '䘬'), ('róng', '䡆'),
              ('róng', '䇯'), ('róng', '㲨'), ('róng', '㣑'), ('róng', '㺎'), ('róng', '㼸'), ('róng', '䈶'), ('róng', '䠜'),
              ('róng', '䤊'), ('róng', '㘇'), ('róng', '䡥'), ('róng', '䩸'), ('róng', '䇀')]
    rong_2 = [('rǒng', '冗'), ('rǒng', '宂'), ('rǒng', '坈'), ('rǒng', '傇'), ('rǒng', '軵'), ('rǒng', '氄'), ('rǒng', '䄧'),
              ('rǒng', '㲝'), ('rǒng', '䋴'), ('rǒng', '䢇')]
    rong_3 = [('ròng', '穃')]
    rou_1 = [('róu', '柔'), ('róu', '揉'), ('róu', '蹂'), ('róu', '厹'), ('róu', '禸'), ('róu', '粈'), ('róu', '脜'),
             ('róu', '媃'), ('róu', '渘'), ('róu', '葇'), ('róu', '楺'), ('róu', '煣'), ('róu', '瑈'), ('róu', '腬'),
             ('róu', '糅'), ('róu', '蝚'), ('róu', '輮'), ('róu', '鍒'), ('róu', '鞣'), ('róu', '瓇'), ('róu', '騥'),
             ('róu', '鰇'), ('róu', '鶔'), ('róu', '㖻'), ('róu', '䐓'), ('róu', '䧷'), ('róu', '㽥'), ('róu', '䋴'),
             ('róu', '䰆')]
    rou_2 = [('rǒu', '韖'), ('rǒu', '䢇')]
    rou_3 = [('ròu', '肉'), ('ròu', '宍'), ('ròu', '譳'), ('ròu', '䄾'), ('ròu', '㮟'), ('ròu', '䥆')]
    ru_1 = [('rū', '嶿')]
    ru_2 = [('rú', '如'), ('rú', '儒'), ('rú', '茹'), ('rú', '孺'), ('rú', '嚅'), ('rú', '濡'), ('rú', '蠕'), ('rú', '襦'),
            ('rú', '邚'), ('rú', '吺'), ('rú', '侞'), ('rú', '帤'), ('rú', '挐'), ('rú', '桇'), ('rú', '袽'), ('rú', '铷'),
            ('rú', '渪'), ('rú', '筎'), ('rú', '蒘'), ('rú', '銣'), ('rú', '蕠'), ('rú', '蝡'), ('rú', '鴑'), ('rú', '嬬'),
            ('rú', '獳'), ('rú', '薷'), ('rú', '鴽'), ('rú', '曘'), ('rú', '檽'), ('rú', '繻'), ('rú', '颥'), ('rú', '醹'),
            ('rú', '顬'), ('rú', '鱬'), ('rú', '㾒'), ('rú', '䋈'), ('rú', '㨌'), ('rú', '㨎'), ('rú', '䘫'), ('rú', '䤉'),
            ('rú', '㹘'), ('rú', '䞕'), ('rú', '䫱'), ('rú', '䰭'), ('rú', '䰰')]
    ru_3 = [('rǔ', '女'), ('rǔ', '汝'), ('rǔ', '辱'), ('rǔ', '乳'), ('rǔ', '肗'), ('rǔ', '鄏'), ('rǔ', '擩'), ('rǔ', '㼋'),
            ('rǔ', '㦺'), ('rǔ', '䋴')]
    ru_4 = [('rù', '入'), ('rù', '褥'), ('rù', '缛'), ('rù', '扖'), ('rù', '杁'), ('rù', '洳'), ('rù', '嗕'), ('rù', '媷'),
            ('rù', '溽'), ('rù', '蓐'), ('rù', '鳰'), ('rù', '縟'), ('rù', '㐈'), ('rù', '䐓'), ('rù', '㱶')]
    ruan_1 = [('ruán', '堧'), ('ruán', '撋'), ('ruán', '壖'), ('ruán', '㨎'), ('ruán', '䓴'), ('ruán', '䙃'), ('ruán', '䙇')]
    ruan_2 = [('ruǎn', '软'), ('ruǎn', '阮'), ('ruǎn', '朊'), ('ruǎn', '耎'), ('ruǎn', '偄'), ('ruǎn', '軟'), ('ruǎn', '媆'),
              ('ruǎn', '瑌'), ('ruǎn', '腝'), ('ruǎn', '碝'), ('ruǎn', '緛'), ('ruǎn', '輭'), ('ruǎn', '檽'), ('ruǎn', '瓀'),
              ('ruǎn', '礝'), ('ruǎn', '㐾'), ('ruǎn', '䆓'), ('ruǎn', '䎡'), ('ruǎn', '㓴'), ('ruǎn', '㮕'), ('ruǎn', '㼱'),
              ('ruǎn', '㜛'), ('ruǎn', '䞂'), ('ruǎn', '䪭'), ('ruǎn', '㽭'), ('ruǎn', '䪀')]
    ruan_3 = []
    rui_1 = [('ruí', '蕤'), ('ruí', '苼'), ('ruí', '桵'), ('ruí', '甤'), ('ruí', '緌'), ('ruí', '㮃'), ('ruí', '䅑'),
             ('ruí', '䞩'), ('ruí', '䍴'), ('ruí', '㹘')]
    rui_2 = [('ruǐ', '蕊'), ('ruǐ', '惢'), ('ruǐ', '蕋'), ('ruǐ', '橤'), ('ruǐ', '繠'), ('ruǐ', '壡'), ('ruǐ', '蘂'),
             ('ruǐ', '蘃')]
    rui_3 = [('ruì', '瑞'), ('ruì', '锐'), ('ruì', '兑'), ('ruì', '芮'), ('ruì', '睿'), ('ruì', '兊'), ('ruì', '兌'),
             ('ruì', '抐'), ('ruì', '汭'), ('ruì', '枘'), ('ruì', '笍'), ('ruì', '蚋'), ('ruì', '蜹'), ('ruì', '銳'),
             ('ruì', '鋭'), ('ruì', '叡'), ('ruì', '鏸'), ('ruì', '㨅'), ('ruì', '䌼'), ('ruì', '䇤'), ('ruì', '䦌'),
             ('ruì', '㓹'), ('ruì', '㛱'), ('ruì', '㻔'), ('ruì', '䂱'), ('ruì', '䓲'), ('ruì', '㕙'), ('ruì', '㪫'),
             ('ruì', '㲊'), ('ruì', '䳠')]
    run_1 = [('rún', '瞤')]
    run_2 = []
    run_3 = [('rùn', '润'), ('rùn', '闰'), ('rùn', '閏'), ('rùn', '閠'), ('rùn', '潤'), ('rùn', '橍'), ('rùn', '膶'),
             ('rùn', '䏕'), ('rùn', '㝄'), ('rùn', '㠈'), ('rùn', '䦞')]
    ruo_1 = [('ruó', '挼'), ('ruó', '捼')]
    ruo_2 = [('ruò', '若'), ('ruò', '弱'), ('ruò', '偌'), ('ruò', '箬'), ('ruò', '叒'), ('ruò', '鄀'), ('ruò', '婼'),
             ('ruò', '渃'), ('ruò', '焫'), ('ruò', '楉'), ('ruò', '嵶'), ('ruò', '蒻'), ('ruò', '篛'), ('ruò', '爇'),
             ('ruò', '鰙'), ('ruò', '鰯'), ('ruò', '鶸'), ('ruò', '㬉'), ('ruò', '䐞'), ('ruò', '㘃')]
    sa_1 = [('sā', '撒'), ('sā', '仨')]
    sa_2 = [('sǎ', '洒'), ('sǎ', '訯'), ('sǎ', '靸'), ('sǎ', '潵'), ('sǎ', '鞈'), ('sǎ', '攃'), ('sǎ', '灑'), ('sǎ', '躠'),
            ('sǎ', '纚'), ('sǎ', '㒎'), ('sǎ', '䊛')]
    sa_3 = [('sà', '萨'), ('sà', '飒'), ('sà', '卅'), ('sà', '泧'), ('sà', '钑'), ('sà', '脎'), ('sà', '鈒'), ('sà', '摋'),
            ('sà', '隡'), ('sà', '馺'), ('sà', '蕯'), ('sà', '颯'), ('sà', '薩'), ('sà', '櫒'), ('sà', '鏾'), ('sà', '㳐'),
            ('sà', '䑥'), ('sà', '䘮'), ('sà', '䓲'), ('sà', '䬃'), ('sà', '㪪'), ('sà', '㽂'), ('sà', '䙣')]
    sa_4 = []
    sai_1 = [('sāi', '思'), ('sāi', '塞'), ('sāi', '腮'), ('sāi', '毢'), ('sāi', '愢'), ('sāi', '揌'), ('sāi', '毸'),
             ('sāi', '嘥'), ('sāi', '噻'), ('sāi', '鳃'), ('sāi', '顋'), ('sāi', '鰓'), ('sāi', '䚡')]
    sai_2 = [('sǎi', '嗮'), ('sǎi', '䈢'), ('sǎi', '㗷'), ('sǎi', '㘔')]
    sai_3 = [('sài', '赛'), ('sài', '僿'), ('sài', '賽'), ('sài', '簺')]
    san_1 = [('sān', '三'), ('sān', '参'), ('sān', '叁'), ('sān', '弎'), ('sān', '參'), ('sān', '叄'), ('sān', '叅'),
             ('sān', '毵'), ('sān', '毶'), ('sān', '厁'), ('sān', '毿'), ('sān', '犙'), ('sān', '鬖')]
    san_2 = [('sǎn', '伞'), ('sǎn', '仐'), ('sǎn', '傘'), ('sǎn', '糁'), ('sǎn', '馓'), ('sǎn', '糝'), ('sǎn', '糣'),
             ('sǎn', '糤'), ('sǎn', '繖'), ('sǎn', '鏒'), ('sǎn', '鏾'), ('sǎn', '饊'), ('sǎn', '䀐'), ('sǎn', '㧲'),
             ('sǎn', '䊉'), ('sǎn', '䉈'), ('sǎn', '䫩')]
    san_3 = [('sàn', '散'), ('sàn', '俕'), ('sàn', '帴'), ('sàn', '閐'), ('sàn', '潵'), ('sàn', '㤾'), ('sàn', '㪔'),
             ('sàn', '㪚'), ('sàn', '䫅')]
    san_4 = [('san', '壭')]
    sang_1 = [('sāng', '丧'), ('sāng', '桑'), ('sāng', '桒'), ('sāng', '喪'), ('sāng', '槡')]
    sang_2 = [('sǎng', '嗓'), ('sǎng', '搡'), ('sǎng', '颡'), ('sǎng', '磉'), ('sǎng', '褬'), ('sǎng', '鎟'), ('sǎng', '顙'),
              ('sǎng', '䡦'), ('sǎng', '䫙')]
    sang_3 = [('sàng', '䘮')]
    sao_1 = [('sāo', '骚'), ('sāo', '搔'), ('sāo', '臊'), ('sāo', '缫'), ('sāo', '掻'), ('sāo', '慅'), ('sāo', '溞'),
             ('sāo', '懆'), ('sāo', '缲'), ('sāo', '螦'), ('sāo', '繅'), ('sāo', '鳋'), ('sāo', '颾'), ('sāo', '騒'),
             ('sāo', '繰'), ('sāo', '騷'), ('sāo', '鰠'), ('sāo', '鱢')]
    sao_2 = [('sǎo', '扫'), ('sǎo', '嫂'), ('sǎo', '掃'), ('sǎo', '㛐'), ('sǎo', '㛮'), ('sǎo', '䕅')]
    sao_3 = [('sào', '梢'), ('sào', '埽'), ('sào', '瘙'), ('sào', '氉'), ('sào', '矂'), ('sào', '髞'), ('sào', '䐹'),
             ('sào', '㿋')]
    se_1 = [('sē', '閪')]
    se_2 = [('sè', '色'), ('sè', '塞'), ('sè', '瑟'), ('sè', '涩'), ('sè', '啬'), ('sè', '穑'), ('sè', '拺'), ('sè', '洓'),
            ('sè', '栜'), ('sè', '渋'), ('sè', '粣'), ('sè', '铯'), ('sè', '雭'), ('sè', '歮'), ('sè', '琗'), ('sè', '嗇'),
            ('sè', '摵'), ('sè', '歰'), ('sè', '銫'), ('sè', '槭'), ('sè', '澁'), ('sè', '廧'), ('sè', '懎'), ('sè', '擌'),
            ('sè', '濇'), ('sè', '濏'), ('sè', '瘷'), ('sè', '薔'), ('sè', '澀'), ('sè', '璱'), ('sè', '瀒'), ('sè', '穡'),
            ('sè', '鎍'), ('sè', '繬'), ('sè', '穯'), ('sè', '轖'), ('sè', '鏼'), ('sè', '闟'), ('sè', '譅'), ('sè', '飋'),
            ('sè', '㺩'), ('sè', '㻎'), ('sè', '㴔'), ('sè', '䊂'), ('sè', '㥶'), ('sè', '㮦'), ('sè', '㻭'), ('sè', '䔼'),
            ('sè', '㒊'), ('sè', '䨛'), ('sè', '㱇'), ('sè', '㽇'), ('sè', '䉢')]
    sen_1 = [('sēn', '森'), ('sēn', '椮'), ('sēn', '槮'), ('sēn', '襂')]
    sen_2 = []
    seng_1 = [('sēng', '僧'), ('sēng', '鬙'), ('sēng', '兼')]
    seng_2 = []
    sha_1 = [('shā', '杀'), ('shā', '沙'), ('shā', '莎'), ('shā', '纱'), ('shā', '煞'), ('shā', '刹'), ('shā', '砂'),
             ('shā', '杉'), ('shā', '裟'), ('shā', '鲨'), ('shā', '挲'), ('shā', '铩'), ('shā', '痧'), ('shā', '乷'),
             ('shā', '剎'), ('shā', '唦'), ('shā', '挱'), ('shā', '殺'), ('shā', '猀'), ('shā', '粆'), ('shā', '紗'),
             ('shā', '桬'), ('shā', '毮'), ('shā', '硰'), ('shā', '摋'), ('shā', '蔱'), ('shā', '榝'), ('shā', '樧'),
             ('shā', '魦'), ('shā', '閷'), ('shā', '髿'), ('shā', '鎩'), ('shā', '鯊'), ('shā', '鯋'), ('shā', '繺'),
             ('shā', '㲚'), ('shā', '㸺')]
    sha_2 = [('shá', '啥')]
    sha_3 = [('shǎ', '傻'), ('shǎ', '儍')]
    sha_4 = [('shà', '厦'), ('shà', '霎'), ('shà', '嗄'), ('shà', '倽'), ('shà', '唼'), ('shà', '啑'), ('shà', '帹'),
             ('shà', '菨'), ('shà', '萐'), ('shà', '喢'), ('shà', '廈'), ('shà', '歃'), ('shà', '翜'), ('shà', '歰'),
             ('shà', '箑'), ('shà', '翣'), ('shà', '濈'), ('shà', '閯'), ('shà', '㚫'), ('shà', '㰱'), ('shà', '㛼'),
             ('shà', '䈉'), ('shà', '䝊'), ('shà', '㵤'), ('shà', '䬊'), ('shà', '䀉'), ('shà', '䮜'), ('shà', '䶎'),
             ('shà', '䵘'), ('shà', '䯫')]
    shai_1 = [('shāi', '筛'), ('shāi', '篩'), ('shāi', '諰'), ('shāi', '簁'), ('shāi', '簛'), ('shāi', '籭'), ('shāi', '㩄')]
    shai_2 = [('shǎi', '摋')]
    shai_3 = [('shài', '晒'), ('shài', '攦'), ('shài', '曬'), ('shài', '㬠'), ('shài', '䵘')]
    shan_1 = [('shān', '山'), ('shān', '衫'), ('shān', '珊'), ('shān', '删'), ('shān', '栅'), ('shān', '姗'), ('shān', '杉'),
              ('shān', '煽'), ('shān', '跚'), ('shān', '潸'), ('shān', '苫'), ('shān', '舢'), ('shān', '搧'), ('shān', '膻'),
              ('shān', '彡'), ('shān', '邖'), ('shān', '圸'), ('shān', '刪'), ('shān', '芟'), ('shān', '姍'), ('shān', '钐'),
              ('shān', '埏'), ('shān', '挻'), ('shān', '柵'), ('shān', '狦'), ('shān', '痁'), ('shān', '脠'), ('shān', '軕'),
              ('shān', '笘'), ('shān', '釤'), ('shān', '閊'), ('shān', '傓'), ('shān', '剼'), ('shān', '嘇'), ('shān', '幓'),
              ('shān', '澘'), ('shān', '穇'), ('shān', '檆'), ('shān', '縿'), ('shān', '鯅'), ('shān', '羴'), ('shān', '羶'),
              ('shān', '䘰')]
    shan_2 = []
    shan_3 = [('shǎn', '闪'), ('shǎn', '陕'), ('shǎn', '掺'), ('shǎn', '炶'), ('shǎn', '陝'), ('shǎn', '閃'), ('shǎn', '閄'),
              ('shǎn', '晱'), ('shǎn', '煔'), ('shǎn', '睒'), ('shǎn', '摻'), ('shǎn', '熌'), ('shǎn', '覢'), ('shǎn', '㚒'),
              ('shǎn', '㣣'), ('shǎn', '㾆'), ('shǎn', '㪎'), ('shǎn', '㨛'), ('shǎn', '㴸'), ('shǎn', '㺑'), ('shǎn', '㨻'),
              ('shǎn', '䛸'), ('shǎn', '䗞'), ('shǎn', '䠾'), ('shǎn', '㬭'), ('shǎn', '㶒'), ('shǎn', '补')]
    shan_4 = [('shàn', '单'), ('shàn', '善'), ('shàn', '扇'), ('shàn', '禅'), ('shàn', '擅'), ('shàn', '膳'), ('shàn', '讪'),
              ('shàn', '汕'), ('shàn', '掸'), ('shàn', '赡'), ('shàn', '缮'), ('shàn', '剡'), ('shàn', '嬗'), ('shàn', '蟮'),
              ('shàn', '鳝'), ('shàn', '疝'), ('shàn', '訕'), ('shàn', '赸'), ('shàn', '掞'), ('shàn', '單'), ('shàn', '椫'),
              ('shàn', '銏'), ('shàn', '骟'), ('shàn', '僐'), ('shàn', '鄯'), ('shàn', '儃'), ('shàn', '墠'), ('shàn', '墡'),
              ('shàn', '撣'), ('shàn', '潬'), ('shàn', '嶦'), ('shàn', '敾'), ('shàn', '樿'), ('shàn', '歚'), ('shàn', '禪'),
              ('shàn', '磰'), ('shàn', '謆'), ('shàn', '繕'), ('shàn', '蟺'), ('shàn', '譱'), ('shàn', '贍'), ('shàn', '鐥'),
              ('shàn', '饍'), ('shàn', '騸'), ('shàn', '鳣'), ('shàn', '灗'), ('shàn', '鱓'), ('shàn', '鱔'), ('shàn', '㚲'),
              ('shàn', '㣌'), ('shàn', '㱚'), ('shàn', '䚲'), ('shàn', '㹽'), ('shàn', '䴮'), ('shàn', '䦂'), ('shàn', '㪨'),
              ('shàn', '䱇'), ('shàn', '䱉'), ('shàn', '䄠'), ('shàn', '䡪'), ('shàn', '䦅'), ('shàn', '䆄'), ('shàn', '䥇')]
    shang_1 = [('shāng', '伤'), ('shāng', '商'), ('shāng', '汤'), ('shāng', '觞'), ('shāng', '熵'), ('shāng', '殇'),
               ('shāng', '墒'), ('shāng', '愓'), ('shāng', '湯'), ('shāng', '傷'), ('shāng', '禓'), ('shāng', '慯'),
               ('shāng', '滳'), ('shāng', '漡'), ('shāng', '蔏'), ('shāng', '殤'), ('shāng', '螪'), ('shāng', '觴'),
               ('shāng', '謪'), ('shāng', '鬺')]
    shang_2 = [('shǎng', '赏'), ('shǎng', '晌'), ('shǎng', '垧'), ('shǎng', '扄'), ('shǎng', '埫'), ('shǎng', '樉'),
               ('shǎng', '賞'), ('shǎng', '鋿'), ('shǎng', '鏛'), ('shǎng', '贘'), ('shǎng', '鑜'), ('shǎng', '䬕')]
    shang_3 = [('shàng', '上'), ('shàng', '尚'), ('shàng', '丄'), ('shàng', '尙'), ('shàng', '恦'), ('shàng', '绱'),
               ('shàng', '緔'), ('shàng', '鞝')]
    shang_4 = [('shang', '裳')]
    shao_1 = [('shāo', '烧'), ('shāo', '稍'), ('shāo', '梢'), ('shāo', '鞘'), ('shāo', '捎'), ('shāo', '艄'), ('shāo', '弰'),
              ('shāo', '莦'), ('shāo', '焼'), ('shāo', '萷'), ('shāo', '旓'), ('shāo', '筲'), ('shāo', '輎'), ('shāo', '蕱'),
              ('shāo', '燒'), ('shāo', '髾'), ('shāo', '鮹'), ('shāo', '䘯'), ('shāo', '䈰'), ('shāo', '䈾')]
    shao_2 = [('sháo', '韶'), ('sháo', '勺'), ('sháo', '芍'), ('sháo', '杓'), ('sháo', '苕'), ('sháo', '柖'), ('sháo', '玿'),
              ('sháo', '㸛'), ('sháo', '㲈')]
    shao_3 = [('shǎo', '少'), ('shǎo', '䒚'), ('shǎo', '㪢'), ('shǎo', '䔠')]
    shao_4 = [('shào', '绍'), ('shào', '召'), ('shào', '邵'), ('shào', '哨'), ('shào', '劭'), ('shào', '佋'), ('shào', '卲'),
              ('shào', '娋'), ('shào', '袑'), ('shào', '紹'), ('shào', '睄'), ('shào', '綤'), ('shào', '潲'), ('shào', '䏴'),
              ('shào', '䙼'), ('shào', '䬰'), ('shào', '㷹')]
    she_1 = [('shē', '奢'), ('shē', '赊'), ('shē', '奓'), ('shē', '猞'), ('shē', '畬'), ('shē', '畭'), ('shē', '畲'),
             ('shē', '輋'), ('shē', '賒'), ('shē', '賖'), ('shē', '檨')]
    she_2 = [('shé', '折'), ('shé', '蛇'), ('shé', '舌'), ('shé', '佘'), ('shé', '虵'), ('shé', '阇'), ('shé', '揲'),
             ('shé', '蛥'), ('shé', '闍'), ('shé', '磼'), ('shé', '㪿'), ('shé', '㭙'), ('shé', '䂠'), ('shé', '䞌'),
             ('shé', '㵃'), ('shé', '䁋'), ('shé', '䕣'), ('shé', '䜆'), ('shé', '㰒')]
    she_3 = [('shě', '舍'), ('shě', '捨'), ('shě', '䬷')]
    she_4 = [('shè', '设'), ('shè', '社'), ('shè', '射'), ('shè', '拾'), ('shè', '涉'), ('shè', '摄'), ('shè', '赦'),
             ('shè', '慑'), ('shè', '麝'), ('shè', '歙'), ('shè', '厍'), ('shè', '泏'), ('shè', '舎'), ('shè', '厙'),
             ('shè', '挕'), ('shè', '涻'), ('shè', '渉'), ('shè', '設'), ('shè', '弽'), ('shè', '摂'), ('shè', '滠'),
             ('shè', '慴'), ('shè', '蔎'), ('shè', '蠂'), ('shè', '韘'), ('shè', '騇'), ('shè', '懾'), ('shè', '攝'),
             ('shè', '灄'), ('shè', '欇'), ('shè', '㢵'), ('shè', '㴇'), ('shè', '䏴'), ('shè', '䀅'), ('shè', '䀹'),
             ('shè', '䠶'), ('shè', '䄕'), ('shè', '䤮'), ('shè', '䤁'), ('shè', '䁯'), ('shè', '䰥'), ('shè', '䠟'),
             ('shè', '䵥'), ('shè', '䜓'), ('shè', '㒤'), ('shè', '䌰')]
    shen_1 = [('shēn', '身'), ('shēn', '信'), ('shēn', '深'), ('shēn', '参'), ('shēn', '伸'), ('shēn', '申'), ('shēn', '绅'),
              ('shēn', '呻'), ('shēn', '莘'), ('shēn', '诜'), ('shēn', '娠'), ('shēn', '屾'), ('shēn', '扟'), ('shēn', '侁'),
              ('shēn', '冞'), ('shēn', '妽'), ('shēn', '籶'), ('shēn', '罙'), ('shēn', '姺'), ('shēn', '柛'), ('shēn', '氠'),
              ('shēn', '珅'), ('shēn', '穼'), ('shēn', '籸'), ('shēn', '峷'), ('shēn', '甡'), ('shēn', '眒'), ('shēn', '砷'),
              ('shēn', '參'), ('shēn', '叄'), ('shēn', '堔'), ('shēn', '敒'), ('shēn', '紳'), ('shēn', '兟'), ('shēn', '叅'),
              ('shēn', '棽'), ('shēn', '葠'), ('shēn', '裑'), ('shēn', '訷'), ('shēn', '嫀'), ('shēn', '搷'), ('shēn', '罧'),
              ('shēn', '蓡'), ('shēn', '詵'), ('shēn', '幓'), ('shēn', '甧'), ('shēn', '糁'), ('shēn', '蔘'), ('shēn', '糂'),
              ('shēn', '燊'), ('shēn', '薓'), ('shēn', '駪'), ('shēn', '鲹'), ('shēn', '曑'), ('shēn', '糝'), ('shēn', '糣'),
              ('shēn', '鯓'), ('shēn', '鵢'), ('shēn', '鯵'), ('shēn', '鰺'), ('shēn', '㑗'), ('shēn', '䯂')]
    shen_2 = [('shén', '什'), ('shén', '神'), ('shén', '榊'), ('shén', '鉮'), ('shén', '鰰'), ('shén', '䰠')]
    shen_3 = [('shěn', '沈'), ('shěn', '审'), ('shěn', '婶'), ('shěn', '哂'), ('shěn', '邥'), ('shěn', '吲'), ('shěn', '弞'),
              ('shěn', '抌'), ('shěn', '矤'), ('shěn', '矧'), ('shěn', '宷'), ('shěn', '谂'), ('shěn', '谉'), ('shěn', '淰'),
              ('shěn', '渖'), ('shěn', '訠'), ('shěn', '棯'), ('shěn', '審'), ('shěn', '諗'), ('shěn', '頣'), ('shěn', '魫'),
              ('shěn', '曋'), ('shěn', '瞫'), ('shěn', '嬸'), ('shěn', '瀋'), ('shěn', '覾'), ('shěn', '讅'), ('shěn', '㛙'),
              ('shěn', '㚞'), ('shěn', '㾕'), ('shěn', '䧵'), ('shěn', '㜤'), ('shěn', '㵊'), ('shěn', '㔤'), ('shěn', '㰂'),
              ('shěn', '䚓'), ('shěn', '㶒')]
    shen_4 = [('shèn', '甚'), ('shèn', '慎'), ('shèn', '渗'), ('shèn', '肾'), ('shèn', '蜃'), ('shèn', '谌'), ('shèn', '侺'),
              ('shèn', '昚'), ('shèn', '胂'), ('shèn', '涁'), ('shèn', '眘'), ('shèn', '祳'), ('shèn', '脤'), ('shèn', '腎'),
              ('shèn', '葚'), ('shèn', '愼'), ('shèn', '椹'), ('shèn', '瘆'), ('shèn', '蜄'), ('shèn', '滲'), ('shèn', '鋠'),
              ('shèn', '瘮'), ('shèn', '黮'), ('shèn', '㰮'), ('shèn', '䄕'), ('shèn', '䆦'), ('shèn', '㥲'), ('shèn', '㵕'),
              ('shèn', '䫖')]
    sheng_1 = [('shēng', '生'), ('shēng', '声'), ('shēng', '升'), ('shēng', '牲'), ('shēng', '笙'), ('shēng', '甥'),
               ('shēng', '阩'), ('shēng', '呏'), ('shēng', '斘'), ('shēng', '昇'), ('shēng', '枡'), ('shēng', '泩'),
               ('shēng', '狌'), ('shēng', '苼'), ('shēng', '殅'), ('shēng', '珄'), ('shēng', '竔'), ('shēng', '陞'),
               ('shēng', '曻'), ('shēng', '陹'), ('shēng', '殸'), ('shēng', '湦'), ('shēng', '焺'), ('shēng', '鉎'),
               ('shēng', '聲'), ('shēng', '鍟'), ('shēng', '鼪'), ('shēng', '鵿')]
    sheng_2 = [('shéng', '绳'), ('shéng', '渑'), ('shéng', '憴'), ('shéng', '澠'), ('shéng', '縄'), ('shéng', '繉'),
               ('shéng', '繩'), ('shéng', '譝'), ('shéng', '䋲'), ('shéng', '䱆')]
    sheng_3 = [('shěng', '省'), ('shěng', '眚'), ('shěng', '偗'), ('shěng', '渻'), ('shěng', '㗂'), ('shěng', '㮐'),
               ('shěng', '㼳'), ('shěng', '㾪'), ('shěng', '䁞'), ('shěng', '䪿'), ('shěng', '䚇')]
    sheng_4 = [('shèng', '胜'), ('shèng', '圣'), ('shèng', '盛'), ('shèng', '乘'), ('shèng', '剩'), ('shèng', '甸'),
               ('shèng', '晟'), ('shèng', '乗'), ('shèng', '娍'), ('shèng', '晠'), ('shèng', '剰'), ('shèng', '勝'),
               ('shèng', '椉'), ('shèng', '貹'), ('shèng', '嵊'), ('shèng', '琞'), ('shèng', '聖'), ('shèng', '墭'),
               ('shèng', '榺'), ('shèng', '蕂'), ('shèng', '橳'), ('shèng', '賸'), ('shèng', '㞼'), ('shèng', '䎴'),
               ('shèng', '䇸'), ('shèng', '㹌'), ('shèng', '䞉')]
    shi_1 = [('shī', '师'), ('shī', '失'), ('shī', '施'), ('shī', '诗'), ('shī', '尸'), ('shī', '湿'), ('shī', '狮'),
             ('shī', '嘘'), ('shī', '虱'), ('shī', '蓍'), ('shī', '厔'), ('shī', '呞'), ('shī', '邿'), ('shī', '鸤'),
             ('shī', '屍'), ('shī', '浉'), ('shī', '師'), ('shī', '絁'), ('shī', '釶'), ('shī', '湤'), ('shī', '葹'),
             ('shī', '溮'), ('shī', '溼'), ('shī', '獅'), ('shī', '蒒'), ('shī', '詩'), ('shī', '鉇'), ('shī', '瑡'),
             ('shī', '酾'), ('shī', '鳲'), ('shī', '噓'), ('shī', '箷'), ('shī', '蝨'), ('shī', '鳾'), ('shī', '褷'),
             ('shī', '鲺'), ('shī', '濕'), ('shī', '鍦'), ('shī', '鯴'), ('shī', '鰤'), ('shī', '鶳'), ('shī', '襹'),
             ('shī', '釃'), ('shī', '䴓'), ('shī', '䙾'), ('shī', '䲩'), ('shī', '䗐'), ('shī', '䌳')]
    shi_2 = [('shí', '时'), ('shí', '实'), ('shí', '什'), ('shí', '十'), ('shí', '识'), ('shí', '石'), ('shí', '食'),
             ('shí', '拾'), ('shí', '硕'), ('shí', '蚀'), ('shí', '湜'), ('shí', '饣'), ('shí', '乭'), ('shí', '竍'),
             ('shí', '実'), ('shí', '旹'), ('shí', '飠'), ('shí', '姼'), ('shí', '峕'), ('shí', '炻'), ('shí', '祏'),
             ('shí', '埘'), ('shí', '宲'), ('shí', '時'), ('shí', '寔'), ('shí', '遈'), ('shí', '塒'), ('shí', '嵵'),
             ('shí', '溡'), ('shí', '鉐'), ('shí', '實'), ('shí', '榯'), ('shí', '碩'), ('shí', '蝕'), ('shí', '鲥'),
             ('shí', '鮖'), ('shí', '鼫'), ('shí', '識'), ('shí', '鼭'), ('shí', '鰣'), ('shí', '䦹'), ('shí', '㫑'),
             ('shí', '䂖'), ('shí', '㫅'), ('shí', '㫭'), ('shí', '䄷'), ('shí', '䖨'), ('shí', '㖷'), ('shí', '㵓'),
             ('shí', '䈕'), ('shí', '䲽'), ('shí', '䶡')]
    shi_3 = [('shǐ', '使'), ('shǐ', '始'), ('shǐ', '史'), ('shǐ', '驶'), ('shǐ', '矢'), ('shǐ', '屎'), ('shǐ', '豕'),
             ('shǐ', '乨'), ('shǐ', '兘'), ('shǐ', '宩'), ('shǐ', '狶'), ('shǐ', '痑'), ('shǐ', '笶'), ('shǐ', '榁'),
             ('shǐ', '鉂'), ('shǐ', '駛'), ('shǐ', '㕜'), ('shǐ', '䒨'), ('shǐ', '㹬'), ('shǐ', '㶴'), ('shǐ', '䂠'),
             ('shǐ', '㹷'), ('shǐ', '䦠'), ('shǐ', '䶵')]
    shi_4 = [('shì', '是'), ('shì', '事'), ('shì', '世'), ('shì', '式'), ('shì', '似'), ('shì', '市'), ('shì', '士'),
             ('shì', '示'), ('shì', '视'), ('shì', '势'), ('shì', '试'), ('shì', '室'), ('shì', '适'), ('shì', '氏'),
             ('shì', '释'), ('shì', '泽'), ('shì', '侍'), ('shì', '饰'), ('shì', '誓'), ('shì', '逝'), ('shì', '拭'),
             ('shì', '仕'), ('shì', '恃'), ('shì', '嗜'), ('shì', '噬'), ('shì', '峙'), ('shì', '柿'), ('shì', '耆'),
             ('shì', '舐'), ('shì', '轼'), ('shì', '谥'), ('shì', '筮'), ('shì', '螫'), ('shì', '埶'), ('shì', '畤'),
             ('shì', '弑'), ('shì', '礻'), ('shì', '丗'), ('shì', '卋'), ('shì', '忕'), ('shì', '亊'), ('shì', '忯'),
             ('shì', '戺'), ('shì', '呩'), ('shì', '柹'), ('shì', '冟'), ('shì', '咶'), ('shì', '恀'), ('shì', '昰'),
             ('shì', '枾'), ('shì', '狧'), ('shì', '眂'), ('shì', '贳'), ('shì', '栻'), ('shì', '烒'), ('shì', '眎'),
             ('shì', '眡'), ('shì', '莳'), ('shì', '铈'), ('shì', '啫'), ('shì', '秲'), ('shì', '視'), ('shì', '釈'),
             ('shì', '崻'), ('shì', '崼'), ('shì', '徥'), ('shì', '惿'), ('shì', '揓'), ('shì', '貰'), ('shì', '勢'),
             ('shì', '弒'), ('shì', '楴'), ('shì', '煶'), ('shì', '睗'), ('shì', '蒔'), ('shì', '觢'), ('shì', '試'),
             ('shì', '軾'), ('shì', '鈰'), ('shì', '鉃'), ('shì', '飾'), ('shì', '舓'), ('shì', '適'), ('shì', '鉽'),
             ('shì', '馶'), ('shì', '奭'), ('shì', '銴'), ('shì', '餙'), ('shì', '餝'), ('shì', '嬕'), ('shì', '澤'),
             ('shì', '澨'), ('shì', '諟'), ('shì', '諡'), ('shì', '遾'), ('shì', '檡'), ('shì', '謚'), ('shì', '簭'),
             ('shì', '襫'), ('shì', '醳'), ('shì', '釋'), ('shì', '鰘'), ('shì', '㐊'), ('shì', '㔺'), ('shì', '㹝'),
             ('shì', '㳏'), ('shì', '䏡'), ('shì', '㸷'), ('shì', '䑛'), ('shì', '䜴'), ('shì', '䟗'), ('shì', '䛈'),
             ('shì', '䜵'), ('shì', '㒾'), ('shì', '䩃'), ('shì', '㮶'), ('shì', '㱁'), ('shì', '䊓'), ('shì', '䤭'),
             ('shì', '䤱'), ('shì', '䜻'), ('shì', '䭄'), ('shì', '䁺'), ('shì', '䰄')]
    shi_5 = [('shi', '匙'), ('shi', '殖'), ('shi', '栅'), ('shi', '辻'), ('shi', '籂')]
    shou_1 = [('shōu', '收'), ('shōu', '収'), ('shōu', '敊')]
    shou_2 = [('shóu', '熟')]
    shou_3 = [('shǒu', '手'), ('shǒu', '首'), ('shǒu', '守'), ('shǒu', '扌'), ('shǒu', '垨'), ('shǒu', '艏'), ('shǒu', '㝊'),
              ('shǒu', '䭭'), ('shǒu', '补')]
    shou_4 = [('shòu', '受'), ('shòu', '授'), ('shòu', '寿'), ('shòu', '瘦'), ('shòu', '售'), ('shòu', '兽'), ('shòu', '狩'),
              ('shòu', '绶'), ('shòu', '涭'), ('shòu', '痩'), ('shòu', '膄'), ('shòu', '壽'), ('shòu', '夀'), ('shòu', '綬'),
              ('shòu', '嘼'), ('shòu', '獣'), ('shòu', '獸'), ('shòu', '鏉'), ('shòu', '㖟'), ('shòu', '㥅'), ('shòu', '䛵')]
    shu_1 = [('shū', '书'), ('shū', '输'), ('shū', '叔'), ('shū', '舒'), ('shū', '殊'), ('shū', '疏'), ('shū', '淑'),
             ('shū', '倏'), ('shū', '梳'), ('shū', '蔬'), ('shū', '抒'), ('shū', '枢'), ('shū', '纾'), ('shū', '姝'),
             ('shū', '殳'), ('shū', '疋'), ('shū', '菽'), ('shū', '忬'), ('shū', '杸'), ('shū', '陎'), ('shū', '倐'),
             ('shū', '捈'), ('shū', '書'), ('shū', '紓'), ('shū', '婌'), ('shū', '悆'), ('shū', '掓'), ('shū', '焂'),
             ('shū', '軗'), ('shū', '鄃'), ('shū', '琡'), ('shū', '疎'), ('shū', '摅'), ('shū', '毹'), ('shū', '毺'),
             ('shū', '綀'), ('shū', '瑹'), ('shū', '跾'), ('shū', '踈'), ('shū', '樞'), ('shū', '緰'), ('shū', '輸'),
             ('shū', '橾'), ('shū', '鮛'), ('shū', '儵'), ('shū', '攄'), ('shū', '瀭'), ('shū', '鵨'), ('shū', '㡏'),
             ('shū', '䔫'), ('shū', '䟽')]
    shu_2 = [('shú', '朱'), ('shú', '熟'), ('shú', '赎'), ('shú', '孰'), ('shú', '塾'), ('shú', '尗'), ('shú', '秫'),
             ('shú', '蒣'), ('shú', '璹'), ('shú', '贖'), ('shú', '䝪'), ('shú', '䴰'), ('shú', '䃞'), ('shú', '䭭')]
    shu_3 = [('shǔ', '属'), ('shǔ', '署'), ('shǔ', '鼠'), ('shǔ', '蜀'), ('shǔ', '暑'), ('shǔ', '曙'), ('shǔ', '薯'),
             ('shǔ', '黍'), ('shǔ', '鼡'), ('shǔ', '暏'), ('shǔ', '稌'), ('shǔ', '潻'), ('shǔ', '薥'), ('shǔ', '癙'),
             ('shǔ', '藷'), ('shǔ', '襡'), ('shǔ', '糬'), ('shǔ', '襩'), ('shǔ', '屬'), ('shǔ', '籔'), ('shǔ', '蠴'),
             ('shǔ', '鱪'), ('shǔ', '鱰'), ('shǔ', '㳆'), ('shǔ', '䞖'), ('shǔ', '䑕'), ('shǔ', '㟬'), ('shǔ', '㒔'),
             ('shǔ', '㯮'), ('shǔ', '㻿'), ('shǔ', '䩳'), ('shǔ', '䙱'), ('shǔ', '䠱'), ('shǔ', '补')]
    shu_4 = [('shù', '数'), ('shù', '术'), ('shù', '树'), ('shù', '述'), ('shù', '束'), ('shù', '俞'), ('shù', '恕'),
             ('shù', '竖'), ('shù', '庶'), ('shù', '墅'), ('shù', '漱'), ('shù', '戍'), ('shù', '朮'), ('shù', '沭'),
             ('shù', '侸'), ('shù', '兪'), ('shù', '咰'), ('shù', '怷'), ('shù', '怸'), ('shù', '荗'), ('shù', '捒'),
             ('shù', '庻'), ('shù', '絉'), ('shù', '蒁'), ('shù', '術'), ('shù', '隃'), ('shù', '尌'), ('shù', '裋'),
             ('shù', '竪'), ('shù', '腧'), ('shù', '鉥'), ('shù', '潄'), ('shù', '數'), ('shù', '澍'), ('shù', '豎'),
             ('shù', '樹'), ('shù', '濖'), ('shù', '錰'), ('shù', '霔'), ('shù', '鏣'), ('shù', '鶐'), ('shù', '虪'),
             ('shù', '㣽'), ('shù', '㾁'), ('shù', '䘤'), ('shù', '䆝'), ('shù', '䢞'), ('shù', '㛸'), ('shù', '㫹'),
             ('shù', '㷂'), ('shù', '䎉'), ('shù', '㜐'), ('shù', '㽰'), ('shù', '䢤'), ('shù', '㵂'), ('shù', '䜹'),
             ('shù', '䜿'), ('shù', '䠼'), ('shù', '䉀'), ('shù', '䝂'), ('shù', '䩱'), ('shù', '㶖')]
    shua_1 = [('shuā', '刷'), ('shuā', '唰'), ('shuā', '㕞')]
    shua_2 = [('shuǎ', '耍')]
    shua_3 = [('shuà', '誜')]
    shuai_1 = [('shuāi', '摔'), ('shuāi', '衰'), ('shuāi', '缞'), ('shuāi', '縗')]
    shuai_2 = [('shuǎi', '甩')]
    shuai_3 = [('shuài', '率'), ('shuài', '帅'), ('shuài', '蟀'), ('shuài', '帥'), ('shuài', '卛'), ('shuài', '䢦')]
    shuan_1 = [('shuān', '拴'), ('shuān', '闩'), ('shuān', '栓'), ('shuān', '閂'), ('shuān', '絟')]
    shuan_2 = [('shuàn', '涮'), ('shuàn', '腨'), ('shuàn', '槫'), ('shuàn', '䧠')]
    shuang_1 = [('shuāng', '双'), ('shuāng', '霜'), ('shuāng', '孀'), ('shuāng', '泷'), ('shuāng', '雙'), ('shuāng', '瀧'),
                ('shuāng', '骦'), ('shuāng', '孇'), ('shuāng', '騻'), ('shuāng', '欆'), ('shuāng', '礵'), ('shuāng', '鷞'),
                ('shuāng', '鹴'), ('shuāng', '艭'), ('shuāng', '驦'), ('shuāng', '鸘'), ('shuāng', '㕠')]
    shuang_2 = [('shuǎng', '爽'), ('shuǎng', '塽'), ('shuǎng', '慡'), ('shuǎng', '漺'), ('shuǎng', '縔'), ('shuǎng', '鏯'),
                ('shuǎng', '䔪'), ('shuǎng', '㼽'), ('shuǎng', '䗮'), ('shuǎng', '䫪')]
    shuang_3 = [('shuàng', '灀'), ('shuàng', '㦼'), ('shuàng', '䡯')]
    shui_1 = [('shuí', '谁'), ('shuí', '脽'), ('shuí', '誰')]
    shui_2 = [('shuǐ', '水'), ('shuǐ', '氵'), ('shuǐ', '氺'), ('shuǐ', '閖'), ('shuǐ', '㝽')]
    shui_3 = [('shuì', '说'), ('shuì', '睡'), ('shuì', '税'), ('shuì', '帨'), ('shuì', '挩'), ('shuì', '捝'), ('shuì', '涗'),
              ('shuì', '涚'), ('shuì', '娷'), ('shuì', '祱'), ('shuì', '稅'), ('shuì', '裞'), ('shuì', '說'), ('shuì', '説'),
              ('shuì', '㽷'), ('shuì', '㥨'), ('shuì', '䲧'), ('shuì', '䬽'), ('shuì', '㔑'), ('shuì', '䭨')]
    shun_1 = [('shǔn', '吮'), ('shǔn', '楯'), ('shǔn', '䞐')]
    shun_2 = [('shùn', '顺'), ('shùn', '瞬'), ('shùn', '舜'), ('shùn', '眴'), ('shùn', '順'), ('shùn', '蕣'), ('shùn', '橓'),
              ('shùn', '瞚'), ('shùn', '瞤'), ('shùn', '鬊'), ('shùn', '䀢'), ('shùn', '㥧'), ('shùn', '䀵'), ('shùn', '㯗'),
              ('shùn', '䑞'), ('shùn', '䴄')]
    shuo_1 = [('shuō', '说'), ('shuō', '說'), ('shuō', '説')]
    shuo_2 = [('shuò', '数'), ('shuò', '硕'), ('shuò', '烁'), ('shuò', '朔'), ('shuò', '搠'), ('shuò', '妁'), ('shuò', '铄'),
              ('shuò', '槊'), ('shuò', '洬'), ('shuò', '欶'), ('shuò', '矟'), ('shuò', '蒴'), ('shuò', '銏'), ('shuò', '愬'),
              ('shuò', '獡'), ('shuò', '碩'), ('shuò', '數'), ('shuò', '箾'), ('shuò', '鎙'), ('shuò', '爍'), ('shuò', '鑠'),
              ('shuò', '㸛'), ('shuò', '䀥'), ('shuò', '㮶'), ('shuò', '䌃'), ('shuò', '䈾'), ('shuò', '䁻')]
    si_1 = [('sī', '思'), ('sī', '斯'), ('sī', '司'), ('sī', '丝'), ('sī', '私'), ('sī', '厮'), ('sī', '撕'), ('sī', '嘶'),
            ('sī', '纟'), ('sī', '咝'), ('sī', '鸶'), ('sī', '缌'), ('sī', '厶'), ('sī', '糸'), ('sī', '糹'), ('sī', '泀'),
            ('sī', '俬'), ('sī', '恖'), ('sī', '虒'), ('sī', '偲'), ('sī', '傂'), ('sī', '媤'), ('sī', '愢'), ('sī', '絲'),
            ('sī', '蛳'), ('sī', '楒'), ('sī', '禗'), ('sī', '鉰'), ('sī', '飔'), ('sī', '凘'), ('sī', '禠'), ('sī', '罳'),
            ('sī', '蜤'), ('sī', '銯'), ('sī', '锶'), ('sī', '噝'), ('sī', '廝'), ('sī', '澌'), ('sī', '磃'), ('sī', '緦'),
            ('sī', '蕬'), ('sī', '鋖'), ('sī', '燍'), ('sī', '螄'), ('sī', '鍶'), ('sī', '蟖'), ('sī', '蟴'), ('sī', '颸'),
            ('sī', '騦'), ('sī', '鯣'), ('sī', '鐁'), ('sī', '鷥'), ('sī', '鼶'), ('sī', '㺨'), ('sī', '㚸'), ('sī', '㟃'),
            ('sī', '㴲'), ('sī', '㺇'), ('sī', '䔮'), ('sī', '䇁')]
    si_2 = []
    si_3 = [('sǐ', '死')]
    si_4 = [('sì', '四'), ('sì', '似'), ('sì', '食'), ('sì', '寺'), ('sì', '伺'), ('sì', '肆'), ('sì', '祀'), ('sì', '嗣'),
            ('sì', '巳'), ('sì', '俟'), ('sì', '饲'), ('sì', '泗'), ('sì', '汜'), ('sì', '驷'), ('sì', '兕'), ('sì', '姒'),
            ('sì', '笥'), ('sì', '耜'), ('sì', '亖'), ('sì', '佀'), ('sì', '泤'), ('sì', '価'), ('sì', '孠'), ('sì', '杫'),
            ('sì', '娰'), ('sì', '枱'), ('sì', '柶'), ('sì', '洠'), ('sì', '牭'), ('sì', '洍'), ('sì', '涘'), ('sì', '肂'),
            ('sì', '飤'), ('sì', '梩'), ('sì', '耛'), ('sì', '釲'), ('sì', '竢'), ('sì', '覗'), ('sì', '貄'), ('sì', '鈶'),
            ('sì', '鈻'), ('sì', '飴'), ('sì', '飼'), ('sì', '榹'), ('sì', '銉'), ('sì', '禩'), ('sì', '駟'), ('sì', '蕼'),
            ('sì', '儩'), ('sì', '騃'), ('sì', '瀃'), ('sì', '㐌'), ('sì', '䂖'), ('sì', '㕽'), ('sì', '㚶'), ('sì', '䃽'),
            ('sì', '䇃'), ('sì', '㭒'), ('sì', '䏤'), ('sì', '䎣'), ('sì', '㸻'), ('sì', '䦙'), ('sì', '㜦'), ('sì', '㣈'),
            ('sì', '㹑'), ('sì', '补')]
    song_1 = [('sōng', '松'), ('sōng', '嵩'), ('sōng', '忪'), ('sōng', '崧'), ('sōng', '淞'), ('sōng', '枀'), ('sōng', '枩'),
              ('sōng', '娀'), ('sōng', '柗'), ('sōng', '倯'), ('sōng', '凇'), ('sōng', '庺'), ('sōng', '梥'), ('sōng', '菘'),
              ('sōng', '愡'), ('sōng', '揔'), ('sōng', '棇'), ('sōng', '硹'), ('sōng', '憽'), ('sōng', '濍'), ('sōng', '檧'),
              ('sōng', '鬆'), ('sōng', '㣝')]
    song_2 = [('sóng', '㞞')]
    song_3 = [('sǒng', '耸'), ('sǒng', '悚'), ('sǒng', '怂'), ('sǒng', '竦'), ('sǒng', '捒'), ('sǒng', '傱'), ('sǒng', '愯'),
              ('sǒng', '楤'), ('sǒng', '嵷'), ('sǒng', '摗'), ('sǒng', '漎'), ('sǒng', '慫'), ('sǒng', '聳'), ('sǒng', '駷'),
              ('sǒng', '㧐'), ('sǒng', '䜬'), ('sǒng', '㨦'), ('sǒng', '䉥'), ('sǒng', '㩳')]
    song_4 = [('sòng', '送'), ('sòng', '宋'), ('sòng', '诵'), ('sòng', '颂'), ('sòng', '讼'), ('sòng', '吅'), ('sòng', '訟'),
              ('sòng', '頌'), ('sòng', '誦'), ('sòng', '鎹'), ('sòng', '餸'), ('sòng', '㕬'), ('sòng', '䢠'), ('sòng', '㮸'),
              ('sòng', '䛦')]
    sou_1 = [('sōu', '搜'), ('sōu', '艘'), ('sōu', '飕'), ('sōu', '嗖'), ('sōu', '馊'), ('sōu', '凁'), ('sōu', '捒'),
             ('sōu', '捜'), ('sōu', '鄋'), ('sōu', '廀'), ('sōu', '廋'), ('sōu', '溲'), ('sōu', '獀'), ('sōu', '蒐'),
             ('sōu', '蓃'), ('sōu', '摉'), ('sōu', '摗'), ('sōu', '锼'), ('sōu', '撨'), ('sōu', '螋'), ('sōu', '醙'),
             ('sōu', '鎪'), ('sōu', '餿'), ('sōu', '颼'), ('sōu', '颾'), ('sōu', '鏉'), ('sōu', '騪'), ('sōu', '䐹'),
             ('sōu', '䬒'), ('sōu', '䱸')]
    sou_2 = [('sǒu', '叟'), ('sǒu', '薮'), ('sǒu', '叜'), ('sǒu', '傁'), ('sǒu', '棷'), ('sǒu', '嗾'), ('sǒu', '瞍'),
             ('sǒu', '藪'), ('sǒu', '櫢'), ('sǒu', '籔'), ('sǒu', '㖩'), ('sǒu', '㟬'), ('sǒu', '䏂'), ('sǒu', '䈹'),
             ('sǒu', '䉤'), ('sǒu', '䮟')]
    sou_3 = [('sòu', '嗽'), ('sòu', '擞'), ('sòu', '欶'), ('sòu', '瘶'), ('sòu', '擻'), ('sòu', '㵻')]
    su_1 = [('sū', '苏'), ('sū', '酥'), ('sū', '稣'), ('sū', '甦'), ('sū', '稡'), ('sū', '窣'), ('sū', '穌'), ('sū', '鯂'),
            ('sū', '蘇'), ('sū', '蘓'), ('sū', '櫯'), ('sū', '囌')]
    su_2 = [('sú', '俗'), ('sú', '圱')]
    su_3 = []
    su_4 = [('sù', '诉'), ('sù', '素'), ('sù', '速'), ('sù', '缩'), ('sù', '宿'), ('sù', '肃'), ('sù', '塑'), ('sù', '溯'),
            ('sù', '粟'), ('sù', '簌'), ('sù', '夙'), ('sù', '谡'), ('sù', '愫'), ('sù', '玊'), ('sù', '泝'), ('sù', '洬'),
            ('sù', '涑'), ('sù', '珟'), ('sù', '莤'), ('sù', '埣'), ('sù', '梀'), ('sù', '殐'), ('sù', '粛'), ('sù', '骕'),
            ('sù', '傃'), ('sù', '棴'), ('sù', '訴'), ('sù', '嗉'), ('sù', '塐'), ('sù', '嫊'), ('sù', '溸'), ('sù', '肅'),
            ('sù', '遡'), ('sù', '鹔'), ('sù', '僳'), ('sù', '愬'), ('sù', '摵'), ('sù', '榡'), ('sù', '膆'), ('sù', '蔌'),
            ('sù', '觫'), ('sù', '趚'), ('sù', '遬'), ('sù', '憟'), ('sù', '樎'), ('sù', '樕'), ('sù', '潥'), ('sù', '碿'),
            ('sù', '鋉'), ('sù', '餗'), ('sù', '潚'), ('sù', '縤'), ('sù', '橚'), ('sù', '璛'), ('sù', '縮'), ('sù', '藗'),
            ('sù', '謖'), ('sù', '蹜'), ('sù', '驌'), ('sù', '鱐'), ('sù', '鷫'), ('sù', '㑉'), ('sù', '㑛'), ('sù', '㕖'),
            ('sù', '㓘'), ('sù', '㝛'), ('sù', '㥛'), ('sù', '㴋'), ('sù', '䅇'), ('sù', '䇤'), ('sù', '㴑'), ('sù', '㨞'),
            ('sù', '䏋'), ('sù', '䔎'), ('sù', '䘻'), ('sù', '㔄'), ('sù', '㜚'), ('sù', '㯈'), ('sù', '㴼'), ('sù', '㩋'),
            ('sù', '㪩'), ('sù', '㬘'), ('sù', '䑿'), ('sù', '䛾'), ('sù', '䃤'), ('sù', '䌚'), ('sù', '䩳'), ('sù', '䎘'),
            ('sù', '䥔')]
    suan_1 = [('suān', '酸'), ('suān', '狻'), ('suān', '痠')]
    suan_2 = [('suǎn', '匴'), ('suǎn', '篹'), ('suǎn', '㔯')]
    suan_3 = [('suàn', '算'), ('suàn', '蒜'), ('suàn', '祘'), ('suàn', '笇'), ('suàn', '筭'), ('suàn', '㱹')]
    sui_1 = [('suī', '虽'), ('suī', '尿'), ('suī', '睢'), ('suī', '夊'), ('suī', '芕'), ('suī', '倠'), ('suī', '哸'),
             ('suī', '娞'), ('suī', '浽'), ('suī', '荽'), ('suī', '荾'), ('suī', '眭'), ('suī', '毸'), ('suī', '滖'),
             ('suī', '缞'), ('suī', '嗺'), ('suī', '熣'), ('suī', '濉'), ('suī', '縗'), ('suī', '鞖'), ('suī', '雖'),
             ('suī', '䪎')]
    sui_2 = [('suí', '随'), ('suí', '隋'), ('suí', '绥'), ('suí', '遀'), ('suí', '綏'), ('suí', '隨'), ('suí', '瓍'),
             ('suí', '髄'), ('suí', '䅑'), ('suí', '㻟'), ('suí', '䢫'), ('suí', '㵦'), ('suí', '䜔')]
    sui_3 = [('suǐ', '髓'), ('suǐ', '膸'), ('suǐ', '瀡'), ('suǐ', '䭉'), ('suǐ', '䯝')]
    sui_4 = [('suì', '岁'), ('suì', '遂'), ('suì', '碎'), ('suì', '祟'), ('suì', '隧'), ('suì', '穗'), ('suì', '邃'),
             ('suì', '燧'), ('suì', '亗'), ('suì', '砕'), ('suì', '谇'), ('suì', '埣'), ('suì', '嵗'), ('suì', '歲'),
             ('suì', '歳'), ('suì', '煫'), ('suì', '睟'), ('suì', '嬘'), ('suì', '澻'), ('suì', '穂'), ('suì', '誶'),
             ('suì', '賥'), ('suì', '檖'), ('suì', '璲'), ('suì', '禭'), ('suì', '穟'), ('suì', '繀'), ('suì', '襚'),
             ('suì', '旞'), ('suì', '繐'), ('suì', '繸'), ('suì', '譢'), ('suì', '鐆'), ('suì', '鏸'), ('suì', '鐩'),
             ('suì', '韢'), ('suì', '㞸'), ('suì', '㒸'), ('suì', '㥞'), ('suì', '㴚'), ('suì', '䅗'), ('suì', '㻪'),
             ('suì', '䔹'), ('suì', '䆳'), ('suì', '䍁'), ('suì', '䤭'), ('suì', '㻽'), ('suì', '䠔'), ('suì', '䉌'),
             ('suì', '䜆'), ('suì', '䡵'), ('suì', '䥙'), ('suì', '䲀')]
    sun_1 = [('sūn', '孙'), ('sūn', '荪'), ('sūn', '狲'), ('sūn', '飧'), ('sūn', '孫'), ('sūn', '喰'), ('sūn', '飱'),
             ('sūn', '搎'), ('sūn', '猻'), ('sūn', '蓀'), ('sūn', '槂'), ('sūn', '蕵'), ('sūn', '薞')]
    sun_2 = [('sǔn', '损'), ('sǔn', '笋'), ('sǔn', '隼'), ('sǔn', '扻'), ('sǔn', '筍'), ('sǔn', '損'), ('sǔn', '榫'),
             ('sǔn', '箰'), ('sǔn', '簨'), ('sǔn', '鎨'), ('sǔn', '鶽'), ('sǔn', '㡄'), ('sǔn', '㔼'), ('sǔn', '䐣'),
             ('sǔn', '㦏'), ('sǔn', '䁚'), ('sǔn', '㰂')]
    sun_3 = [('sùn', '摌')]
    suo_1 = [('suō', '缩'), ('suō', '莎'), ('suō', '梭'), ('suō', '嗦'), ('suō', '唆'), ('suō', '娑'), ('suō', '挲'),
             ('suō', '蓑'), ('suō', '睃'), ('suō', '挱'), ('suō', '莏'), ('suō', '傞'), ('suō', '桫'), ('suō', '嗍'),
             ('suō', '羧'), ('suō', '摍'), ('suō', '趖'), ('suō', '簑'), ('suō', '簔'), ('suō', '縮'), ('suō', '鮻'),
             ('suō', '㛖'), ('suō', '䓾')]
    suo_2 = []
    suo_3 = [('suǒ', '所'), ('suǒ', '索'), ('suǒ', '锁'), ('suǒ', '琐'), ('suǒ', '唢'), ('suǒ', '乺'), ('suǒ', '琑'),
             ('suǒ', '嫅'), ('suǒ', '惢'), ('suǒ', '嗩'), ('suǒ', '暛'), ('suǒ', '溑'), ('suǒ', '獕'), ('suǒ', '瑣'),
             ('suǒ', '褨'), ('suǒ', '璅'), ('suǒ', '縒'), ('suǒ', '鎍'), ('suǒ', '鎖'), ('suǒ', '鎻'), ('suǒ', '鏁'),
             ('suǒ', '㪽'), ('suǒ', '䣔'), ('suǒ', '䂹'), ('suǒ', '㮦'), ('suǒ', '䐝'), ('suǒ', '䅴'), ('suǒ', '䈗'),
             ('suǒ', '䌇'), ('suǒ', '䞆'), ('suǒ', '䞽'), ('suǒ', '䖛'), ('suǒ', '䵀')]
    suo_4 = [('suò', '些'), ('suò', '逤'), ('suò', '溹'), ('suò', '蜶'), ('suò', '㱔')]
    ta_1 = [('tā', '他'), ('tā', '她'), ('tā', '它'), ('tā', '塌'), ('tā', '趿'), ('tā', '牠'), ('tā', '祂'), ('tā', '铊'),
            ('tā', '榙'), ('tā', '溻'), ('tā', '鉈'), ('tā', '褟'), ('tā', '闧')]
    ta_2 = []
    ta_3 = [('tǎ', '塔'), ('tǎ', '獭'), ('tǎ', '溚'), ('tǎ', '墖'), ('tǎ', '鮙'), ('tǎ', '鳎'), ('tǎ', '獺'), ('tǎ', '鰨'),
            ('tǎ', '㗳'), ('tǎ', '㺚')]
    ta_4 = [('tà', '踏'), ('tà', '拓'), ('tà', '榻'), ('tà', '蹋'), ('tà', '沓'), ('tà', '嗒'), ('tà', '挞'), ('tà', '闼'),
            ('tà', '遢'), ('tà', '狧'), ('tà', '粏'), ('tà', '崉'), ('tà', '涾'), ('tà', '傝'), ('tà', '搨'), ('tà', '遝'),
            ('tà', '阘'), ('tà', '毾'), ('tà', '漯'), ('tà', '禢'), ('tà', '撻'), ('tà', '澾'), ('tà', '誻'), ('tà', '鞈'),
            ('tà', '嚃'), ('tà', '橽'), ('tà', '錔'), ('tà', '濌'), ('tà', '鞜'), ('tà', '鎉'), ('tà', '鎑'), ('tà', '闒'),
            ('tà', '鞳'), ('tà', '蹹'), ('tà', '躂'), ('tà', '嚺'), ('tà', '闟'), ('tà', '闥'), ('tà', '譶'), ('tà', '躢'),
            ('tà', '㣛'), ('tà', '㳠'), ('tà', '㳫'), ('tà', '䍇'), ('tà', '㛥'), ('tà', '㧺'), ('tà', '㹺'), ('tà', '䓠'),
            ('tà', '㭼'), ('tà', '䂿'), ('tà', '䍝'), ('tà', '㒓'), ('tà', '䈋'), ('tà', '䎓'), ('tà', '㣵'), ('tà', '䑜'),
            ('tà', '䠅'), ('tà', '㯓'), ('tà', '䈳'), ('tà', '䌈'), ('tà', '䑽'), ('tà', '㿹'), ('tà', '䪚'), ('tà', '䶀'),
            ('tà', '䵬'), ('tà', '䜚'), ('tà', '䳴'), ('tà', '䶁')]
    ta_5 = [('ta', '侤')]
    tai_1 = [('tāi', '胎'), ('tāi', '囼'), ('tāi', '孡'), ('tāi', '珆')]
    tai_2 = [('tái', '台'), ('tái', '抬'), ('tái', '苔'), ('tái', '骀'), ('tái', '旲'), ('tái', '邰'), ('tái', '坮'),
             ('tái', '枱'), ('tái', '炱'), ('tái', '炲'), ('tái', '菭'), ('tái', '跆'), ('tái', '鲐'), ('tái', '箈'),
             ('tái', '臺'), ('tái', '颱'), ('tái', '駘'), ('tái', '儓'), ('tái', '鮐'), ('tái', '嬯'), ('tái', '擡'),
             ('tái', '薹'), ('tái', '檯'), ('tái', '斄'), ('tái', '籉'), ('tái', '㣍'), ('tái', '㙜'), ('tái', '㬃'),
             ('tái', '㷘'), ('tái', '䑓'), ('tái', '㒗'), ('tái', '䈚'), ('tái', '㙵'), ('tái', '㘆'), ('tái', '㸀'),
             ('tái', '䢰')]
    tai_3 = [('tǎi', '奤')]
    tai_4 = [('tài', '大'), ('tài', '太'), ('tài', '态'), ('tài', '泰'), ('tài', '汰'), ('tài', '钛'), ('tài', '冭'),
             ('tài', '夳'), ('tài', '忕'), ('tài', '汏'), ('tài', '忲'), ('tài', '汱'), ('tài', '肽'), ('tài', '舦'),
             ('tài', '酞'), ('tài', '鈦'), ('tài', '溙'), ('tài', '態'), ('tài', '燤'), ('tài', '㑀'), ('tài', '䣭'),
             ('tài', '㑷'), ('tài', '㥭')]
    tan_1 = [('tān', '贪'), ('tān', '摊'), ('tān', '滩'), ('tān', '瘫'), ('tān', '坍'), ('tān', '怹'), ('tān', '啴'),
             ('tān', '痑'), ('tān', '舑'), ('tān', '貪'), ('tān', '嘽'), ('tān', '潬'), ('tān', '擹'), ('tān', '攤'),
             ('tān', '灘'), ('tān', '癱')]
    tan_2 = [('tán', '谈'), ('tán', '弹'), ('tán', '坛'), ('tán', '谭'), ('tán', '潭'), ('tán', '檀'), ('tán', '痰'),
             ('tán', '昙'), ('tán', '覃'), ('tán', '澹'), ('tán', '郯'), ('tán', '倓'), ('tán', '埮'), ('tán', '婒'),
             ('tán', '惔'), ('tán', '弾'), ('tán', '榃'), ('tán', '锬'), ('tán', '嘾'), ('tán', '墰'), ('tán', '墵'),
             ('tán', '彈'), ('tán', '憛'), ('tán', '談'), ('tán', '醈'), ('tán', '壇'), ('tán', '曇'), ('tán', '橝'),
             ('tán', '燂'), ('tán', '錟'), ('tán', '顃'), ('tán', '罈'), ('tán', '藫'), ('tán', '壜'), ('tán', '繵'),
             ('tán', '譚'), ('tán', '貚'), ('tán', '醰'), ('tán', '譠'), ('tán', '罎'), ('tán', '䢻'), ('tán', '㛶'),
             ('tán', '㪔'), ('tán', '㲜'), ('tán', '㷋'), ('tán', '㽎'), ('tán', '䕊'), ('tán', '㽑'), ('tán', '䨢'),
             ('tán', '䃪'), ('tán', '䊤'), ('tán', '䉡'), ('tán', '㺥')]
    tan_3 = [('tǎn', '坦'), ('tǎn', '毯'), ('tǎn', '袒'), ('tǎn', '忐'), ('tǎn', '钽'), ('tǎn', '菼'), ('tǎn', '僋'),
             ('tǎn', '鉭'), ('tǎn', '嗿'), ('tǎn', '緂'), ('tǎn', '儃'), ('tǎn', '憳'), ('tǎn', '憻'), ('tǎn', '暺'),
             ('tǎn', '醓'), ('tǎn', '璮'), ('tǎn', '襢'), ('tǎn', '䏙'), ('tǎn', '㫜'), ('tǎn', '䞡'), ('tǎn', '䦔'),
             ('tǎn', '㲭'), ('tǎn', '䆱')]
    tan_4 = [('tàn', '叹'), ('tàn', '探'), ('tàn', '炭'), ('tàn', '碳'), ('tàn', '傝'), ('tàn', '湠'), ('tàn', '嘆'),
             ('tàn', '舕'), ('tàn', '歎'), ('tàn', '䀡'), ('tàn', '㒎'), ('tàn', '㵅'), ('tàn', '䗊'), ('tàn', '䐺'),
             ('tàn', '䜖'), ('tàn', '㶒')]
    tang_1 = [('tāng', '汤'), ('tāng', '湯'), ('tāng', '嘡'), ('tāng', '劏'), ('tāng', '羰'), ('tāng', '蝪'), ('tāng', '薚'),
              ('tāng', '镗'), ('tāng', '蹚'), ('tāng', '鏜'), ('tāng', '鞺'), ('tāng', '鼞')]
    tang_2 = [('táng', '堂'), ('táng', '唐'), ('táng', '膛'), ('táng', '棠'), ('táng', '塘'), ('táng', '糖'), ('táng', '搪'),
              ('táng', '螳'), ('táng', '坣'), ('táng', '傏'), ('táng', '啺'), ('táng', '愓'), ('táng', '鄌'), ('táng', '嵣'),
              ('táng', '溏'), ('táng', '蓎'), ('táng', '隚'), ('táng', '榶'), ('táng', '漟'), ('táng', '煻'), ('táng', '瑭'),
              ('táng', '禟'), ('táng', '膅'), ('táng', '樘'), ('táng', '磄'), ('táng', '糃'), ('táng', '橖'), ('táng', '篖'),
              ('táng', '螗'), ('táng', '踼'), ('táng', '糛'), ('táng', '赯'), ('táng', '醣'), ('táng', '鎕'), ('táng', '餹'),
              ('táng', '闛'), ('táng', '饄'), ('táng', '鶶'), ('táng', '㭻'), ('táng', '䧜'), ('táng', '㑽'), ('táng', '㜍'),
              ('táng', '䣘'), ('táng', '㲥'), ('táng', '㼺'), ('táng', '䅯'), ('táng', '㙶'), ('táng', '䌅'), ('táng', '䕋'),
              ('táng', '䉎')]
    tang_3 = [('tǎng', '躺'), ('tǎng', '倘'), ('tǎng', '淌'), ('tǎng', '傥'), ('tǎng', '帑'), ('tǎng', '伖'), ('tǎng', '偒'),
              ('tǎng', '耥'), ('tǎng', '镋'), ('tǎng', '鎲'), ('tǎng', '儻'), ('tǎng', '戃'), ('tǎng', '灙'), ('tǎng', '曭'),
              ('tǎng', '爣'), ('tǎng', '矘'), ('tǎng', '钂'), ('tǎng', '㒉'), ('tǎng', '㼒'), ('tǎng', '㿩')]
    tang_4 = [('tàng', '趟'), ('tàng', '烫'), ('tàng', '铴'), ('tàng', '摥'), ('tàng', '燙'), ('tàng', '鐋'), ('tàng', '䟖'),
              ('tàng', '㦂')]
    tao_1 = [('tāo', '涛'), ('tāo', '掏'), ('tāo', '叨'), ('tāo', '滔'), ('tāo', '韬'), ('tāo', '绦'), ('tāo', '饕'),
             ('tāo', '夲'), ('tāo', '夵'), ('tāo', '弢'), ('tāo', '抭'), ('tāo', '涭'), ('tāo', '絛'), ('tāo', '詜'),
             ('tāo', '嫍'), ('tāo', '幍'), ('tāo', '慆'), ('tāo', '搯'), ('tāo', '槄'), ('tāo', '瑫'), ('tāo', '飸'),
             ('tāo', '縚'), ('tāo', '縧'), ('tāo', '濤'), ('tāo', '謟'), ('tāo', '轁'), ('tāo', '鞱'), ('tāo', '韜'),
             ('tāo', '䬢'), ('tāo', '㴞')]
    tao_2 = [('táo', '跳'), ('táo', '逃'), ('táo', '陶'), ('táo', '桃'), ('táo', '萄'), ('táo', '淘'), ('táo', '啕'),
             ('táo', '洮'), ('táo', '绹'), ('táo', '匋'), ('táo', '迯'), ('táo', '咷'), ('táo', '梼'), ('táo', '祹'),
             ('táo', '裪'), ('táo', '綯'), ('táo', '蜪'), ('táo', '鞀'), ('táo', '醄'), ('táo', '鞉'), ('táo', '鋾'),
             ('táo', '駣'), ('táo', '檮'), ('táo', '饀'), ('táo', '騊'), ('táo', '鼗'), ('táo', '䄻'), ('táo', '䛌'),
             ('táo', '䛬'), ('táo', '䱇'), ('táo', '㹗'), ('táo', '䬞')]
    tao_3 = [('tǎo', '讨'), ('tǎo', '討'), ('tǎo', '䚯'), ('tǎo', '䵚')]
    tao_4 = [('tào', '套'), ('tào', '㚐')]
    te_1 = [('tè', '特'), ('tè', '忒'), ('tè', '忑'), ('tè', '慝'), ('tè', '脦'), ('tè', '犆'), ('tè', '铽'), ('tè', '鋱'),
            ('tè', '蟘'), ('tè', '㥂'), ('tè', '㧹')]
    teng_1 = [('tēng', '熥'), ('tēng', '膯'), ('tēng', '鼟')]
    teng_2 = [('téng', '腾'), ('téng', '疼'), ('téng', '藤'), ('téng', '滕'), ('téng', '誊'), ('téng', '痋'), ('téng', '幐'),
              ('téng', '漛'), ('téng', '邆'), ('téng', '縢'), ('téng', '螣'), ('téng', '駦'), ('téng', '謄'), ('téng', '儯'),
              ('téng', '騰'), ('téng', '籐'), ('téng', '鰧'), ('téng', '籘'), ('téng', '虅'), ('téng', '驣'), ('téng', '䒅'),
              ('téng', '䲢'), ('téng', '䕨'), ('téng', '䠮'), ('téng', '䲍')]
    teng_3 = [('tèng', '霯')]
    ti_1 = [('tī', '梯'), ('tī', '踢'), ('tī', '剔'), ('tī', '锑'), ('tī', '銻'), ('tī', '擿'), ('tī', '鷈'), ('tī', '鷉'),
            ('tī', '䴘')]
    ti_2 = [('tí', '提'), ('tí', '题'), ('tí', '啼'), ('tí', '蹄'), ('tí', '荑'), ('tí', '缇'), ('tí', '鹈'), ('tí', '苐'),
            ('tí', '厗'), ('tí', '桋'), ('tí', '绨'), ('tí', '偍'), ('tí', '珶'), ('tí', '媂'), ('tí', '媞'), ('tí', '崹'),
            ('tí', '惿'), ('tí', '渧'), ('tí', '稊'), ('tí', '罤'), ('tí', '遆'), ('tí', '嗁'), ('tí', '瑅'), ('tí', '禔'),
            ('tí', '綈'), ('tí', '睼'), ('tí', '碮'), ('tí', '褆'), ('tí', '徲'), ('tí', '漽'), ('tí', '磃'), ('tí', '緹'),
            ('tí', '蕛'), ('tí', '趧'), ('tí', '醍'), ('tí', '謕'), ('tí', '蹏'), ('tí', '鍗'), ('tí', '鳀'), ('tí', '題'),
            ('tí', '鮷'), ('tí', '鵜'), ('tí', '騠'), ('tí', '鯷'), ('tí', '鶗'), ('tí', '鶙'), ('tí', '禵'), ('tí', '鷤'),
            ('tí', '㖒'), ('tí', '㣢'), ('tí', '㖷'), ('tí', '㡗'), ('tí', '䝰'), ('tí', '䬫'), ('tí', '䅠'), ('tí', '䨑'),
            ('tí', '䈕'), ('tí', '䔶'), ('tí', '䛱'), ('tí', '䣡'), ('tí', '䬾'), ('tí', '䚣'), ('tí', '䱱')]
    ti_3 = [('tǐ', '体'), ('tǐ', '挮'), ('tǐ', '徥'), ('tǐ', '躰'), ('tǐ', '骵'), ('tǐ', '軆'), ('tǐ', '體'), ('tǐ', '䣽'),
            ('tǐ', '䌡'), ('tǐ', '䶏'), ('tǐ', '䪆')]
    ti_4 = [('tì', '弟'), ('tì', '替'), ('tì', '涕'), ('tì', '屉'), ('tì', '剃'), ('tì', '惕'), ('tì', '棣'), ('tì', '倜'),
            ('tì', '嚏'), ('tì', '悌'), ('tì', '逖'), ('tì', '戻'), ('tì', '奃'), ('tì', '朑'), ('tì', '俶'), ('tì', '眣'),
            ('tì', '啑'), ('tì', '屜'), ('tì', '悐'), ('tì', '掦'), ('tì', '笹'), ('tì', '逷'), ('tì', '屟'), ('tì', '惖'),
            ('tì', '揥'), ('tì', '裼'), ('tì', '褅'), ('tì', '歒'), ('tì', '殢'), ('tì', '髰'), ('tì', '薙'), ('tì', '鬀'),
            ('tì', '嚔'), ('tì', '瓋'), ('tì', '鬄'), ('tì', '籊'), ('tì', '趯'), ('tì', '䧅'), ('tì', '㗣'), ('tì', '䣠'),
            ('tì', '䞶'), ('tì', '䩟'), ('tì', '㬱'), ('tì', '㯩'), ('tì', '䙗'), ('tì', '䎮'), ('tì', '䢰'), ('tì', '䯜'),
            ('tì', '䶍'), ('tì', '䫮'), ('tì', '䶑')]
    tian_1 = [('tiān', '天'), ('tiān', '添'), ('tiān', '兲'), ('tiān', '呑'), ('tiān', '婖'), ('tiān', '酟'), ('tiān', '靔'),
              ('tiān', '黇'), ('tiān', '靝')]
    tian_2 = [('tián', '田'), ('tián', '甜'), ('tián', '填'), ('tián', '甸'), ('tián', '恬'), ('tián', '佃'), ('tián', '钿'),
              ('tián', '畋'), ('tián', '阗'), ('tián', '屇'), ('tián', '沺'), ('tián', '畑'), ('tián', '盷'), ('tián', '胋'),
              ('tián', '甛'), ('tián', '菾'), ('tián', '湉'), ('tián', '塡'), ('tián', '搷'), ('tián', '碵'), ('tián', '緂'),
              ('tián', '磌'), ('tián', '窴'), ('tián', '鴫'), ('tián', '璳'), ('tián', '闐'), ('tián', '鷆'), ('tián', '鷏'),
              ('tián', '䧃'), ('tián', '㧂'), ('tián', '䏦'), ('tián', '䑚'), ('tián', '䟧'), ('tián', '䡒'), ('tián', '䣶'),
              ('tián', '䡘'), ('tián', '䥖')]
    tian_3 = [('tiǎn', '舔'), ('tiǎn', '腆'), ('tiǎn', '忝'), ('tiǎn', '殄'), ('tiǎn', '奵'), ('tiǎn', '倎'), ('tiǎn', '栝'),
              ('tiǎn', '唺'), ('tiǎn', '悿'), ('tiǎn', '淟'), ('tiǎn', '紾'), ('tiǎn', '铦'), ('tiǎn', '晪'), ('tiǎn', '琠'),
              ('tiǎn', '觍'), ('tiǎn', '痶'), ('tiǎn', '睓'), ('tiǎn', '銛'), ('tiǎn', '餂'), ('tiǎn', '覥'), ('tiǎn', '賟'),
              ('tiǎn', '銽'), ('tiǎn', '錪'), ('tiǎn', '㐁'), ('tiǎn', '㤁'), ('tiǎn', '䄹'), ('tiǎn', '㖭'), ('tiǎn', '㙉'),
              ('tiǎn', '㥏'), ('tiǎn', '䄼'), ('tiǎn', '䄽'), ('tiǎn', '䐌'), ('tiǎn', '䣯'), ('tiǎn', '䄕'), ('tiǎn', '䩄'),
              ('tiǎn', '䩞'), ('tiǎn', '䠄')]
    tian_4 = [('tiàn', '掭'), ('tiàn', '瑱'), ('tiàn', '舚'), ('tiàn', '㧱'), ('tiàn', '㶺'), ('tiàn', '㮇')]
    tiao_1 = [('tiāo', '挑'), ('tiāo', '佻'), ('tiāo', '祧'), ('tiāo', '旫'), ('tiāo', '庣'), ('tiāo', '恌'), ('tiāo', '聎')]
    tiao_2 = [('tiáo', '条'), ('tiáo', '调'), ('tiáo', '迢'), ('tiáo', '苕'), ('tiáo', '髫'), ('tiáo', '芀'), ('tiáo', '朷'),
              ('tiáo', '岧'), ('tiáo', '岹'), ('tiáo', '祒'), ('tiáo', '條'), ('tiáo', '笤'), ('tiáo', '萔'), ('tiáo', '铫'),
              ('tiáo', '蓚'), ('tiáo', '蓧'), ('tiáo', '蓨'), ('tiáo', '龆'), ('tiáo', '樤'), ('tiáo', '蜩'), ('tiáo', '銚'),
              ('tiáo', '調'), ('tiáo', '鋚'), ('tiáo', '鞗'), ('tiáo', '鲦'), ('tiáo', '鯈'), ('tiáo', '鎥'), ('tiáo', '齠'),
              ('tiáo', '鰷'), ('tiáo', '䒒'), ('tiáo', '㟘'), ('tiáo', '䎄'), ('tiáo', '䟭'), ('tiáo', '䖺'), ('tiáo', '㩖'),
              ('tiáo', '䩦'), ('tiáo', '䳂'), ('tiáo', '䯾'), ('tiáo', '䱔')]
    tiao_3 = [('tiǎo', '窕'), ('tiǎo', '宨'), ('tiǎo', '晀'), ('tiǎo', '朓'), ('tiǎo', '脁'), ('tiǎo', '誂'), ('tiǎo', '斢'),
              ('tiǎo', '窱'), ('tiǎo', '嬥'), ('tiǎo', '䧂'), ('tiǎo', '㸠'), ('tiǎo', '䂪'), ('tiǎo', '䠷')]
    tiao_4 = [('tiào', '跳'), ('tiào', '眺'), ('tiào', '啁'), ('tiào', '粜'), ('tiào', '絩'), ('tiào', '覜'), ('tiào', '趒'),
              ('tiào', '糶')]
    tie_1 = [('tiē', '贴'), ('tiē', '怗'), ('tiē', '萜'), ('tiē', '聑'), ('tiē', '貼'), ('tiē', '跕')]
    tie_2 = [('tié', '䩞')]
    tie_3 = [('tiě', '铁'), ('tiě', '蛈'), ('tiě', '鉄'), ('tiě', '僣'), ('tiě', '銕'), ('tiě', '鐡'), ('tiě', '鐵'),
             ('tiě', '驖'), ('tiě', '䥫')]
    tie_4 = [('tiè', '帖'), ('tiè', '呫'), ('tiè', '飻'), ('tiè', '餮'), ('tiè', '䂿'), ('tiè', '䴴'), ('tiè', '䵿')]
    ting_1 = [('tīng', '听'), ('tīng', '厅'), ('tīng', '汀'), ('tīng', '庁'), ('tīng', '庍'), ('tīng', '耓'), ('tīng', '厛'),
              ('tīng', '烃'), ('tīng', '桯'), ('tīng', '烴'), ('tīng', '綎'), ('tīng', '鞓'), ('tīng', '聴'), ('tīng', '聼'),
              ('tīng', '廰'), ('tīng', '聽'), ('tīng', '廳')]
    ting_2 = [('tíng', '停'), ('tíng', '庭'), ('tíng', '亭'), ('tíng', '廷'), ('tíng', '婷'), ('tíng', '霆'), ('tíng', '蜓'),
              ('tíng', '邒'), ('tíng', '莛'), ('tíng', '嵉'), ('tíng', '渟'), ('tíng', '筳'), ('tíng', '葶'), ('tíng', '楟'),
              ('tíng', '榳'), ('tíng', '閮'), ('tíng', '聤'), ('tíng', '蝏'), ('tíng', '諪'), ('tíng', '鼮'), ('tíng', '㼗'),
              ('tíng', '㹶'), ('tíng', '䱓'), ('tíng', '䗴'), ('tíng', '䫖')]
    ting_3 = [('tǐng', '挺'), ('tǐng', '艇'), ('tǐng', '町'), ('tǐng', '铤'), ('tǐng', '圢'), ('tǐng', '甼'), ('tǐng', '侹'),
              ('tǐng', '侱'), ('tǐng', '娗'), ('tǐng', '涏'), ('tǐng', '梃'), ('tǐng', '烶'), ('tǐng', '珽'), ('tǐng', '脡'),
              ('tǐng', '颋'), ('tǐng', '誔'), ('tǐng', '鋌'), ('tǐng', '頲'), ('tǐng', '䅍'), ('tǐng', '䦐'), ('tǐng', '䋼'),
              ('tǐng', '䵺')]
    ting_4 = [('tìng', '忊'), ('tìng', '濎')]
    tong_1 = [('tōng', '通'), ('tōng', '囲'), ('tōng', '炵'), ('tōng', '痌'), ('tōng', '絧'), ('tōng', '嗵'), ('tōng', '蓪'),
              ('tōng', '樋')]
    tong_2 = [('tóng', '同'), ('tóng', '童'), ('tóng', '铜'), ('tóng', '桐'), ('tóng', '彤'), ('tóng', '佟'), ('tóng', '瞳'),
              ('tóng', '僮'), ('tóng', '潼'), ('tóng', '峒'), ('tóng', '仝'), ('tóng', '侗'), ('tóng', '峂'), ('tóng', '庝'),
              ('tóng', '哃'), ('tóng', '垌'), ('tóng', '峝'), ('tóng', '狪'), ('tóng', '茼'), ('tóng', '晍'), ('tóng', '浵'),
              ('tóng', '烔'), ('tóng', '砼'), ('tóng', '蚒'), ('tóng', '偅'), ('tóng', '眮'), ('tóng', '秱'), ('tóng', '硧'),
              ('tóng', '粡'), ('tóng', '詷'), ('tóng', '赨'), ('tóng', '酮'), ('tóng', '鉖'), ('tóng', '勭'), ('tóng', '鉵'),
              ('tóng', '銅'), ('tóng', '餇'), ('tóng', '鲖'), ('tóng', '獞'), ('tóng', '曈'), ('tóng', '朣'), ('tóng', '橦'),
              ('tóng', '氃'), ('tóng', '燑'), ('tóng', '犝'), ('tóng', '膧'), ('tóng', '穜'), ('tóng', '鮦'), ('tóng', '㠽'),
              ('tóng', '㤏'), ('tóng', '㣚'), ('tóng', '㣠'), ('tóng', '㸗'), ('tóng', '㼧'), ('tóng', '䂈'), ('tóng', '䆚'),
              ('tóng', '㮔'), ('tóng', '㠉'), ('tóng', '㼿'), ('tóng', '䳋'), ('tóng', '䶱'), ('tóng', '䮵'), ('tóng', '䴀')]
    tong_3 = [('tǒng', '统'), ('tǒng', '桶'), ('tǒng', '筒'), ('tǒng', '捅'), ('tǒng', '統'), ('tǒng', '筩'), ('tǒng', '綂'),
              ('tǒng', '㛚'), ('tǒng', '㪌'), ('tǒng', '䆹')]
    tong_4 = [('tòng', '痛'), ('tòng', '恸'), ('tòng', '衕'), ('tòng', '慟'), ('tòng', '憅')]
    tou_1 = [('tōu', '偷'), ('tōu', '愉'), ('tōu', '偸'), ('tōu', '婾'), ('tōu', '媮'), ('tōu', '緰'), ('tōu', '鋀'),
             ('tōu', '鍮')]
    tou_2 = [('tóu', '头'), ('tóu', '投'), ('tóu', '骰'), ('tóu', '亠'), ('tóu', '頭'), ('tóu', '㓱'), ('tóu', '㡏'),
             ('tóu', '㢏'), ('tóu', '䕱'), ('tóu', '䵉')]
    tou_3 = [('tǒu', '妵'), ('tǒu', '紏'), ('tǒu', '敨'), ('tǒu', '飳'), ('tǒu', '斢'), ('tǒu', '黈'), ('tǒu', '蘣'),
             ('tǒu', '㳆'), ('tǒu', '㼥'), ('tǒu', '䚵'), ('tǒu', '㪗'), ('tǒu', '䡩'), ('tǒu', '䱏')]
    tou_4 = [('tòu', '透'), ('tòu', '埱'), ('tòu', '㕻'), ('tòu', '㤟'), ('tòu', '㖣'), ('tòu', '㰯'), ('tòu', '䟝'),
             ('tòu', '䞬')]
    tu_1 = [('tū', '突'), ('tū', '秃'), ('tū', '凸'), ('tū', '宊'), ('tū', '禿'), ('tū', '怢'), ('tū', '涋'), ('tū', '捸'),
            ('tū', '堗'), ('tū', '湥'), ('tū', '痜'), ('tū', '葖'), ('tū', '嶀'), ('tū', '鋵'), ('tū', '鵚'), ('tū', '鼵'),
            ('tū', '㟮')]
    tu_2 = [('tú', '图'), ('tú', '徒'), ('tú', '途'), ('tú', '涂'), ('tú', '屠'), ('tú', '荼'), ('tú', '図'), ('tú', '凃'),
            ('tú', '峹'), ('tú', '庩'), ('tú', '悇'), ('tú', '捈'), ('tú', '啚'), ('tú', '梌'), ('tú', '揬'), ('tú', '稌'),
            ('tú', '趃'), ('tú', '塗'), ('tú', '嵞'), ('tú', '瘏'), ('tú', '筡'), ('tú', '腯'), ('tú', '蒤'), ('tú', '鈯'),
            ('tú', '圖'), ('tú', '圗'), ('tú', '廜'), ('tú', '摕'), ('tú', '潳'), ('tú', '瑹'), ('tú', '跿'), ('tú', '酴'),
            ('tú', '墿'), ('tú', '馟'), ('tú', '檡'), ('tú', '鍎'), ('tú', '駼'), ('tú', '鵌'), ('tú', '鶟'), ('tú', '鷋'),
            ('tú', '鷵'), ('tú', '䣄'), ('tú', '㻌'), ('tú', '㭸'), ('tú', '㻠'), ('tú', '䣝'), ('tú', '㻬'), ('tú', '㻯'),
            ('tú', '䅷'), ('tú', '䠈'), ('tú', '䖘'), ('tú', '䤅'), ('tú', '䩣'), ('tú', '䳜'), ('tú', '䴛')]
    tu_3 = [('tǔ', '土'), ('tǔ', '吐'), ('tǔ', '圡'), ('tǔ', '钍'), ('tǔ', '唋'), ('tǔ', '釷'), ('tǔ', '㐋')]
    tu_4 = [('tù', '兔'), ('tù', '菟'), ('tù', '兎'), ('tù', '迌'), ('tù', '莵'), ('tù', '堍'), ('tù', '鋀'), ('tù', '鵵'),
            ('tù', '䭭')]
    tu_5 = [('tu', '汢')]
    tuan_1 = [('tuān', '湍'), ('tuān', '猯'), ('tuān', '圕'), ('tuān', '煓'), ('tuān', '貒'), ('tuān', '䵎')]
    tuan_2 = [('tuán', '团'), ('tuán', '揣'), ('tuán', '抟'), ('tuán', '団'), ('tuán', '剸'), ('tuán', '團'), ('tuán', '塼'),
              ('tuán', '慱'), ('tuán', '摶'), ('tuán', '漙'), ('tuán', '槫'), ('tuán', '篿'), ('tuán', '檲'), ('tuán', '鏄'),
              ('tuán', '糰'), ('tuán', '鷒'), ('tuán', '鷻'), ('tuán', '㩛'), ('tuán', '䊜'), ('tuán', '䳪')]
    tuan_3 = [('tuǎn', '畽'), ('tuǎn', '墥'), ('tuǎn', '疃'), ('tuǎn', '䜝'), ('tuǎn', '䵯')]
    tuan_4 = [('tuàn', '彖'), ('tuàn', '湪'), ('tuàn', '褖')]
    tui_1 = [('tuī', '推'), ('tuī', '忒'), ('tuī', '蓷'), ('tuī', '藬'), ('tuī', '讉')]
    tui_2 = [('tuí', '弟'), ('tuí', '颓'), ('tuí', '弚'), ('tuí', '隤'), ('tuí', '墤'), ('tuí', '尵'), ('tuí', '橔'),
             ('tuí', '頹'), ('tuí', '頺'), ('tuí', '頽'), ('tuí', '魋'), ('tuí', '穨'), ('tuí', '蘈'), ('tuí', '蹪'),
             ('tuí', '䍾'), ('tuí', '㢈'), ('tuí', '䀃'), ('tuí', '㢑'), ('tuí', '㾯'), ('tuí', '㾽'), ('tuí', '䅪'),
             ('tuí', '㿉'), ('tuí', '䫋'), ('tuí', '㿗')]
    tui_3 = [('tuǐ', '腿'), ('tuǐ', '俀'), ('tuǐ', '聉'), ('tuǐ', '僓'), ('tuǐ', '蹆'), ('tuǐ', '骽'), ('tuǐ', '㞂'),
             ('tuǐ', '㱣'), ('tuǐ', '㾼'), ('tuǐ', '㰐')]
    tui_4 = [('tuì', '退'), ('tuì', '褪'), ('tuì', '蜕'), ('tuì', '侻'), ('tuì', '娧'), ('tuì', '煺'), ('tuì', '蛻'),
             ('tuì', '螁'), ('tuì', '駾'), ('tuì', '㥆'), ('tuì', '㷟'), ('tuì', '㦌'), ('tuì', '䩣')]
    tun_1 = [('tūn', '吞'), ('tūn', '呑'), ('tūn', '旽'), ('tūn', '涒'), ('tūn', '啍'), ('tūn', '朜'), ('tūn', '焞'),
             ('tūn', '噋'), ('tūn', '憞'), ('tūn', '暾')]
    tun_2 = [('tún', '屯'), ('tún', '臀'), ('tún', '豚'), ('tún', '囤'), ('tún', '饨'), ('tún', '坉'), ('tún', '庉'),
             ('tún', '忳'), ('tún', '芚'), ('tún', '蛌'), ('tún', '豘'), ('tún', '軘'), ('tún', '飩'), ('tún', '鲀'),
             ('tún', '魨'), ('tún', '霕'), ('tún', '黗'), ('tún', '臋'), ('tún', '㹠'), ('tún', '㼊'), ('tún', '㞘'),
             ('tún', '㩔')]
    tun_3 = [('tǔn', '氽'), ('tǔn', '㖔')]
    tun_4 = [('tùn', '褪'), ('tùn', '㧷')]
    tuo_1 = [('tuō', '脱'), ('tuō', '托'), ('tuō', '拖'), ('tuō', '乇'), ('tuō', '仛'), ('tuō', '讬'), ('tuō', '扡'),
             ('tuō', '汑'), ('tuō', '饦'), ('tuō', '杔'), ('tuō', '侂'), ('tuō', '咃'), ('tuō', '咜'), ('tuō', '拕'),
             ('tuō', '沰'), ('tuō', '挩'), ('tuō', '捝'), ('tuō', '莌'), ('tuō', '袥'), ('tuō', '託'), ('tuō', '啴'),
             ('tuō', '涶'), ('tuō', '脫'), ('tuō', '飥'), ('tuō', '馲'), ('tuō', '魠'), ('tuō', '鮵'), ('tuō', '䴱')]
    tuo_2 = [('tuó', '陀'), ('tuó', '驼'), ('tuó', '驮'), ('tuó', '佗'), ('tuó', '沱'), ('tuó', '鸵'), ('tuó', '橐'),
             ('tuó', '跎'), ('tuó', '酡'), ('tuó', '鼍'), ('tuó', '阤'), ('tuó', '陁'), ('tuó', '坨'), ('tuó', '岮'),
             ('tuó', '沲'), ('tuó', '狏'), ('tuó', '侻'), ('tuó', '柁'), ('tuó', '砣'), ('tuó', '砤'), ('tuó', '袉'),
             ('tuó', '铊'), ('tuó', '紽'), ('tuó', '堶'), ('tuó', '媠'), ('tuó', '詑'), ('tuó', '碢'), ('tuó', '鉈'),
             ('tuó', '馱'), ('tuó', '槖'), ('tuó', '駄'), ('tuó', '鋖'), ('tuó', '駝'), ('tuó', '駞'), ('tuó', '鮀'),
             ('tuó', '鴕'), ('tuó', '鼧'), ('tuó', '騨'), ('tuó', '驒'), ('tuó', '驝'), ('tuó', '鼉'), ('tuó', '㸰'),
             ('tuó', '㸱'), ('tuó', '㼠'), ('tuó', '㾃'), ('tuó', '䍫'), ('tuó', '䡐'), ('tuó', '䪑'), ('tuó', '䭾'),
             ('tuó', '䰿')]
    tuo_3 = [('tuǒ', '妥'), ('tuǒ', '椭'), ('tuǒ', '彵'), ('tuǒ', '庹'), ('tuǒ', '楕'), ('tuǒ', '嫷'), ('tuǒ', '撱'),
             ('tuǒ', '橢'), ('tuǒ', '鵎'), ('tuǒ', '鰖'), ('tuǒ', '㟎'), ('tuǒ', '䓕'), ('tuǒ', '䲦'), ('tuǒ', '㯐'),
             ('tuǒ', '㰐'), ('tuǒ', '䲊')]
    tuo_4 = [('tuò', '拓'), ('tuò', '唾'), ('tuò', '箨'), ('tuò', '杝'), ('tuò', '柝'), ('tuò', '毤'), ('tuò', '萚'),
             ('tuò', '跅'), ('tuò', '毻'), ('tuò', '嶞'), ('tuò', '蘀'), ('tuò', '籜')]
    wa_1 = [('wā', '挖'), ('wā', '哇'), ('wā', '凹'), ('wā', '蛙'), ('wā', '洼'), ('wā', '娲'), ('wā', '屲'), ('wā', '穵'),
            ('wā', '呙'), ('wā', '劸'), ('wā', '咼'), ('wā', '徍'), ('wā', '畖'), ('wā', '窊'), ('wā', '唲'), ('wā', '啘'),
            ('wā', '媧'), ('wā', '窐'), ('wā', '嗗'), ('wā', '瓾'), ('wā', '搲'), ('wā', '溛'), ('wā', '漥'), ('wā', '窪'),
            ('wā', '鼃'), ('wā', '攨'), ('wā', '韈'), ('wā', '䖯'), ('wā', '䯉'), ('wā', '䵷')]
    wa_2 = [('wá', '娃'), ('wá', '㰪')]
    wa_3 = [('wǎ', '瓦'), ('wǎ', '佤'), ('wǎ', '邷'), ('wǎ', '咓'), ('wǎ', '砙'), ('wǎ', '瓸'), ('wǎ', '㧚'), ('wǎ', '㼘')]
    wa_4 = [('wà', '袜'), ('wà', '婠'), ('wà', '帓'), ('wà', '聉'), ('wà', '嗢'), ('wà', '腽'), ('wà', '膃'), ('wà', '韎'),
            ('wà', '襪'), ('wà', '韤'), ('wà', '䎳'), ('wà', '䍪'), ('wà', '䚴'), ('wà', '㒝'), ('wà', '䠚')]
    wa_5 = []
    wai_1 = [('wāi', '歪'), ('wāi', '呙'), ('wāi', '咼'), ('wāi', '喎'), ('wāi', '竵'), ('wāi', '瀤'), ('wāi', '㖞')]
    wai_2 = [('wǎi', '崴')]
    wai_3 = [('wài', '外'), ('wài', '顡'), ('wài', '㨤'), ('wài', '䠿'), ('wài', '䶐')]
    wan_1 = [('wān', '湾'), ('wān', '弯'), ('wān', '蜿'), ('wān', '剜'), ('wān', '婠'), ('wān', '豌'), ('wān', '毌'),
             ('wān', '帵'), ('wān', '塆'), ('wān', '睕'), ('wān', '潫'), ('wān', '彎'), ('wān', '壪'), ('wān', '灣')]
    wan_2 = [('wán', '完'), ('wán', '玩'), ('wán', '顽'), ('wán', '丸'), ('wán', '纨'), ('wán', '烷'), ('wán', '刓'),
             ('wán', '汍'), ('wán', '芄'), ('wán', '岏'), ('wán', '忨'), ('wán', '抏'), ('wán', '杬'), ('wán', '笂'),
             ('wán', '紈'), ('wán', '捖'), ('wán', '蚖'), ('wán', '琓'), ('wán', '貦'), ('wán', '頑'), ('wán', '翫'),
             ('wán', '㝴'), ('wán', '䯈'), ('wán', '䵥')]
    wan_3 = [('wǎn', '晚'), ('wǎn', '碗'), ('wǎn', '婉'), ('wǎn', '挽'), ('wǎn', '宛'), ('wǎn', '惋'), ('wǎn', '莞'),
             ('wǎn', '绾'), ('wǎn', '琬'), ('wǎn', '皖'), ('wǎn', '畹'), ('wǎn', '夗'), ('wǎn', '夘'), ('wǎn', '倇'),
             ('wǎn', '唍'), ('wǎn', '盌'), ('wǎn', '莬'), ('wǎn', '埦'), ('wǎn', '晥'), ('wǎn', '梚'), ('wǎn', '涴'),
             ('wǎn', '脘'), ('wǎn', '菀'), ('wǎn', '萖'), ('wǎn', '惌'), ('wǎn', '晩'), ('wǎn', '晼'), ('wǎn', '椀'),
             ('wǎn', '箢'), ('wǎn', '綩'), ('wǎn', '綰'), ('wǎn', '輓'), ('wǎn', '踠'), ('wǎn', '鋔'), ('wǎn', '鋺'),
             ('wǎn', '㼝'), ('wǎn', '㽹'), ('wǎn', '㝃'), ('wǎn', '㽜'), ('wǎn', '䏦'), ('wǎn', '䖤'), ('wǎn', '䅋'),
             ('wǎn', '䂺'), ('wǎn', '䘼'), ('wǎn', '䑱'), ('wǎn', '䗕'), ('wǎn', '䛷'), ('wǎn', '䝹'), ('wǎn', '㿸'),
             ('wǎn', '䈮'), ('wǎn', '䳃'), ('wǎn', '䩊')]
    wan_4 = [('wàn', '万'), ('wàn', '腕'), ('wàn', '蔓'), ('wàn', '綄'), ('wàn', '卍'), ('wàn', '卐'), ('wàn', '妧'),
             ('wàn', '杤'), ('wàn', '捥'), ('wàn', '脕'), ('wàn', '掔'), ('wàn', '萬'), ('wàn', '絻'), ('wàn', '輐'),
             ('wàn', '槾'), ('wàn', '澫'), ('wàn', '鋄'), ('wàn', '瞣'), ('wàn', '薍'), ('wàn', '錽'), ('wàn', '蟃'),
             ('wàn', '贃'), ('wàn', '鎫'), ('wàn', '贎'), ('wàn', '㸘'), ('wàn', '䯛'), ('wàn', '䥑')]
    wang_1 = [('wāng', '汪'), ('wāng', '尣'), ('wāng', '尪'), ('wāng', '尫'), ('wāng', '尩')]
    wang_2 = [('wáng', '王'), ('wáng', '亡'), ('wáng', '亾'), ('wáng', '兦'), ('wáng', '仼'), ('wáng', '莣'), ('wáng', '蚟'),
              ('wáng', '朚')]
    wang_3 = [('wǎng', '往'), ('wǎng', '网'), ('wǎng', '枉'), ('wǎng', '惘'), ('wǎng', '罔'), ('wǎng', '魍'), ('wǎng', '罓'),
              ('wǎng', '罒'), ('wǎng', '彺'), ('wǎng', '忹'), ('wǎng', '抂'), ('wǎng', '徃'), ('wǎng', '罖'), ('wǎng', '迬'),
              ('wǎng', '菵'), ('wǎng', '暀'), ('wǎng', '棢'), ('wǎng', '蛧'), ('wǎng', '辋'), ('wǎng', '網'), ('wǎng', '蝄'),
              ('wǎng', '誷'), ('wǎng', '輞'), ('wǎng', '瀇'), ('wǎng', '㓁'), ('wǎng', '㲿'), ('wǎng', '䒽'), ('wǎng', '䋄'),
              ('wǎng', '㳹'), ('wǎng', '㴏'), ('wǎng', '䋞'), ('wǎng', '䰣')]
    wang_4 = [('wàng', '望'), ('wàng', '忘'), ('wàng', '妄'), ('wàng', '旺'), ('wàng', '迋'), ('wàng', '盳'), ('wàng', '徍'),
              ('wàng', '朢'), ('wàng', '㔞'), ('wàng', '䛃'), ('wàng', '䤑')]
    wei_1 = [('wēi', '微'), ('wēi', '威'), ('wēi', '危'), ('wēi', '薇'), ('wēi', '偎'), ('wēi', '巍'), ('wēi', '倭'),
             ('wēi', '葳'), ('wēi', '逶'), ('wēi', '崴'), ('wēi', '煨'), ('wēi', '厃'), ('wēi', '烓'), ('wēi', '隇'),
             ('wēi', '隈'), ('wēi', '喴'), ('wēi', '媙'), ('wēi', '嵔'), ('wēi', '愄'), ('wēi', '揋'), ('wēi', '揻'),
             ('wēi', '葨'), ('wēi', '椳'), ('wēi', '楲'), ('wēi', '溦'), ('wēi', '詴'), ('wēi', '蜲'), ('wēi', '縅'),
             ('wēi', '蝛'), ('wēi', '覣'), ('wēi', '嶶'), ('wēi', '燰'), ('wēi', '鳂'), ('wēi', '癐'), ('wēi', '癓'),
             ('wēi', '鰃'), ('wēi', '鰄'), ('wēi', '霺')]
    wei_2 = [('wéi', '为'), ('wéi', '维'), ('wéi', '围'), ('wéi', '唯'), ('wéi', '韦'), ('wéi', '违'), ('wéi', '惟'),
             ('wéi', '帷'), ('wéi', '囗'), ('wéi', '桅'), ('wéi', '帏'), ('wéi', '闱'), ('wéi', '圩'), ('wéi', '嵬'),
             ('wéi', '潍'), ('wéi', '囲'), ('wéi', '沩'), ('wéi', '隹'), ('wéi', '峗'), ('wéi', '峞'), ('wéi', '洈'),
             ('wéi', '為'), ('wéi', '韋'), ('wéi', '涠'), ('wéi', '硙'), ('wéi', '喡'), ('wéi', '圍'), ('wéi', '媁'),
             ('wéi', '幃'), ('wéi', '湋'), ('wéi', '溈'), ('wéi', '爲'), ('wéi', '琟'), ('wéi', '違'), ('wéi', '維'),
             ('wéi', '蓶'), ('wéi', '鄬'), ('wéi', '撝'), ('wéi', '潙'), ('wéi', '潿'), ('wéi', '醀'), ('wéi', '濰'),
             ('wéi', '鍏'), ('wéi', '闈'), ('wéi', '鮠'), ('wéi', '壝'), ('wéi', '矀'), ('wéi', '覹'), ('wéi', '犩'),
             ('wéi', '欈'), ('wéi', '㧑'), ('wéi', '䣀'), ('wéi', '㣲'), ('wéi', '䔺'), ('wéi', '䧦'), ('wéi', '㕒'),
             ('wéi', '䙟'), ('wéi', '䜅'), ('wéi', '䝐'), ('wéi', '䉠'), ('wéi', '䑊'), ('wéi', '䥩'), ('wéi', '䲘')]
    wei_3 = [('wěi', '委'), ('wěi', '伟'), ('wěi', '尾'), ('wěi', '伪'), ('wěi', '纬'), ('wěi', '苇'), ('wěi', '玮'),
             ('wěi', '炜'), ('wěi', '萎'), ('wěi', '娓'), ('wěi', '猥'), ('wěi', '诿'), ('wěi', '隗'), ('wěi', '暐'),
             ('wěi', '芛'), ('wěi', '洧'), ('wěi', '屗'), ('wěi', '捤'), ('wěi', '浘'), ('wěi', '荱'), ('wěi', '偉'),
             ('wěi', '偽'), ('wěi', '唩'), ('wěi', '崣'), ('wěi', '捼'), ('wěi', '梶'), ('wěi', '痏'), ('wěi', '硊'),
             ('wěi', '骩'), ('wěi', '廆'), ('wěi', '徫'), ('wěi', '愇'), ('wěi', '渨'), ('wěi', '葦'), ('wěi', '蒍'),
             ('wěi', '骪'), ('wěi', '骫'), ('wěi', '椲'), ('wěi', '煒'), ('wěi', '瑋'), ('wěi', '痿'), ('wěi', '腲'),
             ('wěi', '艉'), ('wěi', '韪'), ('wěi', '僞'), ('wěi', '嶉'), ('wěi', '撱'), ('wěi', '碨'), ('wěi', '磈'),
             ('wěi', '鲔'), ('wěi', '寪'), ('wěi', '緯'), ('wěi', '蔿'), ('wěi', '諉'), ('wěi', '踓'), ('wěi', '韑'),
             ('wěi', '頠'), ('wěi', '薳'), ('wěi', '儰'), ('wěi', '濻'), ('wěi', '鍡'), ('wěi', '鮪'), ('wěi', '瀢'),
             ('wěi', '韙'), ('wěi', '颹'), ('wěi', '韡'), ('wěi', '亹'), ('wěi', '瓗'), ('wěi', '斖'), ('wěi', '㞑'),
             ('wěi', '㭏'), ('wěi', '㖐'), ('wěi', '㸵'), ('wěi', '䓕'), ('wěi', '㢻'), ('wěi', '㛱'), ('wěi', '㞇'),
             ('wěi', '㟪'), ('wěi', '㟴'), ('wěi', '㨊'), ('wěi', '㨒'), ('wěi', '㥨'), ('wěi', '㱬'), ('wěi', '䇻'),
             ('wěi', '㠕'), ('wěi', '㾯'), ('wěi', '䍴'), ('wěi', '䗆'), ('wěi', '䞔'), ('wěi', '䩞'), ('wěi', '䍷'),
             ('wěi', '䛪'), ('wěi', '䬿'), ('wěi', '㬙'), ('wěi', '䃬'), ('wěi', '䬐'), ('wěi', '䵋'), ('wěi', '䈧'),
             ('wěi', '䪘'), ('wěi', '䫥'), ('wěi', '䱞'), ('wěi', '䦱')]
    wei_4 = [('wèi', '位'), ('wèi', '未'), ('wèi', '谓'), ('wèi', '味'), ('wèi', '卫'), ('wèi', '慰'), ('wèi', '魏'),
             ('wèi', '尉'), ('wèi', '喂'), ('wèi', '畏'), ('wèi', '胃'), ('wèi', '蔚'), ('wèi', '渭'), ('wèi', '猬'),
             ('wèi', '苿'), ('wèi', '叞'), ('wèi', '軎'), ('wèi', '猚'), ('wèi', '菋'), ('wèi', '媦'), ('wèi', '煟'),
             ('wèi', '墛'), ('wèi', '瞆'), ('wèi', '蜼'), ('wèi', '熭'), ('wèi', '犚'), ('wèi', '磑'), ('wèi', '緭'),
             ('wèi', '蝟'), ('wèi', '衛'), ('wèi', '懀'), ('wèi', '罻'), ('wèi', '衞'), ('wèi', '謂'), ('wèi', '餧'),
             ('wèi', '鮇'), ('wèi', '螱'), ('wèi', '褽'), ('wèi', '餵'), ('wèi', '藯'), ('wèi', '轊'), ('wèi', '鏏'),
             ('wèi', '霨'), ('wèi', '鳚'), ('wèi', '蘶'), ('wèi', '饖'), ('wèi', '讆'), ('wèi', '躗'), ('wèi', '讏'),
             ('wèi', '躛'), ('wèi', '㥜'), ('wèi', '㷉'), ('wèi', '䅏'), ('wèi', '䓺'), ('wèi', '䙿'), ('wèi', '㺔'),
             ('wèi', '㻰'), ('wèi', '䩈'), ('wèi', '䵢'), ('wèi', '䥆'), ('wèi', '䬑'), ('wèi', '㦣'), ('wèi', '䘙'),
             ('wèi', '䗽'), ('wèi', '䜜'), ('wèi', '䡺'), ('wèi', '䲁'), ('wèi', '䮹'), ('wèi', '䪋'), ('wèi', '䵳'),
             ('wèi', '䭳')]
    wen_1 = [('wēn', '温'), ('wēn', '瘟'), ('wēn', '韫'), ('wēn', '昷'), ('wēn', '塭'), ('wēn', '缊'), ('wēn', '榅'),
             ('wēn', '殟'), ('wēn', '溫'), ('wēn', '瑥'), ('wēn', '辒'), ('wēn', '榲'), ('wēn', '緼'), ('wēn', '縕'),
             ('wēn', '豱'), ('wēn', '輼'), ('wēn', '轀'), ('wēn', '鎾'), ('wēn', '饂'), ('wēn', '鳁'), ('wēn', '鞰'),
             ('wēn', '鰛'), ('wēn', '鰮')]
    wen_2 = [('wén', '文'), ('wén', '闻'), ('wén', '纹'), ('wén', '雯'), ('wén', '蚊'), ('wén', '玟'), ('wén', '彣'),
             ('wén', '芠'), ('wén', '炆'), ('wén', '紋'), ('wén', '蚉'), ('wén', '珳'), ('wén', '阌'), ('wén', '瘒'),
             ('wén', '聞'), ('wén', '馼'), ('wén', '駇'), ('wén', '魰'), ('wén', '鳼'), ('wén', '鴍'), ('wén', '螡'),
             ('wén', '閺'), ('wén', '閿'), ('wén', '蟁'), ('wén', '闅'), ('wén', '鼤'), ('wén', '繧'), ('wén', '闦'),
             ('wén', '㐎'), ('wén', '㑮'), ('wén', '䎹'), ('wén', '䎽'), ('wén', '䰚'), ('wén', '䦩'), ('wén', '䘇')]
    wen_3 = [('wěn', '稳'), ('wěn', '吻'), ('wěn', '紊'), ('wěn', '刎'), ('wěn', '伆'), ('wěn', '呅'), ('wěn', '忟'),
             ('wěn', '抆'), ('wěn', '呡'), ('wěn', '忞'), ('wěn', '歾'), ('wěn', '肳'), ('wěn', '桽'), ('wěn', '脗'),
             ('wěn', '穏'), ('wěn', '穩'), ('wěn', '䦷'), ('wěn', '㖧'), ('wěn', '㳷'), ('wěn', '㗃'), ('wěn', '㟩'),
             ('wěn', '㝧'), ('wěn', '㵮'), ('wěn', '㒚'), ('wěn', '䦤')]
    wen_4 = [('wèn', '问'), ('wèn', '汶'), ('wèn', '妏'), ('wèn', '莬'), ('wèn', '問'), ('wèn', '渂'), ('wèn', '揾'),
             ('wèn', '搵'), ('wèn', '絻'), ('wèn', '顐'), ('wèn', '璺'), ('wèn', '㡈'), ('wèn', '㼂'), ('wèn', '䭓'),
             ('wèn', '䭡')]
    weng_1 = [('wēng', '翁'), ('wēng', '嗡'), ('wēng', '鹟'), ('wēng', '聬'), ('wēng', '螉'), ('wēng', '鎓'), ('wēng', '鶲'),
              ('wēng', '䈵'), ('wēng', '䱵')]
    weng_2 = [('wěng', '勜'), ('wěng', '奣'), ('wěng', '塕'), ('wěng', '嵡'), ('wěng', '滃'), ('wěng', '蓊'), ('wěng', '暡'),
              ('wěng', '瞈'), ('wěng', '攚'), ('wěng', '㘢'), ('wěng', '䐥'), ('wěng', '䤰'), ('wěng', '㜲'), ('wěng', '㹙'),
              ('wěng', '㹚')]
    weng_3 = [('wèng', '瓮'), ('wèng', '蕹'), ('wèng', '甕'), ('wèng', '罋'), ('wèng', '齆'), ('wèng', '䨴')]
    wo_1 = [('wō', '窝'), ('wō', '喔'), ('wō', '涡'), ('wō', '倭'), ('wō', '挝'), ('wō', '蜗'), ('wō', '莴'), ('wō', '唩'),
            ('wō', '涹'), ('wō', '渦'), ('wō', '猧'), ('wō', '萵'), ('wō', '窩'), ('wō', '撾'), ('wō', '濄'), ('wō', '緺'),
            ('wō', '蝸'), ('wō', '踒'), ('wō', '薶')]
    wo_2 = [('wǒ', '我'), ('wǒ', '呙'), ('wǒ', '咼'), ('wǒ', '婐'), ('wǒ', '婑'), ('wǒ', '捰'), ('wǒ', '㦱'), ('wǒ', '㧴'),
            ('wǒ', '䂺'), ('wǒ', '䰀')]
    wo_3 = [('wò', '握'), ('wò', '卧'), ('wò', '沃'), ('wò', '渥'), ('wò', '幄'), ('wò', '斡'), ('wò', '龌'), ('wò', '仴'),
            ('wò', '肟'), ('wò', '枂'), ('wò', '臥'), ('wò', '偓'), ('wò', '捾'), ('wò', '涴'), ('wò', '媉'), ('wò', '焥'),
            ('wò', '硪'), ('wò', '楃'), ('wò', '腛'), ('wò', '瞃'), ('wò', '濣'), ('wò', '瓁'), ('wò', '臒'), ('wò', '馧'),
            ('wò', '龏'), ('wò', '齷'), ('wò', '䀑'), ('wò', '㱧'), ('wò', '䁊'), ('wò', '㠗'), ('wò', '㠛'), ('wò', '䠎'),
            ('wò', '䙠'), ('wò', '䩊'), ('wò', '䁷'), ('wò', '䮸')]
    wu_1 = [('wū', '屋'), ('wū', '乌'), ('wū', '污'), ('wū', '呜'), ('wū', '巫'), ('wū', '於'), ('wū', '诬'), ('wū', '邬'),
            ('wū', '圬'), ('wū', '弙'), ('wū', '扜'), ('wū', '扝'), ('wū', '汙'), ('wū', '汚'), ('wū', '杅'), ('wū', '杇'),
            ('wū', '洿'), ('wū', '钨'), ('wū', '烏'), ('wū', '剭'), ('wū', '窏'), ('wū', '釫'), ('wū', '鄔'), ('wū', '嗚'),
            ('wū', '誈'), ('wū', '歍'), ('wū', '誣'), ('wū', '箼'), ('wū', '螐'), ('wū', '鴮'), ('wū', '鎢'), ('wū', '鰞')]
    wu_2 = [('wú', '无'), ('wú', '吴'), ('wú', '吾'), ('wú', '亡'), ('wú', '梧'), ('wú', '毋'), ('wú', '芜'), ('wú', '蜈'),
            ('wú', '吳'), ('wú', '呉'), ('wú', '郚'), ('wú', '娪'), ('wú', '峿'), ('wú', '洖'), ('wú', '浯'), ('wú', '茣'),
            ('wú', '莁'), ('wú', '珸'), ('wú', '祦'), ('wú', '無'), ('wú', '铻'), ('wú', '鹀'), ('wú', '墲'), ('wú', '蕪'),
            ('wú', '鋘'), ('wú', '鋙'), ('wú', '橆'), ('wú', '璑'), ('wú', '蟱'), ('wú', '鯃'), ('wú', '鵐'), ('wú', '譕'),
            ('wú', '鼯'), ('wú', '鷡'), ('wú', '㐚'), ('wú', '㹳'), ('wú', '䓊'), ('wú', '㻍'), ('wú', '䦜'), ('wú', '㷻'),
            ('wú', '䍢'), ('wú', '䫓'), ('wú', '䮏'), ('wú', '䉑')]
    wu_3 = [('wǔ', '五'), ('wǔ', '武'), ('wǔ', '舞'), ('wǔ', '午'), ('wǔ', '伍'), ('wǔ', '侮'), ('wǔ', '捂'), ('wǔ', '鹉'),
            ('wǔ', '妩'), ('wǔ', '忤'), ('wǔ', '仵'), ('wǔ', '庑'), ('wǔ', '乄'), ('wǔ', '怃'), ('wǔ', '迕'), ('wǔ', '玝'),
            ('wǔ', '倵'), ('wǔ', '娒'), ('wǔ', '逜'), ('wǔ', '陚'), ('wǔ', '啎'), ('wǔ', '娬'), ('wǔ', '牾'), ('wǔ', '堥'),
            ('wǔ', '珷'), ('wǔ', '摀'), ('wǔ', '碔'), ('wǔ', '熓'), ('wǔ', '瑦'), ('wǔ', '嫵'), ('wǔ', '廡'), ('wǔ', '憮'),
            ('wǔ', '潕'), ('wǔ', '儛'), ('wǔ', '甒'), ('wǔ', '膴'), ('wǔ', '瞴'), ('wǔ', '鵡'), ('wǔ', '躌'), ('wǔ', '㐅'),
            ('wǔ', '㐏'), ('wǔ', '㑄'), ('wǔ', '㬳'), ('wǔ', '㒇'), ('wǔ', '䅶'), ('wǔ', '䟼'), ('wǔ', '䳇'), ('wǔ', '㵲'),
            ('wǔ', '䡧'), ('wǔ', '䒉')]
    wu_4 = [('wù', '务'), ('wù', '物'), ('wù', '恶'), ('wù', '误'), ('wù', '雾'), ('wù', '悟'), ('wù', '勿'), ('wù', '兀'),
            ('wù', '晤'), ('wù', '唔'), ('wù', '戊'), ('wù', '坞'), ('wù', '寤'), ('wù', '骛'), ('wù', '杌'), ('wù', '婺'),
            ('wù', '鹜'), ('wù', '阢'), ('wù', '屼'), ('wù', '扤'), ('wù', '岉'), ('wù', '沕'), ('wù', '芴'), ('wù', '忢'),
            ('wù', '旿'), ('wù', '矹'), ('wù', '俉'), ('wù', '卼'), ('wù', '敄'), ('wù', '柮'), ('wù', '務'), ('wù', '悞'),
            ('wù', '悮'), ('wù', '粅'), ('wù', '趶'), ('wù', '焐'), ('wù', '嵍'), ('wù', '惡'), ('wù', '渞'), ('wù', '痦'),
            ('wù', '隖'), ('wù', '靰'), ('wù', '塢'), ('wù', '奦'), ('wù', '嵨'), ('wù', '溩'), ('wù', '雺'), ('wù', '僫'),
            ('wù', '熃'), ('wù', '誤'), ('wù', '鋈'), ('wù', '窹'), ('wù', '霚'), ('wù', '鼿'), ('wù', '霧'), ('wù', '齀'),
            ('wù', '蘁'), ('wù', '騖'), ('wù', '鶩'), ('wù', '㐳'), ('wù', '㤇'), ('wù', '䀛'), ('wù', '㽾'), ('wù', '䦍'),
            ('wù', '㡔'), ('wù', '㱱'), ('wù', '䎸'), ('wù', '䚈'), ('wù', '䃖'), ('wù', '䛩'), ('wù', '䑁'), ('wù', '䨁'),
            ('wù', '䜑'), ('wù', '䳱')]
    xi_1 = [('xī', '西'), ('xī', '息'), ('xī', '希'), ('xī', '析'), ('xī', '吸'), ('xī', '惜'), ('xī', '悉'), ('xī', '夕'),
            ('xī', '昔'), ('xī', '溪'), ('xī', '嘻'), ('xī', '稀'), ('xī', '兮'), ('xī', '膝'), ('xī', '牺'), ('xī', '锡'),
            ('xī', '腊'), ('xī', '晰'), ('xī', '熙'), ('xī', '栖'), ('xī', '熄'), ('xī', '奚'), ('xī', '曦'), ('xī', '犀'),
            ('xī', '嬉'), ('xī', '皙'), ('xī', '羲'), ('xī', '蹊'), ('xī', '唏'), ('xī', '僖'), ('xī', '熹'), ('xī', '咭'),
            ('xī', '郗'), ('xī', '淅'), ('xī', '烯'), ('xī', '蟋'), ('xī', '汐'), ('xī', '晞'), ('xī', '欷'), ('xī', '翕'),
            ('xī', '蜥'), ('xī', '樨'), ('xī', '歙'), ('xī', '醯'), ('xī', '邜'), ('xī', '忚'), ('xī', '扱'), ('xī', '扸'),
            ('xī', '卥'), ('xī', '矽'), ('xī', '穸'), ('xī', '肸'), ('xī', '肹'), ('xī', '俙'), ('xī', '咥'), ('xī', '徆'),
            ('xī', '怸'), ('xī', '恓'), ('xī', '诶'), ('xī', '饻'), ('xī', '娭'), ('xī', '屖'), ('xī', '悕'), ('xī', '氥'),
            ('xī', '浠'), ('xī', '狶'), ('xī', '莃'), ('xī', '唽'), ('xī', '桸'), ('xī', '渓'), ('xī', '焁'), ('xī', '焈'),
            ('xī', '琋'), ('xī', '硒'), ('xī', '羛'), ('xī', '菥'), ('xī', '赥'), ('xī', '釸'), ('xī', '傒'), ('xī', '惁'),
            ('xī', '晳'), ('xī', '焟'), ('xī', '焬'), ('xī', '睎'), ('xī', '粞'), ('xī', '翖'), ('xī', '舾'), ('xī', '鄎'),
            ('xī', '厀'), ('xī', '嵠'), ('xī', '徯'), ('xī', '煕'), ('xī', '碏'), ('xī', '蒠'), ('xī', '裼'), ('xī', '榽'),
            ('xī', '熈'), ('xī', '獡'), ('xī', '緆'), ('xī', '覡'), ('xī', '誒'), ('xī', '豨'), ('xī', '閪'), ('xī', '餏'),
            ('xī', '噏'), ('xī', '嬆'), ('xī', '嶲'), ('xī', '潝'), ('xī', '瘜'), ('xī', '磎'), ('xī', '凞'), ('xī', '暿'),
            ('xī', '橀'), ('xī', '熺'), ('xī', '熻'), ('xī', '窸'), ('xī', '螅'), ('xī', '螇'), ('xī', '錫'), ('xī', '燨'),
            ('xī', '犠'), ('xī', '瞦'), ('xī', '礂'), ('xī', '谿'), ('xī', '豀'), ('xī', '豯'), ('xī', '貕'), ('xī', '巂'),
            ('xī', '糦'), ('xī', '繥'), ('xī', '雟'), ('xī', '鯑'), ('xī', '鵗'), ('xī', '觹'), ('xī', '譆'), ('xī', '鏭'),
            ('xī', '鐊'), ('xī', '隵'), ('xī', '嚱'), ('xī', '巇'), ('xī', '爔'), ('xī', '犧'), ('xī', '酅'), ('xī', '饎'),
            ('xī', '觽'), ('xī', '鼷'), ('xī', '蠵'), ('xī', '鸂'), ('xī', '觿'), ('xī', '鑴'), ('xī', '㕧'), ('xī', '䜣'),
            ('xī', '䙵'), ('xī', '㜎'), ('xī', '䖒'), ('xī', '㗩'), ('xī', '㮩'), ('xī', '㷩'), ('xī', '㯕'), ('xī', '㺣')]
    xi_2 = [('xí', '习'), ('xí', '席'), ('xí', '袭'), ('xí', '媳'), ('xí', '檄'), ('xí', '隰'), ('xí', '郋'), ('xí', '習'),
            ('xí', '觋'), ('xí', '雭'), ('xí', '喺'), ('xí', '椺'), ('xí', '蒵'), ('xí', '蓆'), ('xí', '嶍'), ('xí', '漝'),
            ('xí', '趘'), ('xí', '槢'), ('xí', '薂'), ('xí', '謵'), ('xí', '鎴'), ('xí', '霫'), ('xí', '鳛'), ('xí', '飁'),
            ('xí', '騱'), ('xí', '騽'), ('xí', '鰼'), ('xí', '襲'), ('xí', '驨'), ('xí', '䀘'), ('xí', '㤴'), ('xí', '㳧'),
            ('xí', '䏮'), ('xí', '㠄'), ('xí', '㦻'), ('xí', '㩗'), ('xí', '㿇'), ('xí', '䒁'), ('xí', '㵿'), ('xí', '䫣'),
            ('xí', '㔒'), ('xí', '䚫'), ('xí', '㽯')]
    xi_3 = [('xǐ', '喜'), ('xǐ', '洗'), ('xǐ', '洒'), ('xǐ', '玺'), ('xǐ', '徙'), ('xǐ', '禧'), ('xǐ', '铣'), ('xǐ', '屣'),
            ('xǐ', '杫'), ('xǐ', '枲'), ('xǐ', '葈'), ('xǐ', '葸'), ('xǐ', '鈢'), ('xǐ', '鉨'), ('xǐ', '鉩'), ('xǐ', '漇'),
            ('xǐ', '蓰'), ('xǐ', '銑'), ('xǐ', '憘'), ('xǐ', '憙'), ('xǐ', '橲'), ('xǐ', '歖'), ('xǐ', '諰'), ('xǐ', '壐'),
            ('xǐ', '縰'), ('xǐ', '謑'), ('xǐ', '鳃'), ('xǐ', '蟢'), ('xǐ', '蹝'), ('xǐ', '釐'), ('xǐ', '璽'), ('xǐ', '鰓'),
            ('xǐ', '瓕'), ('xǐ', '鱚'), ('xǐ', '囍'), ('xǐ', '矖'), ('xǐ', '纚'), ('xǐ', '躧'), ('xǐ', '㐂'), ('xǐ', '㪪'),
            ('xǐ', '䢄')]
    xi_4 = [('xì', '系'), ('xì', '细'), ('xì', '戏'), ('xì', '隙'), ('xì', '忾'), ('xì', '郄'), ('xì', '舄'), ('xì', '匸'),
            ('xì', '卌'), ('xì', '扢'), ('xì', '屃'), ('xì', '饩'), ('xì', '呬'), ('xì', '忥'), ('xì', '怬'), ('xì', '钑'),
            ('xì', '係'), ('xì', '恄'), ('xì', '欪'), ('xì', '盻'), ('xì', '郤'), ('xì', '屓'), ('xì', '欯'), ('xì', '绤'),
            ('xì', '細'), ('xì', '釳'), ('xì', '阋'), ('xì', '摡'), ('xì', '椞'), ('xì', '舃'), ('xì', '趇'), ('xì', '愾'),
            ('xì', '慀'), ('xì', '滊'), ('xì', '禊'), ('xì', '綌'), ('xì', '赩'), ('xì', '隟'), ('xì', '墍'), ('xì', '熂'),
            ('xì', '犔'), ('xì', '稧'), ('xì', '戯'), ('xì', '潟'), ('xì', '澙'), ('xì', '蕮'), ('xì', '覤'), ('xì', '戱'),
            ('xì', '縘'), ('xì', '黖'), ('xì', '戲'), ('xì', '磶'), ('xì', '虩'), ('xì', '餼'), ('xì', '鬩'), ('xì', '繫'),
            ('xì', '闟'), ('xì', '霼'), ('xì', '屭'), ('xì', '衋'), ('xì', '㳀'), ('xì', '㚛'), ('xì', '㞒'), ('xì', '㣟'),
            ('xì', '㹫'), ('xì', '䧍'), ('xì', '㤸'), ('xì', '㭡'), ('xì', '䓇'), ('xì', '䘮'), ('xì', '䚷'), ('xì', '㑶'),
            ('xì', '㥡'), ('xì', '䙽'), ('xì', '㱱'), ('xì', '㒆'), ('xì', '䚂'), ('xì', '䛥'), ('xì', '䲪'), ('xì', '㗲'),
            ('xì', '䊠'), ('xì', '䈪'), ('xì', '䐼'), ('xì', '䚉'), ('xì', '䦧'), ('xì', '䩤'), ('xì', '㱇'), ('xì', '䑂'),
            ('xì', '䜁'), ('xì', '䮎'), ('xì', '䫔'), ('xì', '䴛'), ('xì', '㙾'), ('xì', '㸍'), ('xì', '䨳'), ('xì', '䵱')]
    xia_1 = [('xiā', '瞎'), ('xiā', '虾'), ('xiā', '呷'), ('xiā', '虲'), ('xiā', '疨'), ('xiā', '谺'), ('xiā', '傄'),
             ('xiā', '閕'), ('xiā', '煆'), ('xiā', '颬'), ('xiā', '蝦'), ('xiā', '鰕'), ('xiā', '䠍')]
    xia_2 = [('xiá', '侠'), ('xiá', '霞'), ('xiá', '峡'), ('xiá', '狭'), ('xiá', '暇'), ('xiá', '匣'), ('xiá', '辖'),
             ('xiá', '遐'), ('xiá', '瑕'), ('xiá', '狎'), ('xiá', '黠'), ('xiá', '柙'), ('xiá', '俠'), ('xiá', '炠'),
             ('xiá', '陜'), ('xiá', '埉'), ('xiá', '峽'), ('xiá', '烚'), ('xiá', '狹'), ('xiá', '珨'), ('xiá', '祫'),
             ('xiá', '捾'), ('xiá', '硖'), ('xiá', '笚'), ('xiá', '翈'), ('xiá', '舺'), ('xiá', '陿'), ('xiá', '徦'),
             ('xiá', '硤'), ('xiá', '敮'), ('xiá', '筪'), ('xiá', '舝'), ('xiá', '瘕'), ('xiá', '碬'), ('xiá', '磍'),
             ('xiá', '蕸'), ('xiá', '縖'), ('xiá', '螛'), ('xiá', '赮'), ('xiá', '魻'), ('xiá', '轄'), ('xiá', '鍜'),
             ('xiá', '鎋'), ('xiá', '騢'), ('xiá', '鶷'), ('xiá', '䒠'), ('xiá', '㘡'), ('xiá', '䒩'), ('xiá', '䖎'),
             ('xiá', '䘥'), ('xiá', '㭱'), ('xiá', '㗇'), ('xiá', '㽠'), ('xiá', '䛅'), ('xiá', '㥦'), ('xiá', '㰺'),
             ('xiá', '䖖'), ('xiá', '㿣'), ('xiá', '䦖'), ('xiá', '䨐'), ('xiá', '㵤'), ('xiá', '䪗'), ('xiá', '䫗'),
             ('xiá', '䯟'), ('xiá', '䶝')]
    xia_3 = [('xiǎ', '閜')]
    xia_4 = [('xià', '下'), ('xià', '夏'), ('xià', '吓'), ('xià', '厦'), ('xià', '唬'), ('xià', '罅'), ('xià', '丅'),
             ('xià', '乤'), ('xià', '圷'), ('xià', '芐'), ('xià', '疜'), ('xià', '梺'), ('xià', '廈'), ('xià', '睱'),
             ('xià', '諕'), ('xià', '嚇'), ('xià', '懗'), ('xià', '夓'), ('xià', '鎼'), ('xià', '鏬'), ('xià', '㙈'),
             ('xià', '㙤'), ('xià', '㗿')]
    xian_1 = [('xiān', '先'), ('xiān', '仙'), ('xiān', '鲜'), ('xiān', '纤'), ('xiān', '掀'), ('xiān', '掺'), ('xiān', '暹'),
              ('xiān', '仚'), ('xiān', '屳'), ('xiān', '奾'), ('xiān', '佡'), ('xiān', '忺'), ('xiān', '氙'), ('xiān', '杴'),
              ('xiān', '欦'), ('xiān', '祆'), ('xiān', '秈'), ('xiān', '苮'), ('xiān', '姺'), ('xiān', '枮'), ('xiān', '籼'),
              ('xiān', '珗'), ('xiān', '莶'), ('xiān', '铦'), ('xiān', '綅'), ('xiān', '跹'), ('xiān', '酰'), ('xiān', '锨'),
              ('xiān', '僊'), ('xiān', '僲'), ('xiān', '嘕'), ('xiān', '摻'), ('xiān', '銛'), ('xiān', '銽'), ('xiān', '韯'),
              ('xiān', '嬐'), ('xiān', '憸'), ('xiān', '薟'), ('xiān', '鍁'), ('xiān', '繊'), ('xiān', '褼'), ('xiān', '韱'),
              ('xiān', '鮮'), ('xiān', '蹮'), ('xiān', '馦'), ('xiān', '孅'), ('xiān', '廯'), ('xiān', '攕'), ('xiān', '醶'),
              ('xiān', '纎'), ('xiān', '鶱'), ('xiān', '襳'), ('xiān', '躚'), ('xiān', '纖'), ('xiān', '鱻'), ('xiān', '䵌')]
    xian_2 = [('xián', '闲'), ('xián', '贤'), ('xián', '嫌'), ('xián', '弦'), ('xián', '衔'), ('xián', '咸'), ('xián', '娴'),
              ('xián', '涎'), ('xián', '舷'), ('xián', '痫'), ('xián', '伭'), ('xián', '咁'), ('xián', '妶'), ('xián', '臤'),
              ('xián', '唌'), ('xián', '挦'), ('xián', '玹'), ('xián', '盷'), ('xián', '胘'), ('xián', '娹'), ('xián', '婱'),
              ('xián', '絃'), ('xián', '蚿'), ('xián', '啣'), ('xián', '湺'), ('xián', '蛝'), ('xián', '閑'), ('xián', '閒'),
              ('xián', '鹇'), ('xián', '嗛'), ('xián', '溓'), ('xián', '衘'), ('xián', '甉'), ('xián', '銜'), ('xián', '嫺'),
              ('xián', '嫻'), ('xián', '憪'), ('xián', '撏'), ('xián', '澖'), ('xián', '稴'), ('xián', '羬'), ('xián', '誸'),
              ('xián', '賢'), ('xián', '諴'), ('xián', '輱'), ('xián', '醎'), ('xián', '癇'), ('xián', '癎'), ('xián', '瞯'),
              ('xián', '藖'), ('xián', '礥'), ('xián', '鹹'), ('xián', '麙'), ('xián', '贒'), ('xián', '鑦'), ('xián', '鷳'),
              ('xián', '鷴'), ('xián', '鷼'), ('xián', '㳄'), ('xián', '䒸'), ('xián', '㳭'), ('xián', '㡉'), ('xián', '㢺'),
              ('xián', '㛾'), ('xián', '㭹'), ('xián', '䝨'), ('xián', '㮭'), ('xián', '㵪'), ('xián', '㯗'), ('xián', '䦥'),
              ('xián', '㘅'), ('xián', '䕔'), ('xián', '㘋'), ('xián', '㩮'), ('xián', '䶠'), ('xián', '䶢'), ('xián', '䲗')]
    xian_3 = [('xiǎn', '显'), ('xiǎn', '险'), ('xiǎn', '洗'), ('xiǎn', '冼'), ('xiǎn', '铣'), ('xiǎn', '跣'), ('xiǎn', '藓'),
              ('xiǎn', '彡'), ('xiǎn', '狝'), ('xiǎn', '崄'), ('xiǎn', '毨'), ('xiǎn', '烍'), ('xiǎn', '猃'), ('xiǎn', '蚬'),
              ('xiǎn', '険'), ('xiǎn', '赻'), ('xiǎn', '筅'), ('xiǎn', '尟'), ('xiǎn', '尠'), ('xiǎn', '搟'), ('xiǎn', '禒'),
              ('xiǎn', '蜆'), ('xiǎn', '銑'), ('xiǎn', '箲'), ('xiǎn', '險'), ('xiǎn', '嶮'), ('xiǎn', '獫'), ('xiǎn', '獮'),
              ('xiǎn', '鍌'), ('xiǎn', '燹'), ('xiǎn', '顕'), ('xiǎn', '幰'), ('xiǎn', '攇'), ('xiǎn', '櫶'), ('xiǎn', '蘚'),
              ('xiǎn', '譣'), ('xiǎn', '玁'), ('xiǎn', '韅'), ('xiǎn', '顯'), ('xiǎn', '灦'), ('xiǎn', '㧋'), ('xiǎn', '䢾'),
              ('xiǎn', '㧥'), ('xiǎn', '䧋'), ('xiǎn', '㫫'), ('xiǎn', '㭠'), ('xiǎn', '䡅'), ('xiǎn', '㥦'), ('xiǎn', '䚚'),
              ('xiǎn', '㬎'), ('xiǎn', '䦘'), ('xiǎn', '㯀'), ('xiǎn', '㜪'), ('xiǎn', '㿅'), ('xiǎn', '䧮'), ('xiǎn', '㦥'),
              ('xiǎn', '㜷'), ('xiǎn', '㶍'), ('xiǎn', '䗾'), ('xiǎn', '䘆'), ('xiǎn', '䥪'), ('xiǎn', '䉳'), ('xiǎn', '䜢')]
    xian_4 = [('xiàn', '见'), ('xiàn', '现'), ('xiàn', '线'), ('xiàn', '县'), ('xiàn', '献'), ('xiàn', '限'), ('xiàn', '陷'),
              ('xiàn', '宪'), ('xiàn', '羡'), ('xiàn', '馅'), ('xiàn', '腺'), ('xiàn', '岘'), ('xiàn', '苋'), ('xiàn', '霰'),
              ('xiàn', '咞'), ('xiàn', '見'), ('xiàn', '臽'), ('xiàn', '姭'), ('xiàn', '県'), ('xiàn', '陥'), ('xiàn', '哯'),
              ('xiàn', '垷'), ('xiàn', '娊'), ('xiàn', '峴'), ('xiàn', '涀'), ('xiàn', '莧'), ('xiàn', '軐'), ('xiàn', '埳'),
              ('xiàn', '晛'), ('xiàn', '現'), ('xiàn', '硍'), ('xiàn', '睍'), ('xiàn', '絤'), ('xiàn', '綖'), ('xiàn', '缐'),
              ('xiàn', '塪'), ('xiàn', '搚'), ('xiàn', '粯'), ('xiàn', '羨'), ('xiàn', '僩'), ('xiàn', '僴'), ('xiàn', '槏'),
              ('xiàn', '綫'), ('xiàn', '誢'), ('xiàn', '撊'), ('xiàn', '線'), ('xiàn', '鋧'), ('xiàn', '憲'), ('xiàn', '橌'),
              ('xiàn', '橺'), ('xiàn', '縣'), ('xiàn', '錎'), ('xiàn', '餡'), ('xiàn', '壏'), ('xiàn', '懢'), ('xiàn', '豏'),
              ('xiàn', '麲'), ('xiàn', '瀗'), ('xiàn', '臔'), ('xiàn', '獻'), ('xiàn', '糮'), ('xiàn', '鏾'), ('xiàn', '鼸'),
              ('xiàn', '㔓'), ('xiàn', '㲽'), ('xiàn', '䀏'), ('xiàn', '㡾'), ('xiàn', '䄯'), ('xiàn', '㪇'), ('xiàn', '䏹'),
              ('xiàn', '䙹'), ('xiàn', '䐄'), ('xiàn', '䧟'), ('xiàn', '㺌'), ('xiàn', '䁂'), ('xiàn', '㔵'), ('xiàn', '㦑'),
              ('xiàn', '䇒'), ('xiàn', '㦓'), ('xiàn', '㩈'), ('xiàn', '㯠'), ('xiàn', '䨘'), ('xiàn', '䵇'), ('xiàn', '㬗'),
              ('xiàn', '䞁'), ('xiàn', '䤼'), ('xiàn', '㽉'), ('xiàn', '䭑'), ('xiàn', '䱤'), ('xiàn', '㱹'), ('xiàn', '䃱'),
              ('xiàn', '䵖'), ('xiàn', '䉯'), ('xiàn', '䃸'), ('xiàn', '䵛'), ('xiàn', '䶟'), ('xiàn', '䨷')]
    xiang_1 = [('xiāng', '相'), ('xiāng', '香'), ('xiāng', '乡'), ('xiāng', '箱'), ('xiāng', '湘'), ('xiāng', '厢'),
               ('xiāng', '襄'), ('xiāng', '镶'), ('xiāng', '缃'), ('xiāng', '骧'), ('xiāng', '芗'), ('xiāng', '郷'),
               ('xiāng', '啍'), ('xiāng', '鄉'), ('xiāng', '鄊'), ('xiāng', '廂'), ('xiāng', '萫'), ('xiāng', '葙'),
               ('xiāng', '鄕'), ('xiāng', '楿'), ('xiāng', '稥'), ('xiāng', '薌'), ('xiāng', '緗'), ('xiāng', '膷'),
               ('xiāng', '儴'), ('xiāng', '勷'), ('xiāng', '忀'), ('xiāng', '麘'), ('xiāng', '欀'), ('xiāng', '瓖'),
               ('xiāng', '鱜'), ('xiāng', '纕'), ('xiāng', '鑲'), ('xiāng', '驤')]
    xiang_2 = [('xiáng', '降'), ('xiáng', '羊'), ('xiáng', '祥'), ('xiáng', '详'), ('xiáng', '翔'), ('xiáng', '庠'),
               ('xiáng', '夅'), ('xiáng', '瓨'), ('xiáng', '佭'), ('xiáng', '羏'), ('xiáng', '栙'), ('xiáng', '絴'),
               ('xiáng', '詳'), ('xiáng', '跭'), ('xiáng', '㟄'), ('xiáng', '䇨'), ('xiáng', '䔗'), ('xiáng', '䜶'),
               ('xiáng', '䛠')]
    xiang_3 = [('xiǎng', '想'), ('xiǎng', '响'), ('xiǎng', '享'), ('xiǎng', '饷'), ('xiǎng', '飨'), ('xiǎng', '亯'),
               ('xiǎng', '蚃'), ('xiǎng', '晑'), ('xiǎng', '銄'), ('xiǎng', '餉'), ('xiǎng', '鲞'), ('xiǎng', '蠁'),
               ('xiǎng', '鮝'), ('xiǎng', '鯗'), ('xiǎng', '響'), ('xiǎng', '饗'), ('xiǎng', '饟'), ('xiǎng', '鱶'),
               ('xiǎng', '㐔'), ('xiǎng', '㖜'), ('xiǎng', '䙹'), ('xiǎng', '䖮'), ('xiǎng', '㗽'), ('xiǎng', '䊑'),
               ('xiǎng', '䒂')]
    xiang_4 = [('xiàng', '向'), ('xiàng', '像'), ('xiàng', '象'), ('xiàng', '项'), ('xiàng', '巷'), ('xiàng', '橡'),
               ('xiàng', '姠'), ('xiàng', '珦'), ('xiàng', '缿'), ('xiàng', '衖'), ('xiàng', '項'), ('xiàng', '勨'),
               ('xiàng', '嶑'), ('xiàng', '潒'), ('xiàng', '銗'), ('xiàng', '閧'), ('xiàng', '曏'), ('xiàng', '襐'),
               ('xiàng', '闂'), ('xiàng', '嚮'), ('xiàng', '蟓'), ('xiàng', '鐌'), ('xiàng', '鱌'), ('xiàng', '㟟'),
               ('xiàng', '䢽'), ('xiàng', '䐟'), ('xiàng', '䣈'), ('xiàng', '䦳'), ('xiàng', '䤔'), ('xiàng', '䴂')]
    xiao_1 = [('xiāo', '消'), ('xiāo', '销'), ('xiāo', '萧'), ('xiāo', '削'), ('xiāo', '肖'), ('xiāo', '霄'), ('xiāo', '宵'),
              ('xiāo', '潇'), ('xiāo', '逍'), ('xiāo', '箫'), ('xiāo', '嚣'), ('xiāo', '枭'), ('xiāo', '绡'), ('xiāo', '骁'),
              ('xiāo', '硝'), ('xiāo', '魈'), ('xiāo', '灱'), ('xiāo', '灲'), ('xiāo', '呺'), ('xiāo', '侾'), ('xiāo', '哓'),
              ('xiāo', '枵'), ('xiāo', '宯'), ('xiāo', '庨'), ('xiāo', '烋'), ('xiāo', '莦'), ('xiāo', '虓'), ('xiāo', '鸮'),
              ('xiāo', '婋'), ('xiāo', '梟'), ('xiāo', '焇'), ('xiāo', '猇'), ('xiāo', '痚'), ('xiāo', '痟'), ('xiāo', '睄'),
              ('xiāo', '硣'), ('xiāo', '窙'), ('xiāo', '翛'), ('xiāo', '嗃'), ('xiāo', '揱'), ('xiāo', '綃'), ('xiāo', '蛸'),
              ('xiāo', '嘐'), ('xiāo', '歊'), ('xiāo', '熇'), ('xiāo', '踃'), ('xiāo', '嘵'), ('xiāo', '憢'), ('xiāo', '撨'),
              ('xiāo', '獟'), ('xiāo', '獢'), ('xiāo', '箾'), ('xiāo', '銷'), ('xiāo', '骹'), ('xiāo', '彇'), ('xiāo', '膮'),
              ('xiāo', '蕭'), ('xiāo', '颵'), ('xiāo', '鴞'), ('xiāo', '穘'), ('xiāo', '簘'), ('xiāo', '藃'), ('xiāo', '蟂'),
              ('xiāo', '蟏'), ('xiāo', '鴵'), ('xiāo', '瀟'), ('xiāo', '簫'), ('xiāo', '蟰'), ('xiāo', '髇'), ('xiāo', '櫹'),
              ('xiāo', '嚻'), ('xiāo', '囂'), ('xiāo', '髐'), ('xiāo', '鷍'), ('xiāo', '蠨'), ('xiāo', '驍'), ('xiāo', '毊'),
              ('xiāo', '虈'), ('xiāo', '㺒'), ('xiāo', '㩋')]
    xiao_2 = [('xiáo', '姣'), ('xiáo', '淆'), ('xiáo', '洨'), ('xiáo', '郩'), ('xiáo', '崤'), ('xiáo', '訤'), ('xiáo', '殽'),
              ('xiáo', '誵'), ('xiáo', '㚣'), ('xiáo', '䒝'), ('xiáo', '㬵'), ('xiáo', '㑾')]
    xiao_3 = [('xiǎo', '小'), ('xiǎo', '晓'), ('xiǎo', '筱'), ('xiǎo', '暁'), ('xiǎo', '筿'), ('xiǎo', '皛'), ('xiǎo', '曉'),
              ('xiǎo', '篠'), ('xiǎo', '謏'), ('xiǎo', '皢'), ('xiǎo', '䒕'), ('xiǎo', '㕾'), ('xiǎo', '䥵')]
    xiao_4 = [('xiào', '笑'), ('xiào', '效'), ('xiào', '校'), ('xiào', '孝'), ('xiào', '啸'), ('xiào', '俏'), ('xiào', '哮'),
              ('xiào', '効'), ('xiào', '咲'), ('xiào', '恔'), ('xiào', '俲'), ('xiào', '涍'), ('xiào', '傚'), ('xiào', '敩'),
              ('xiào', '詨'), ('xiào', '嘋'), ('xiào', '嘨'), ('xiào', '誟'), ('xiào', '嘯'), ('xiào', '薂'), ('xiào', '歗'),
              ('xiào', '熽'), ('xiào', '斅'), ('xiào', '斆'), ('xiào', '㤊'), ('xiào', '䇃'), ('xiào', '㹲'), ('xiào', '㗛'),
              ('xiào', '㒆'), ('xiào', '㔅'), ('xiào', '䒁'), ('xiào', '䠛'), ('xiào', '䕧'), ('xiào', '䴛'), ('xiào', '㩭'),
              ('xiào', '䊥')]
    xie_1 = [('xiē', '些'), ('xiē', '歇'), ('xiē', '蝎'), ('xiē', '楔'), ('xiē', '娎'), ('xiē', '揳'), ('xiē', '猲'),
             ('xiē', '滊'), ('xiē', '獦'), ('xiē', '蠍'), ('xiē', '㱔')]
    xie_2 = [('xié', '协'), ('xié', '叶'), ('xié', '邪'), ('xié', '斜'), ('xié', '鞋'), ('xié', '胁'), ('xié', '携'),
             ('xié', '挟'), ('xié', '谐'), ('xié', '偕'), ('xié', '颉'), ('xié', '鲑'), ('xié', '撷'), ('xié', '劦'),
             ('xié', '旪'), ('xié', '協'), ('xié', '垥'), ('xié', '奊'), ('xié', '峫'), ('xié', '恊'), ('xié', '拹'),
             ('xié', '挾'), ('xié', '脅'), ('xié', '脇'), ('xié', '脋'), ('xié', '衺'), ('xié', '梋'), ('xié', '絜'),
             ('xié', '翓'), ('xié', '嗋'), ('xié', '愶'), ('xié', '慀'), ('xié', '搚'), ('xié', '瑎'), ('xié', '綊'),
             ('xié', '熁'), ('xié', '膎'), ('xié', '勰'), ('xié', '擕'), ('xié', '緳'), ('xié', '縀'), ('xié', '缬'),
             ('xié', '蝢'), ('xié', '諧'), ('xié', '燲'), ('xié', '鮭'), ('xié', '嚡'), ('xié', '擷'), ('xié', '鞵'),
             ('xié', '儶'), ('xié', '襭'), ('xié', '孈'), ('xié', '攜'), ('xié', '讗'), ('xié', '龤'), ('xié', '㚗'),
             ('xié', '㢵'), ('xié', '䀘'), ('xié', '䏮'), ('xié', '㖿'), ('xié', '㥟'), ('xié', '㨒'), ('xié', '䙽'),
             ('xié', '㙝'), ('xié', '㨙'), ('xié', '㷎'), ('xié', '㙦'), ('xié', '䔑'), ('xié', '䦖'), ('xié', '㜦'),
             ('xié', '㩉'), ('xié', '䙎'), ('xié', '䬅'), ('xié', '㩗'), ('xié', '䡡'), ('xié', '䩤'), ('xié', '䁯'),
             ('xié', '䭎'), ('xié', '㩦'), ('xié', '㩪'), ('xié', '䕵')]
    xie_3 = [('xiě', '写'), ('xiě', '血'), ('xiě', '冩'), ('xiě', '寫'), ('xiě', '藛'), ('xiě', '㝍'), ('xiě', '䥾'),
             ('xiě', '㕐'), ('xiě', '䥱')]
    xie_4 = [('xiè', '解'), ('xiè', '谢'), ('xiè', '泄'), ('xiè', '契'), ('xiè', '械'), ('xiè', '屑'), ('xiè', '卸'),
             ('xiè', '懈'), ('xiè', '泻'), ('xiè', '蟹'), ('xiè', '亵'), ('xiè', '榭'), ('xiè', '邂'), ('xiè', '绁'),
             ('xiè', '廨'), ('xiè', '燮'), ('xiè', '伳'), ('xiè', '灺'), ('xiè', '祄'), ('xiè', '缷'), ('xiè', '枻'),
             ('xiè', '洩'), ('xiè', '炧'), ('xiè', '炨'), ('xiè', '卨'), ('xiè', '栧'), ('xiè', '偞'), ('xiè', '偰'),
             ('xiè', '徢'), ('xiè', '烲'), ('xiè', '焎'), ('xiè', '禼'), ('xiè', '紲'), ('xiè', '媟'), ('xiè', '屟'),
             ('xiè', '渫'), ('xiè', '絏'), ('xiè', '絬'), ('xiè', '僁'), ('xiè', '塮'), ('xiè', '觟'), ('xiè', '觧'),
             ('xiè', '榍'), ('xiè', '榝'), ('xiè', '褉'), ('xiè', '靾'), ('xiè', '噧'), ('xiè', '屧'), ('xiè', '暬'),
             ('xiè', '樧'), ('xiè', '碿'), ('xiè', '緤'), ('xiè', '嶰'), ('xiè', '澥'), ('xiè', '獬'), ('xiè', '糏'),
             ('xiè', '薢'), ('xiè', '薤'), ('xiè', '韰'), ('xiè', '褻'), ('xiè', '謝'), ('xiè', '夑'), ('xiè', '瀉'),
             ('xiè', '鞢'), ('xiè', '韘'), ('xiè', '瀣'), ('xiè', '爕'), ('xiè', '繲'), ('xiè', '蠏'), ('xiè', '齘'),
             ('xiè', '齛'), ('xiè', '纈'), ('xiè', '齥'), ('xiè', '齂'), ('xiè', '躠'), ('xiè', '躞'), ('xiè', '㰡'),
             ('xiè', '㽳'), ('xiè', '㞒'), ('xiè', '㞕'), ('xiè', '㖑'), ('xiè', '㳦'), ('xiè', '䍖'), ('xiè', '㳿'),
             ('xiè', '䇋'), ('xiè', '䚳'), ('xiè', '䚸'), ('xiè', '㓔'), ('xiè', '䢡'), ('xiè', '䦏'), ('xiè', '䦑'),
             ('xiè', '㣯'), ('xiè', '㨝'), ('xiè', '㴬'), ('xiè', '㴮'), ('xiè', '㣰'), ('xiè', '㴽'), ('xiè', '䙊'),
             ('xiè', '㙰'), ('xiè', '䕈'), ('xiè', '䩧'), ('xiè', '㒠'), ('xiè', '㵼'), ('xiè', '䊝'), ('xiè', '䙝'),
             ('xiè', '㔎'), ('xiè', '䵦'), ('xiè', '㸉'), ('xiè', '䉏'), ('xiè', '䉣'), ('xiè', '㦪'), ('xiè', '㰔'),
             ('xiè', '㽊'), ('xiè', '䞕'), ('xiè', '䪥'), ('xiè', '䲒')]
    xin_1 = [('xīn', '心'), ('xīn', '新'), ('xīn', '辛'), ('xīn', '欣'), ('xīn', '馨'), ('xīn', '薪'), ('xīn', '芯'),
             ('xīn', '昕'), ('xīn', '鑫'), ('xīn', '忻'), ('xīn', '莘'), ('xīn', '歆'), ('xīn', '忄'), ('xīn', '锌'),
             ('xīn', '邤'), ('xīn', '妡'), ('xīn', '杺'), ('xīn', '盺'), ('xīn', '俽'), ('xīn', '惞'), ('xīn', '訢'),
             ('xīn', '鈊'), ('xīn', '廞'), ('xīn', '鋅'), ('xīn', '噷'), ('xīn', '噺'), ('xīn', '嬜'), ('xīn', '馫'),
             ('xīn', '䜣')]
    xin_2 = [('xín', '枔'), ('xín', '襑'), ('xín', '镡'), ('xín', '礥'), ('xín', '鐔'), ('xín', '㚯'), ('xín', '㜦'),
             ('xín', '䰼'), ('xín', '㻸')]
    xin_3 = [('xǐn', '伈')]
    xin_4 = [('xìn', '信'), ('xìn', '衅'), ('xìn', '阠'), ('xìn', '伩'), ('xìn', '囟'), ('xìn', '孞'), ('xìn', '炘'),
             ('xìn', '軐'), ('xìn', '脪'), ('xìn', '訫'), ('xìn', '愖'), ('xìn', '焮'), ('xìn', '馸'), ('xìn', '顖'),
             ('xìn', '舋'), ('xìn', '釁'), ('xìn', '㐰'), ('xìn', '䒖'), ('xìn', '㭄'), ('xìn', '㛛'), ('xìn', '㭡'),
             ('xìn', '䎣'), ('xìn', '䚱'), ('xìn', '㹷'), ('xìn', '䛨'), ('xìn', '䪿'), ('xìn', '㩪'), ('xìn', '䜗')]
    xing_1 = [('xīng', '兴'), ('xīng', '星'), ('xīng', '腥'), ('xīng', '猩'), ('xīng', '惺'), ('xīng', '狌'), ('xīng', '垶'),
              ('xīng', '骍'), ('xīng', '煋'), ('xīng', '瑆'), ('xīng', '觪'), ('xīng', '箵'), ('xīng', '篂'), ('xīng', '興'),
              ('xīng', '謃'), ('xīng', '鮏'), ('xīng', '曐'), ('xīng', '觲'), ('xīng', '騂'), ('xīng', '皨'), ('xīng', '鯹'),
              ('xīng', '㙚')]
    xing_2 = [('xíng', '行'), ('xíng', '形'), ('xíng', '型'), ('xíng', '刑'), ('xíng', '邢'), ('xíng', '荥'), ('xíng', '饧'),
              ('xíng', '巠'), ('xíng', '陉'), ('xíng', '侀'), ('xíng', '郉'), ('xíng', '哘'), ('xíng', '洐'), ('xíng', '钘'),
              ('xíng', '陘'), ('xíng', '娙'), ('xíng', '硎'), ('xíng', '铏'), ('xíng', '鈃'), ('xíng', '蛵'), ('xíng', '滎'),
              ('xíng', '鉶'), ('xíng', '銒'), ('xíng', '鋞'), ('xíng', '餳'), ('xíng', '㓝'), ('xíng', '㐩'), ('xíng', '㼛'),
              ('xíng', '㣜'), ('xíng', '䣆'), ('xíng', '㬐'), ('xíng', '䤯')]
    xing_3 = [('xǐng', '省'), ('xǐng', '醒'), ('xǐng', '擤'), ('xǐng', '睲'), ('xǐng', '㨘'), ('xǐng', '㮐'), ('xǐng', '䋲'),
              ('xǐng', '㝭'), ('xǐng', '䳙')]
    xing_4 = [('xìng', '性'), ('xìng', '幸'), ('xìng', '姓'), ('xìng', '杏'), ('xìng', '悻'), ('xìng', '荇'), ('xìng', '倖'),
              ('xìng', '莕'), ('xìng', '婞'), ('xìng', '涬'), ('xìng', '葕'), ('xìng', '緈'), ('xìng', '嬹'), ('xìng', '臖'),
              ('xìng', '㒷'), ('xìng', '㓑'), ('xìng', '㴆'), ('xìng', '㼬'), ('xìng', '䓷'), ('xìng', '䁄'), ('xìng', '䂔'),
              ('xìng', '䛭'), ('xìng', '䰢'), ('xìng', '䮍')]
    xiong_1 = [('xiōng', '兄'), ('xiōng', '胸'), ('xiōng', '凶'), ('xiōng', '汹'), ('xiōng', '匈'), ('xiōng', '匂'),
               ('xiōng', '兇'), ('xiōng', '芎'), ('xiōng', '讻'), ('xiōng', '忷'), ('xiōng', '哅'), ('xiōng', '恟'),
               ('xiōng', '洶'), ('xiōng', '胷'), ('xiōng', '訩'), ('xiōng', '詾'), ('xiōng', '賯'), ('xiōng', '㐫')]
    xiong_2 = [('xióng', '雄'), ('xióng', '熊'), ('xióng', '熋'), ('xióng', '䧺')]
    xiong_3 = [('xiǒng', '焸'), ('xiǒng', '焽')]
    xiong_4 = [('xiòng', '诇'), ('xiòng', '詗'), ('xiòng', '夐'), ('xiòng', '敻'), ('xiòng', '䎿')]
    xiu_1 = [('xiū', '修'), ('xiū', '休'), ('xiū', '羞'), ('xiū', '咻'), ('xiū', '馐'), ('xiū', '俢'), ('xiū', '庥'),
             ('xiū', '烋'), ('xiū', '烌'), ('xiū', '脩'), ('xiū', '脙'), ('xiū', '鸺'), ('xiū', '臹'), ('xiū', '貅'),
             ('xiū', '樇'), ('xiū', '銝'), ('xiū', '髤'), ('xiū', '髹'), ('xiū', '鎀'), ('xiū', '鮴'), ('xiū', '鵂'),
             ('xiū', '鏅'), ('xiū', '饈'), ('xiū', '鱃'), ('xiū', '飍'), ('xiū', '䰍')]
    xiu_2 = [('xiú', '苬')]
    xiu_3 = [('xiǔ', '宿'), ('xiǔ', '朽'), ('xiǔ', '滫'), ('xiǔ', '潃'), ('xiǔ', '糔'), ('xiǔ', '㱙'), ('xiǔ', '㩰')]
    xiu_4 = [('xiù', '秀'), ('xiù', '袖'), ('xiù', '臭'), ('xiù', '绣'), ('xiù', '嗅'), ('xiù', '锈'), ('xiù', '岫'),
             ('xiù', '峀'), ('xiù', '珛'), ('xiù', '琇'), ('xiù', '溴'), ('xiù', '綉'), ('xiù', '璓'), ('xiù', '褎'),
             ('xiù', '褏'), ('xiù', '銹'), ('xiù', '螑'), ('xiù', '嚊'), ('xiù', '繍'), ('xiù', '繡'), ('xiù', '鏥'),
             ('xiù', '鏽'), ('xiù', '齅'), ('xiù', '㾋'), ('xiù', '䜬'), ('xiù', '㗜')]
    xu_1 = [('xū', '需'), ('xū', '须'), ('xū', '虚'), ('xū', '吁'), ('xū', '嘘'), ('xū', '胥'), ('xū', '墟'), ('xū', '戌'),
            ('xū', '顼'), ('xū', '圩'), ('xū', '盱'), ('xū', '砉'), ('xū', '疞'), ('xū', '欨'), ('xū', '眗'), ('xū', '訏'),
            ('xū', '偦'), ('xū', '虗'), ('xū', '裇'), ('xū', '許'), ('xū', '谞'), ('xū', '媭'), ('xū', '揟'), ('xū', '欻'),
            ('xū', '湏'), ('xū', '虛'), ('xū', '須'), ('xū', '楈'), ('xū', '綇'), ('xū', '頊'), ('xū', '蓲'), ('xū', '魆'),
            ('xū', '噓'), ('xū', '嬃'), ('xū', '歔'), ('xū', '緰'), ('xū', '縃'), ('xū', '蕦'), ('xū', '蝑'), ('xū', '歘'),
            ('xū', '諝'), ('xū', '燸'), ('xū', '譃'), ('xū', '魖'), ('xū', '驉'), ('xū', '鑐'), ('xū', '鬚'), ('xū', '䱬')]
    xu_2 = [('xú', '徐'), ('xú', '邪'), ('xú', '俆'), ('xú', '冔'), ('xú', '禑'), ('xú', '蒣'), ('xú', '䍱')]
    xu_3 = [('xǔ', '许'), ('xǔ', '休'), ('xǔ', '栩'), ('xǔ', '诩'), ('xǔ', '浒'), ('xǔ', '呴'), ('xǔ', '姁'), ('xǔ', '珝'),
            ('xǔ', '喣'), ('xǔ', '湑'), ('xǔ', '蛡'), ('xǔ', '暊'), ('xǔ', '詡'), ('xǔ', '滸'), ('xǔ', '稰'), ('xǔ', '鄦'),
            ('xǔ', '糈'), ('xǔ', '諿'), ('xǔ', '醑'), ('xǔ', '盨'), ('xǔ', '㒷'), ('xǔ', '㞰'), ('xǔ', '䧁'), ('xǔ', '㑔'),
            ('xǔ', '㽳'), ('xǔ', '㑯'), ('xǔ', '㥠'), ('xǔ', '䅡'), ('xǔ', '䔓')]
    xu_4 = [('xù', '序'), ('xù', '续'), ('xù', '绪'), ('xù', '叙'), ('xù', '畜'), ('xù', '蓄'), ('xù', '婿'), ('xù', '旭'),
            ('xù', '絮'), ('xù', '恤'), ('xù', '煦'), ('xù', '勖'), ('xù', '酗'), ('xù', '矞'), ('xù', '蓿'), ('xù', '伵'),
            ('xù', '旴'), ('xù', '汿'), ('xù', '芧'), ('xù', '侐'), ('xù', '卹'), ('xù', '妶'), ('xù', '怴'), ('xù', '沀'),
            ('xù', '恓'), ('xù', '昫'), ('xù', '朐'), ('xù', '洫'), ('xù', '垿'), ('xù', '晇'), ('xù', '欰'), ('xù', '殈'),
            ('xù', '烅'), ('xù', '珬'), ('xù', '勗'), ('xù', '喐'), ('xù', '惐'), ('xù', '掝'), ('xù', '敍'), ('xù', '敘'),
            ('xù', '淢'), ('xù', '烼'), ('xù', '蚼'), ('xù', '壻'), ('xù', '朂'), ('xù', '溆'), ('xù', '聓'), ('xù', '訹'),
            ('xù', '慉'), ('xù', '滀'), ('xù', '続'), ('xù', '賉'), ('xù', '槒'), ('xù', '漵'), ('xù', '潊'), ('xù', '盢'),
            ('xù', '瞁'), ('xù', '緒'), ('xù', '聟'), ('xù', '銊'), ('xù', '嘼'), ('xù', '獝'), ('xù', '稸'), ('xù', '緖'),
            ('xù', '藇'), ('xù', '藚'), ('xù', '續'), ('xù', '鱮'), ('xù', '㕛'), ('xù', '䦽'), ('xù', '㘧'), ('xù', '㜿'),
            ('xù', '㐨'), ('xù', '䂆'), ('xù', '䘏'), ('xù', '㖅'), ('xù', '㤢'), ('xù', '㺷'), ('xù', '䢕'), ('xù', '㚜'),
            ('xù', '㰲'), ('xù', '䣱'), ('xù', '㜅'), ('xù', '㞊'), ('xù', '㾥'), ('xù', '䂸'), ('xù', '䛙'), ('xù', '䣴'),
            ('xù', '㷦'), ('xù', '䦗'), ('xù', '㗵'), ('xù', '䋶'), ('xù', '䙒'), ('xù', '㦌'), ('xù', '㵰'), ('xù', '㦽'),
            ('xù', '䬔'), ('xù', '䨆'), ('xù', '䳳'), ('xù', '䜡')]
    xuan_1 = [('xuān', '宣'), ('xuān', '轩'), ('xuān', '喧'), ('xuān', '萱'), ('xuān', '暄'), ('xuān', '揎'), ('xuān', '煊'),
              ('xuān', '儇'), ('xuān', '嬛'), ('xuān', '吅'), ('xuān', '昍'), ('xuān', '弲'), ('xuān', '晅'), ('xuān', '軒'),
              ('xuān', '梋'), ('xuān', '谖'), ('xuān', '塇'), ('xuān', '媗'), ('xuān', '愃'), ('xuān', '愋'), ('xuān', '萲'),
              ('xuān', '瑄'), ('xuān', '蓒'), ('xuān', '睻'), ('xuān', '禤'), ('xuān', '箮'), ('xuān', '翧'), ('xuān', '蝖'),
              ('xuān', '鋗'), ('xuān', '懁'), ('xuān', '蕿'), ('xuān', '諠'), ('xuān', '諼'), ('xuān', '鞙'), ('xuān', '駨'),
              ('xuān', '鍹'), ('xuān', '駽'), ('xuān', '矎'), ('xuān', '翾'), ('xuān', '藼'), ('xuān', '蘐'), ('xuān', '蠉'),
              ('xuān', '譞'), ('xuān', '鰚'), ('xuān', '讂'), ('xuān', '䚙'), ('xuān', '䁔'), ('xuān', '䚭')]
    xuan_2 = [('xuán', '县'), ('xuán', '玄'), ('xuán', '旋'), ('xuán', '悬'), ('xuán', '璇'), ('xuán', '漩'), ('xuán', '伭'),
              ('xuán', '妶'), ('xuán', '玹'), ('xuán', '痃'), ('xuán', '琁'), ('xuán', '蜁'), ('xuán', '嫙'), ('xuán', '暶'),
              ('xuán', '縣'), ('xuán', '檈'), ('xuán', '璿'), ('xuán', '懸'), ('xuán', '㔯'), ('xuán', '㹡'), ('xuán', '㒸'),
              ('xuán', '㘣'), ('xuán', '㳬'), ('xuán', '䮄'), ('xuán', '䁢'), ('xuán', '䲻'), ('xuán', '䗠'), ('xuán', '䥧'),
              ('xuán', '䲂'), ('xuán', '䴉'), ('xuán', '䴋')]
    xuan_3 = [('xuǎn', '选'), ('xuǎn', '癣'), ('xuǎn', '咺'), ('xuǎn', '烜'), ('xuǎn', '喛'), ('xuǎn', '暅'), ('xuǎn', '選'),
              ('xuǎn', '癬'), ('xuǎn', '㧋'), ('xuǎn', '㾌'), ('xuǎn', '㔵'), ('xuǎn', '㿅'), ('xuǎn', '䍻'), ('xuǎn', '䠣')]
    xuan_4 = [('xuàn', '券'), ('xuàn', '眩'), ('xuàn', '炫'), ('xuàn', '绚'), ('xuàn', '渲'), ('xuàn', '铉'), ('xuàn', '泫'),
              ('xuàn', '怰'), ('xuàn', '昡'), ('xuàn', '袨'), ('xuàn', '琄'), ('xuàn', '眴'), ('xuàn', '衒'), ('xuàn', '絢'),
              ('xuàn', '楥'), ('xuàn', '楦'), ('xuàn', '鉉'), ('xuàn', '夐'), ('xuàn', '敻'), ('xuàn', '碹'), ('xuàn', '蔙'),
              ('xuàn', '镟'), ('xuàn', '颴'), ('xuàn', '縼'), ('xuàn', '繏'), ('xuàn', '鏇'), ('xuàn', '贙'), ('xuàn', '䀏'),
              ('xuàn', '㧦'), ('xuàn', '㳙'), ('xuàn', '䧎'), ('xuàn', '䍗'), ('xuàn', '䘩'), ('xuàn', '䝮'), ('xuàn', '䧟'),
              ('xuàn', '㜗'), ('xuàn', '䩙'), ('xuàn', '㦏'), ('xuàn', '㯀'), ('xuàn', '䩰')]
    xue_1 = [('xuē', '薛'), ('xuē', '削'), ('xuē', '靴'), ('xuē', '疶'), ('xuē', '蒆'), ('xuē', '辥'), ('xuē', '辪'),
             ('xuē', '鞾')]
    xue_2 = [('xué', '学'), ('xué', '穴'), ('xué', '踅'), ('xué', '噱'), ('xué', '斈'), ('xué', '乴'), ('xué', '峃'),
             ('xué', '茓'), ('xué', '泶'), ('xué', '袕'), ('xué', '鸴'), ('xué', '敩'), ('xué', '壆'), ('xué', '學'),
             ('xué', '嶨'), ('xué', '澩'), ('xué', '燢'), ('xué', '觷'), ('xué', '鷽'), ('xué', '㧒'), ('xué', '䀜'),
             ('xué', '䋉'), ('xué', '㖸'), ('xué', '㿱'), ('xué', '䫻'), ('xué', '㗾'), ('xué', '䱑'), ('xué', '㙾'),
             ('xué', '㶅'), ('xué', '㰒')]
    xue_3 = [('xuě', '雪'), ('xuě', '彐'), ('xuě', '樰'), ('xuě', '膤'), ('xuě', '艝'), ('xuě', '轌'), ('xuě', '鳕'),
             ('xuě', '鱈'), ('xuě', '㡜'), ('xuě', '䩈'), ('xuě', '䨮')]
    xue_4 = [('xuè', '血'), ('xuè', '谑'), ('xuè', '吷'), ('xuè', '坹'), ('xuè', '岤'), ('xuè', '怴'), ('xuè', '泬'),
             ('xuè', '狘'), ('xuè', '疦'), ('xuè', '桖'), ('xuè', '滈'), ('xuè', '趐'), ('xuè', '謔'), ('xuè', '瞲'),
             ('xuè', '瀥'), ('xuè', '㞽'), ('xuè', '䒸'), ('xuè', '䎀'), ('xuè', '䛎'), ('xuè', '䖼'), ('xuè', '䫼'),
             ('xuè', '㷤'), ('xuè', '䬂'), ('xuè', '㦜'), ('xuè', '䠼'), ('xuè', '䆷'), ('xuè', '㔧'), ('xuè', '䜡'),
             ('xuè', '䤕'), ('xuè', '䭥')]
    xun_1 = [('xūn', '勋'), ('xūn', '熏'), ('xūn', '薰'), ('xūn', '醺'), ('xūn', '坃'), ('xūn', '埙'), ('xūn', '焄'),
             ('xūn', '勛'), ('xūn', '塤'), ('xūn', '煇'), ('xūn', '窨'), ('xūn', '勲'), ('xūn', '勳'), ('xūn', '薫'),
             ('xūn', '嚑'), ('xūn', '壎'), ('xūn', '獯'), ('xūn', '曛'), ('xūn', '燻'), ('xūn', '臐'), ('xūn', '矄'),
             ('xūn', '蘍'), ('xūn', '壦'), ('xūn', '爋'), ('xūn', '纁')]
    xun_2 = [('xún', '寻'), ('xún', '询'), ('xún', '循'), ('xún', '巡'), ('xún', '旬'), ('xún', '荀'), ('xún', '恂'),
             ('xún', '洵'), ('xún', '峋'), ('xún', '浔'), ('xún', '珣'), ('xún', '廵'), ('xún', '杊'), ('xún', '畃'),
             ('xún', '郇'), ('xún', '咰'), ('xún', '姰'), ('xún', '紃'), ('xún', '荨'), ('xún', '栒'), ('xún', '桪'),
             ('xún', '毥'), ('xún', '偱'), ('xún', '眴'), ('xún', '尋'), ('xún', '揗'), ('xún', '詢'), ('xún', '鄩'),
             ('xún', '鲟'), ('xún', '噚'), ('xún', '潯'), ('xún', '蕁'), ('xún', '攳'), ('xún', '樳'), ('xún', '燅'),
             ('xún', '燖'), ('xún', '璕'), ('xún', '駨'), ('xún', '蟫'), ('xún', '蟳'), ('xún', '爓'), ('xún', '鱏'),
             ('xún', '鱘'), ('xún', '灥'), ('xún', '㚯'), ('xún', '㝁'), ('xún', '㡄'), ('xún', '㰬'), ('xún', '䡅'),
             ('xún', '䘩'), ('xún', '㜄'), ('xún', '㨚'), ('xún', '䖲'), ('xún', '䙉'), ('xún', '㯠'), ('xún', '㵌'),
             ('xún', '㽦'), ('xún', '䋸'), ('xún', '㰊')]
    xun_3 = [('xùn', '孙'), ('xùn', '讯'), ('xùn', '训'), ('xùn', '迅'), ('xùn', '逊'), ('xùn', '驯'), ('xùn', '浚'),
             ('xùn', '汛'), ('xùn', '殉'), ('xùn', '巽'), ('xùn', '徇'), ('xùn', '卂'), ('xùn', '伨'), ('xùn', '侚'),
             ('xùn', '巺'), ('xùn', '狥'), ('xùn', '迿'), ('xùn', '孫'), ('xùn', '訊'), ('xùn', '訓'), ('xùn', '訙'),
             ('xùn', '奞'), ('xùn', '殾'), ('xùn', '稄'), ('xùn', '遜'), ('xùn', '馴'), ('xùn', '愻'), ('xùn', '噀'),
             ('xùn', '潠'), ('xùn', '蕈'), ('xùn', '濬'), ('xùn', '顨'), ('xùn', '鶽'), ('xùn', '鑂'), ('xùn', '㢲'),
             ('xùn', '㟧'), ('xùn', '䃀'), ('xùn', '䛜'), ('xùn', '㒐'), ('xùn', '䭀'), ('xùn', '䞊')]
    ya_1 = [('yā', '呀'), ('yā', '压'), ('yā', '丫'), ('yā', '押'), ('yā', '鸦'), ('yā', '鸭'), ('yā', '桠'), ('yā', '圧'),
            ('yā', '吖'), ('yā', '亞'), ('yā', '庘'), ('yā', '枒'), ('yā', '垭'), ('yā', '孲'), ('yā', '铔'), ('yā', '椏'),
            ('yā', '鴉'), ('yā', '錏'), ('yā', '鴨'), ('yā', '壓'), ('yā', '鵶'), ('yā', '鐚'), ('yā', '䆘'), ('yā', '㝞'),
            ('yā', '䃁')]
    ya_2 = [('yá', '牙'), ('yá', '邪'), ('yá', '衙'), ('yá', '崖'), ('yá', '涯'), ('yá', '芽'), ('yá', '琊'), ('yá', '伢'),
            ('yá', '厑'), ('yá', '岈'), ('yá', '厓'), ('yá', '拁'), ('yá', '笌'), ('yá', '蚜'), ('yá', '堐'), ('yá', '崕'),
            ('yá', '猚'), ('yá', '釾'), ('yá', '睚'), ('yá', '漄'), ('yá', '齖'), ('yá', '㤉'), ('yá', '㧎'), ('yá', '䄰'),
            ('yá', '䍓'), ('yá', '䖌'), ('yá', '㝦'), ('yá', '㮞'), ('yá', '䊦')]
    ya_3 = [('yǎ', '雅'), ('yǎ', '哑'), ('yǎ', '疋'), ('yǎ', '厊'), ('yǎ', '庌'), ('yǎ', '疨'), ('yǎ', '唖'), ('yǎ', '啞'),
            ('yǎ', '痖'), ('yǎ', '瘂'), ('yǎ', '蕥'), ('yǎ', '㿿'), ('yǎ', '䪵')]
    ya_4 = [('yà', '亚'), ('yà', '讶'), ('yà', '娅'), ('yà', '轧'), ('yà', '迓'), ('yà', '碣'), ('yà', '劜'), ('yà', '圠'),
            ('yà', '冴'), ('yà', '襾'), ('yà', '覀'), ('yà', '亜'), ('yà', '犽'), ('yà', '玡'), ('yà', '軋'), ('yà', '姶'),
            ('yà', '挜'), ('yà', '砑'), ('yà', '俹'), ('yà', '氩'), ('yà', '埡'), ('yà', '婭'), ('yà', '掗'), ('yà', '訝'),
            ('yà', '揠'), ('yà', '氬'), ('yà', '猰'), ('yà', '聐'), ('yà', '圔'), ('yà', '椻'), ('yà', '稏'), ('yà', '窫'),
            ('yà', '潝'), ('yà', '磍'), ('yà', '瓛'), ('yà', '齾'), ('yà', '䧅'), ('yà', '㼤'), ('yà', '䂒'), ('yà', '䅉'),
            ('yà', '䢝'), ('yà', '㰳'), ('yà', '䰲'), ('yà', '䯉'), ('yà', '䵝'), ('yà', '䨙'), ('yà', '䝟'), ('yà', '䒁'),
            ('yà', '䦪'), ('yà', '䫖')]
    ya_5 = [('ya', '㗇')]
    yan_1 = [('yān', '烟'), ('yān', '焉'), ('yān', '殷'), ('yān', '咽'), ('yān', '嫣'), ('yān', '淹'), ('yān', '胭'),
             ('yān', '阉'), ('yān', '腌'), ('yān', '恹'), ('yān', '湮'), ('yān', '菸'), ('yān', '鄢'), ('yān', '剦'),
             ('yān', '珚'), ('yān', '崦'), ('yān', '淊'), ('yān', '焑'), ('yān', '殗'), ('yān', '渰'), ('yān', '傿'),
             ('yān', '歅'), ('yān', '煙'), ('yān', '硽'), ('yān', '漹'), ('yān', '嶖'), ('yān', '樮'), ('yān', '醃'),
             ('yān', '橪'), ('yān', '閹'), ('yān', '閼'), ('yān', '嬮'), ('yān', '懨'), ('yān', '篶'), ('yān', '懕'),
             ('yān', '臙'), ('yān', '黫'), ('yān', '黰')]
    yan_2 = [('yán', '言'), ('yán', '研'), ('yán', '严'), ('yán', '颜'), ('yán', '延'), ('yán', '沿'), ('yán', '岩'),
             ('yán', '炎'), ('yán', '阎'), ('yán', '盐'), ('yán', '檐'), ('yán', '筵'), ('yán', '妍'), ('yán', '铅'),
             ('yán', '蜒'), ('yán', '讠'), ('yán', '厃'), ('yán', '闫'), ('yán', '芫'), ('yán', '訁'), ('yán', '昖'),
             ('yán', '炏'), ('yán', '郔'), ('yán', '唌'), ('yán', '埏'), ('yán', '姸'), ('yán', '娫'), ('yán', '狿'),
             ('yán', '莚'), ('yán', '娮'), ('yán', '梴'), ('yán', '啱'), ('yán', '琂'), ('yán', '硏'), ('yán', '訮'),
             ('yán', '閆'), ('yán', '喦'), ('yán', '嵒'), ('yán', '嵓'), ('yán', '綖'), ('yán', '塩'), ('yán', '揅'),
             ('yán', '楌'), ('yán', '詽'), ('yán', '碞'), ('yán', '蔅'), ('yán', '羬'), ('yán', '厳'), ('yán', '虤'),
             ('yán', '閻'), ('yán', '顏'), ('yán', '顔'), ('yán', '嚴'), ('yán', '壛'), ('yán', '巌'), ('yán', '簷'),
             ('yán', '櫩'), ('yán', '壧'), ('yán', '巖'), ('yán', '巗'), ('yán', '欕'), ('yán', '礹'), ('yán', '鹽'),
             ('yán', '麣'), ('yán', '㳂'), ('yán', '㫟'), ('yán', '㿼'), ('yán', '䓂'), ('yán', '㡉'), ('yán', '䀽'),
             ('yán', '㺂'), ('yán', '䂴'), ('yán', '䇾'), ('yán', '䢥'), ('yán', '㗴'), ('yán', '㺗'), ('yán', '䊙'),
             ('yán', '䖗'), ('yán', '䗡'), ('yán', '䤷'), ('yán', '㶄'), ('yán', '䫡'), ('yán', '䱲'), ('yán', '㘖'),
             ('yán', '㿕'), ('yán', '䀋'), ('yán', '䦲'), ('yán', '㘙'), ('yán', '䌪'), ('yán', '䕾'), ('yán', '䉷'),
             ('yán', '䶫')]
    yan_3 = [('yǎn', '眼'), ('yǎn', '演'), ('yǎn', '掩'), ('yǎn', '衍'), ('yǎn', '俨'), ('yǎn', '奄'), ('yǎn', '偃'),
             ('yǎn', '兖'), ('yǎn', '琰'), ('yǎn', '魇'), ('yǎn', '剡'), ('yǎn', '夵'), ('yǎn', '抁'), ('yǎn', '沇'),
             ('yǎn', '乵'), ('yǎn', '兗'), ('yǎn', '匽'), ('yǎn', '弇'), ('yǎn', '厣'), ('yǎn', '萒'), ('yǎn', '郾'),
             ('yǎn', '酓'), ('yǎn', '嵃'), ('yǎn', '愝'), ('yǎn', '扊'), ('yǎn', '揜'), ('yǎn', '晻'), ('yǎn', '棪'),
             ('yǎn', '渷'), ('yǎn', '遃'), ('yǎn', '隒'), ('yǎn', '椼'), ('yǎn', '罨'), ('yǎn', '裺'), ('yǎn', '褗'),
             ('yǎn', '戭'), ('yǎn', '窴'), ('yǎn', '蝘'), ('yǎn', '噞'), ('yǎn', '嬐'), ('yǎn', '躽'), ('yǎn', '縯'),
             ('yǎn', '檿'), ('yǎn', '黡'), ('yǎn', '厴'), ('yǎn', '甗'), ('yǎn', '鰋'), ('yǎn', '鶠'), ('yǎn', '黤'),
             ('yǎn', '儼'), ('yǎn', '黬'), ('yǎn', '黭'), ('yǎn', '龑'), ('yǎn', '孍'), ('yǎn', '顩'), ('yǎn', '鼴'),
             ('yǎn', '巘'), ('yǎn', '巚'), ('yǎn', '曮'), ('yǎn', '魘'), ('yǎn', '鼹'), ('yǎn', '齴'), ('yǎn', '黶'),
             ('yǎn', '㕣'), ('yǎn', '㚧'), ('yǎn', '㫃'), ('yǎn', '㓧'), ('yǎn', '㢂'), ('yǎn', '䶮'), ('yǎn', '䊻'),
             ('yǎn', '䍾'), ('yǎn', '䣍'), ('yǎn', '㭺'), ('yǎn', '䄋'), ('yǎn', '䘶'), ('yǎn', '䎦'), ('yǎn', '䁙'),
             ('yǎn', '䅬'), ('yǎn', '䦧'), ('yǎn', '㱘'), ('yǎn', '䌠'), ('yǎn', '䗺'), ('yǎn', '㱌'), ('yǎn', '䲓')]
    yan_4 = [('yàn', '验'), ('yàn', '燕'), ('yàn', '厌'), ('yàn', '艳'), ('yàn', '宴'), ('yàn', '焰'), ('yàn', '雁'),
             ('yàn', '彦'), ('yàn', '晏'), ('yàn', '砚'), ('yàn', '谚'), ('yàn', '唁'), ('yàn', '堰'), ('yàn', '滟'),
             ('yàn', '焱'), ('yàn', '酽'), ('yàn', '餍'), ('yàn', '赝'), ('yàn', '妟'), ('yàn', '觃'), ('yàn', '牪'),
             ('yàn', '姲'), ('yàn', '彥'), ('yàn', '洝'), ('yàn', '烻'), ('yàn', '覎'), ('yàn', '偐'), ('yàn', '掞'),
             ('yàn', '焔'), ('yàn', '猏'), ('yàn', '隁'), ('yàn', '喭'), ('yàn', '敥'), ('yàn', '猒'), ('yàn', '硯'),
             ('yàn', '椻'), ('yàn', '溎'), ('yàn', '豣'), ('yàn', '鳫'), ('yàn', '厭'), ('yàn', '墕'), ('yàn', '暥'),
             ('yàn', '熖'), ('yàn', '鳱'), ('yàn', '嬊'), ('yàn', '谳'), ('yàn', '鴈'), ('yàn', '燄'), ('yàn', '諺'),
             ('yàn', '鬳'), ('yàn', '嚈'), ('yàn', '曕'), ('yàn', '鴳'), ('yàn', '酀'), ('yàn', '騐'), ('yàn', '験'),
             ('yàn', '嚥'), ('yàn', '嬿'), ('yàn', '艶'), ('yàn', '贋'), ('yàn', '軅'), ('yàn', '曣'), ('yàn', '爓'),
             ('yàn', '醶'), ('yàn', '騴'), ('yàn', '齞'), ('yàn', '鷃'), ('yàn', '灔'), ('yàn', '贗'), ('yàn', '囐'),
             ('yàn', '觾'), ('yàn', '讌'), ('yàn', '醼'), ('yàn', '饜'), ('yàn', '驗'), ('yàn', '鷰'), ('yàn', '艷'),
             ('yàn', '灎'), ('yàn', '釅'), ('yàn', '驠'), ('yàn', '灧'), ('yàn', '讞'), ('yàn', '豓'), ('yàn', '豔'),
             ('yàn', '灩'), ('yàn', '㛪'), ('yàn', '䂩'), ('yàn', '㰽'), ('yàn', '㷔'), ('yàn', '㒆'), ('yàn', '䅧'),
             ('yàn', '䛳'), ('yàn', '䢭'), ('yàn', '㢛'), ('yàn', '㦔'), ('yàn', '㷳'), ('yàn', '㷼'), ('yàn', '䞁'),
             ('yàn', '䜩'), ('yàn', '䮗'), ('yàn', '䳛'), ('yàn', '䨄'), ('yàn', '㬫'), ('yàn', '䭘'), ('yàn', '䑍'),
             ('yàn', '䳺'), ('yàn', '䴏')]
    yang_1 = [('yāng', '央'), ('yāng', '鸯'), ('yāng', '殃'), ('yāng', '秧'), ('yāng', '泱'), ('yāng', '鞅'), ('yāng', '姎'),
              ('yāng', '抰'), ('yāng', '胦'), ('yāng', '眏'), ('yāng', '鉠'), ('yāng', '雵'), ('yāng', '鍈'), ('yāng', '鴦')]
    yang_2 = [('yáng', '阳'), ('yáng', '杨'), ('yáng', '扬'), ('yáng', '洋'), ('yáng', '羊'), ('yáng', '详'), ('yáng', '佯'),
              ('yáng', '炀'), ('yáng', '疡'), ('yáng', '徉'), ('yáng', '烊'), ('yáng', '阦'), ('yáng', '旸'), ('yáng', '玚'),
              ('yáng', '飏'), ('yáng', '劷'), ('yáng', '氜'), ('yáng', '钖'), ('yáng', '垟'), ('yáng', '昜'), ('yáng', '羏'),
              ('yáng', '珜'), ('yáng', '眻'), ('yáng', '陽'), ('yáng', '婸'), ('yáng', '崵'), ('yáng', '崸'), ('yáng', '愓'),
              ('yáng', '揚'), ('yáng', '蛘'), ('yáng', '敭'), ('yáng', '暘'), ('yáng', '楊'), ('yáng', '煬'), ('yáng', '瑒'),
              ('yáng', '禓'), ('yáng', '瘍'), ('yáng', '諹'), ('yáng', '輰'), ('yáng', '鍚'), ('yáng', '鴹'), ('yáng', '颺'),
              ('yáng', '鰑'), ('yáng', '霷'), ('yáng', '鸉'), ('yáng', '㟅'), ('yáng', '㦹'), ('yáng', '䖹'), ('yáng', '㬕'),
              ('yáng', '䁑'), ('yáng', '䬗')]
    yang_3 = [('yǎng', '养'), ('yǎng', '仰'), ('yǎng', '痒'), ('yǎng', '氧'), ('yǎng', '卬'), ('yǎng', '佒'), ('yǎng', '咉'),
              ('yǎng', '坱'), ('yǎng', '岟'), ('yǎng', '柍'), ('yǎng', '炴'), ('yǎng', '紻'), ('yǎng', '傟'), ('yǎng', '勜'),
              ('yǎng', '楧'), ('yǎng', '軮'), ('yǎng', '慃'), ('yǎng', '氱'), ('yǎng', '蝆'), ('yǎng', '飬'), ('yǎng', '養'),
              ('yǎng', '駚'), ('yǎng', '懩'), ('yǎng', '攁'), ('yǎng', '瀁'), ('yǎng', '癢'), ('yǎng', '礢'), ('yǎng', '䍩'),
              ('yǎng', '䇦'), ('yǎng', '䒋'), ('yǎng', '䬬'), ('yǎng', '㔦'), ('yǎng', '䞁'), ('yǎng', '䑆')]
    yang_4 = [('yàng', '样'), ('yàng', '漾'), ('yàng', '恙'), ('yàng', '怏'), ('yàng', '羕'), ('yàng', '詇'), ('yàng', '様'),
              ('yàng', '樣'), ('yàng', '㿮'), ('yàng', '㺊'), ('yàng', '㨾'), ('yàng', '䬺'), ('yàng', '䭐'), ('yàng', '䵮'),
              ('yàng', '䭥')]
    yao_1 = [('yāo', '么'), ('yāo', '约'), ('yāo', '腰'), ('yāo', '妖'), ('yāo', '邀'), ('yāo', '夭'), ('yāo', '吆'),
             ('yāo', '幺'), ('yāo', '殀'), ('yāo', '祅'), ('yāo', '約'), ('yāo', '訞'), ('yāo', '喓'), ('yāo', '葽'),
             ('yāo', '楆'), ('yāo', '鴁'), ('yāo', '撽'), ('yāo', '鴢'), ('yāo', '䄏')]
    yao_2 = [('yáo', '摇'), ('yáo', '遥'), ('yáo', '姚'), ('yáo', '瑶'), ('yáo', '尧'), ('yáo', '谣'), ('yáo', '肴'),
             ('yáo', '侥'), ('yáo', '窑'), ('yáo', '窕'), ('yáo', '繇'), ('yáo', '爻'), ('yáo', '匋'), ('yáo', '尭'),
             ('yáo', '垚'), ('yáo', '峣'), ('yáo', '恌'), ('yáo', '轺'), ('yáo', '倄'), ('yáo', '烑'), ('yáo', '珧'),
             ('yáo', '皐'), ('yáo', '铫'), ('yáo', '隃'), ('yáo', '傜'), ('yáo', '堯'), ('yáo', '揺'), ('yáo', '殽'),
             ('yáo', '軺'), ('yáo', '嗂'), ('yáo', '媱'), ('yáo', '徭'), ('yáo', '愮'), ('yáo', '搖'), ('yáo', '滧'),
             ('yáo', '猺'), ('yáo', '遙'), ('yáo', '僥'), ('yáo', '摿'), ('yáo', '暚'), ('yáo', '榣'), ('yáo', '瑤'),
             ('yáo', '銚'), ('yáo', '飖'), ('yáo', '餆'), ('yáo', '嶢'), ('yáo', '嶤'), ('yáo', '徺'), ('yáo', '磘'),
             ('yáo', '窯'), ('yáo', '窰'), ('yáo', '餚'), ('yáo', '謠'), ('yáo', '謡'), ('yáo', '鎐'), ('yáo', '鳐'),
             ('yáo', '颻'), ('yáo', '蘨'), ('yáo', '邎'), ('yáo', '顤'), ('yáo', '鰩'), ('yáo', '鱙'), ('yáo', '㓞'),
             ('yáo', '㤊'), ('yáo', '䂚'), ('yáo', '䆙'), ('yáo', '䋂'), ('yáo', '䍃'), ('yáo', '䚺'), ('yáo', '䚻'),
             ('yáo', '㑸'), ('yáo', '㮁'), ('yáo', '䖴'), ('yáo', '㑾'), ('yáo', '䔄'), ('yáo', '䢣'), ('yáo', '㨱'),
             ('yáo', '㺒'), ('yáo', '䌊'), ('yáo', '䠛'), ('yáo', '䌛'), ('yáo', '䬙'), ('yáo', '䉰')]
    yao_3 = [('yǎo', '咬'), ('yǎo', '杳'), ('yǎo', '窈'), ('yǎo', '舀'), ('yǎo', '仸'), ('yǎo', '宎'), ('yǎo', '岆'),
             ('yǎo', '抭'), ('yǎo', '枖'), ('yǎo', '狕'), ('yǎo', '苭'), ('yǎo', '柼'), ('yǎo', '眑'), ('yǎo', '窅'),
             ('yǎo', '偠'), ('yǎo', '婹'), ('yǎo', '崾'), ('yǎo', '溔'), ('yǎo', '蓔'), ('yǎo', '榚'), ('yǎo', '闄'),
             ('yǎo', '騕'), ('yǎo', '齩'), ('yǎo', '鷕'), ('yǎo', '䒒'), ('yǎo', '㫐'), ('yǎo', '䆞'), ('yǎo', '㟱'),
             ('yǎo', '㫏'), ('yǎo', '㴭'), ('yǎo', '㢓'), ('yǎo', '䁏'), ('yǎo', '䁘'), ('yǎo', '䚆'), ('yǎo', '䴠'),
             ('yǎo', '䯚'), ('yǎo', '䳬'), ('yǎo', '㬭'), ('yǎo', '䶧')]
    yao_4 = [('yào', '要'), ('yào', '乐'), ('yào', '药'), ('yào', '耀'), ('yào', '钥'), ('yào', '曜'), ('yào', '鹞'),
             ('yào', '疟'), ('yào', '怮'), ('yào', '穾'), ('yào', '烄'), ('yào', '袎'), ('yào', '窔'), ('yào', '筄'),
             ('yào', '葯'), ('yào', '詏'), ('yào', '熎'), ('yào', '瘧'), ('yào', '覞'), ('yào', '靿'), ('yào', '樂'),
             ('yào', '獟'), ('yào', '箹'), ('yào', '薬'), ('yào', '鼼'), ('yào', '燿'), ('yào', '艞'), ('yào', '藥'),
             ('yào', '矅'), ('yào', '纅'), ('yào', '鷂'), ('yào', '讑'), ('yào', '㔽'), ('yào', '㝔'), ('yào', '㞁'),
             ('yào', '䑬'), ('yào', '㿢'), ('yào', '䋤'), ('yào', '䙅'), ('yào', '㵸'), ('yào', '㿑'), ('yào', '䭥')]
    ye_1 = [('yē', '噎'), ('yē', '椰'), ('yē', '吔'), ('yē', '倻'), ('yē', '暍'), ('yē', '歋'), ('yē', '窫'), ('yē', '潱'),
            ('yē', '擨'), ('yē', '蠮')]
    ye_2 = [('yé', '爷'), ('yé', '邪'), ('yé', '耶'), ('yé', '揶'), ('yé', '峫'), ('yé', '捓'), ('yé', '铘'), ('yé', '爺'),
            ('yé', '瑘'), ('yé', '釾'), ('yé', '鋣'), ('yé', '鎁'), ('yé', '䓉'), ('yé', '䥺'), ('yé', '㭨'), ('yé', '㡋'),
            ('yé', '䔑'), ('yé', '㩪'), ('yé', '㱌')]
    ye_3 = [('yě', '也'), ('yě', '野'), ('yě', '冶'), ('yě', '埜'), ('yě', '嘢'), ('yě', '漜'), ('yě', '壄'), ('yě', '㙒')]
    ye_4 = [('yè', '业'), ('yè', '夜'), ('yè', '喝'), ('yè', '叶'), ('yè', '射'), ('yè', '页'), ('yè', '咽'), ('yè', '液'),
            ('yè', '谒'), ('yè', '曳'), ('yè', '拽'), ('yè', '烨'), ('yè', '掖'), ('yè', '靥'), ('yè', '邺'), ('yè', '晔'),
            ('yè', '腋'), ('yè', '曵'), ('yè', '抴'), ('yè', '亱'), ('yè', '枼'), ('yè', '洂'), ('yè', '頁'), ('yè', '捙'),
            ('yè', '枽'), ('yè', '焆'), ('yè', '堨'), ('yè', '揲'), ('yè', '殗'), ('yè', '葉'), ('yè', '墷'), ('yè', '楪'),
            ('yè', '業'), ('yè', '煠'), ('yè', '痷'), ('yè', '馌'), ('yè', '僷'), ('yè', '曅'), ('yè', '燁'), ('yè', '璍'),
            ('yè', '擖'), ('yè', '擛'), ('yè', '曄'), ('yè', '皣'), ('yè', '瞱'), ('yè', '緤'), ('yè', '鄴'), ('yè', '嶪'),
            ('yè', '嶫'), ('yè', '澲'), ('yè', '謁'), ('yè', '餣'), ('yè', '擫'), ('yè', '曗'), ('yè', '瞸'), ('yè', '鍱'),
            ('yè', '擪'), ('yè', '爗'), ('yè', '礏'), ('yè', '鎑'), ('yè', '饁'), ('yè', '鵺'), ('yè', '鐷'), ('yè', '靨'),
            ('yè', '驜'), ('yè', '瓛'), ('yè', '鸈'), ('yè', '㐖'), ('yè', '㓈'), ('yè', '㖡'), ('yè', '㖶'), ('yè', '㝣'),
            ('yè', '㪑'), ('yè', '㜇'), ('yè', '㴸'), ('yè', '㽢'), ('yè', '㥷'), ('yè', '䎨'), ('yè', '㙪'), ('yè', '㩎'),
            ('yè', '㷸'), ('yè', '䅬'), ('yè', '䈎'), ('yè', '䧨'), ('yè', '㗼'), ('yè', '䝟'), ('yè', '䤳'), ('yè', '䤶'),
            ('yè', '㱉'), ('yè', '㸣'), ('yè', '䭎'), ('yè', '䊦'), ('yè', '䳖'), ('yè', '䥟'), ('yè', '䭟'), ('yè', '䴾'),
            ('yè', '䥡'), ('yè', '䲜')]
    ye_5 = [('ye', '亪')]
    yi_1 = [('yī', '一'), ('yī', '衣'), ('yī', '依'), ('yī', '医'), ('yī', '伊'), ('yī', '揖'), ('yī', '漪'), ('yī', '噫'),
            ('yī', '咿'), ('yī', '壹'), ('yī', '猗'), ('yī', '乊'), ('yī', '弌'), ('yī', '辷'), ('yī', '衤'), ('yī', '吚'),
            ('yī', '壱'), ('yī', '祎'), ('yī', '洢'), ('yī', '悘'), ('yī', '渏'), ('yī', '畩'), ('yī', '郼'), ('yī', '铱'),
            ('yī', '蛜'), ('yī', '禕'), ('yī', '嫛'), ('yī', '稦'), ('yī', '銥'), ('yī', '嬄'), ('yī', '撎'), ('yī', '夁'),
            ('yī', '瑿'), ('yī', '鹥'), ('yī', '繄'), ('yī', '檹'), ('yī', '毉'), ('yī', '醫'), ('yī', '黟'), ('yī', '譩'),
            ('yī', '鷖'), ('yī', '黳'), ('yī', '㐆'), ('yī', '㛄'), ('yī', '㥋'), ('yī', '㘈')]
    yi_2 = [('yí', '疑'), ('yí', '移'), ('yí', '遗'), ('yí', '宜'), ('yí', '仪'), ('yí', '蛇'), ('yí', '姨'), ('yí', '夷'),
            ('yí', '咦'), ('yí', '怡'), ('yí', '颐'), ('yí', '沂'), ('yí', '贻'), ('yí', '彝'), ('yí', '圯'), ('yí', '诒'),
            ('yí', '饴'), ('yí', '荑'), ('yí', '胰'), ('yí', '痍'), ('yí', '嶷'), ('yí', '乁'), ('yí', '匜'), ('yí', '彵'),
            ('yí', '冝'), ('yí', '宐'), ('yí', '杝'), ('yí', '侇'), ('yí', '沶'), ('yí', '狋'), ('yí', '狏'), ('yí', '峓'),
            ('yí', '恞'), ('yí', '拸'), ('yí', '柂'), ('yí', '洟'), ('yí', '珆'), ('yí', '瓵'), ('yí', '迻'), ('yí', '宧'),
            ('yí', '巸'), ('yí', '扅'), ('yí', '栘'), ('yí', '桋'), ('yí', '眙'), ('yí', '袘'), ('yí', '萓'), ('yí', '釶'),
            ('yí', '椬'), ('yí', '羠'), ('yí', '蛦'), ('yí', '詒'), ('yí', '貽'), ('yí', '媐'), ('yí', '暆'), ('yí', '椸'),
            ('yí', '煕'), ('yí', '誃'), ('yí', '跠'), ('yí', '頉'), ('yí', '飴'), ('yí', '儀'), ('yí', '熪'), ('yí', '箷'),
            ('yí', '遺'), ('yí', '嶬'), ('yí', '彛'), ('yí', '彜'), ('yí', '螔'), ('yí', '頤'), ('yí', '頥'), ('yí', '寲'),
            ('yí', '簃'), ('yí', '顊'), ('yí', '鮧'), ('yí', '鴺'), ('yí', '彞'), ('yí', '謻'), ('yí', '鏔'), ('yí', '籎'),
            ('yí', '觺'), ('yí', '讉'), ('yí', '㐌'), ('yí', '㚦'), ('yí', '㦾'), ('yí', '䄬'), ('yí', '䧅'), ('yí', '㝖'),
            ('yí', '㞔'), ('yí', '㹫'), ('yí', '㼢'), ('yí', '䖊'), ('yí', '㔭'), ('yí', '㺿'), ('yí', '䐅'), ('yí', '䬮'),
            ('yí', '㥴'), ('yí', '䇵'), ('yí', '䐖'), ('yí', '䔟'), ('yí', '䬁'), ('yí', '䣡'), ('yí', '䤭'), ('yí', '䩟'),
            ('yí', '㹑'), ('yí', '䮊'), ('yí', '䞅'), ('yí', '䱌'), ('yí', '䕥'), ('yí', '㰘'), ('yí', '䲑'), ('yí', '䴊')]
    yi_3 = [('yǐ', '以'), ('yǐ', '已'), ('yǐ', '矣'), ('yǐ', '椅'), ('yǐ', '尾'), ('yǐ', '倚'), ('yǐ', '乙'), ('yǐ', '蚁'),
            ('yǐ', '蛾'), ('yǐ', '迤'), ('yǐ', '旖'), ('yǐ', '顗'), ('yǐ', '乚'), ('yǐ', '乛'), ('yǐ', '扡'), ('yǐ', '迆'),
            ('yǐ', '钇'), ('yǐ', '佁'), ('yǐ', '攺'), ('yǐ', '苡'), ('yǐ', '叕'), ('yǐ', '苢'), ('yǐ', '迱'), ('yǐ', '庡'),
            ('yǐ', '舣'), ('yǐ', '釔'), ('yǐ', '扆'), ('yǐ', '笖'), ('yǐ', '逘'), ('yǐ', '酏'), ('yǐ', '偯'), ('yǐ', '崺'),
            ('yǐ', '攲'), ('yǐ', '敧'), ('yǐ', '旑'), ('yǐ', '鈘'), ('yǐ', '鉯'), ('yǐ', '鳦'), ('yǐ', '裿'), ('yǐ', '輢'),
            ('yǐ', '嬟'), ('yǐ', '敼'), ('yǐ', '螘'), ('yǐ', '檥'), ('yǐ', '礒'), ('yǐ', '艤'), ('yǐ', '蟻'), ('yǐ', '轙'),
            ('yǐ', '齮'), ('yǐ', '㕥'), ('yǐ', '㠯'), ('yǐ', '㰝'), ('yǐ', '㕈'), ('yǐ', '䧇'), ('yǐ', '㫊'), ('yǐ', '䇣'),
            ('yǐ', '䚷'), ('yǐ', '㰻'), ('yǐ', '㾨'), ('yǐ', '䔇'), ('yǐ', '䰙'), ('yǐ', '䝝'), ('yǐ', '䧧'), ('yǐ', '㠖'),
            ('yǐ', '㩘'), ('yǐ', '䭲')]
    yi_4 = [('yì', '意'), ('yì', '义'), ('yì', '议'), ('yì', '易'), ('yì', '异'), ('yì', '亦'), ('yì', '艺'), ('yì', '食'),
            ('yì', '益'), ('yì', '射'), ('yì', '亿'), ('yì', '译'), ('yì', '忆'), ('yì', '艾'), ('yì', '翼'), ('yì', '逸'),
            ('yì', '役'), ('yì', '毅'), ('yì', '泄'), ('yì', '抑'), ('yì', '谊'), ('yì', '溢'), ('yì', '挹'), ('yì', '奕'),
            ('yì', '邑'), ('yì', '疫'), ('yì', '诣'), ('yì', '驿'), ('yì', '绎'), ('yì', '懿'), ('yì', '翌'), ('yì', '翊'),
            ('yì', '裔'), ('yì', '疙'), ('yì', '羿'), ('yì', '屹'), ('yì', '熠'), ('yì', '臆'), ('yì', '佚'), ('yì', '弈'),
            ('yì', '缢'), ('yì', '翳'), ('yì', '弋'), ('yì', '呓'), ('yì', '轶'), ('yì', '悒'), ('yì', '刈'), ('yì', '仡'),
            ('yì', '峄'), ('yì', '怿'), ('yì', '埶'), ('yì', '肄'), ('yì', '瘗'), ('yì', '蜴'), ('yì', '镒'), ('yì', '燚'),
            ('yì', '薏'), ('yì', '乂'), ('yì', '匇'), ('yì', '肊'), ('yì', '阣'), ('yì', '伇'), ('yì', '忔'), ('yì', '芅'),
            ('yì', '伿'), ('yì', '劮'), ('yì', '坄'), ('yì', '杙'), ('yì', '耴'), ('yì', '苅'), ('yì', '佾'), ('yì', '呭'),
            ('yì', '呹'), ('yì', '妷'), ('yì', '怈'), ('yì', '枍'), ('yì', '欥'), ('yì', '泆'), ('yì', '炈'), ('yì', '秇'),
            ('yì', '衪'), ('yì', '俋'), ('yì', '帟'), ('yì', '帠'), ('yì', '昳'), ('yì', '枻'), ('yì', '浂'), ('yì', '玴'),
            ('yì', '唈'), ('yì', '垼'), ('yì', '栧'), ('yì', '栺'), ('yì', '欭'), ('yì', '浥'), ('yì', '浳'), ('yì', '袣'),
            ('yì', '貤'), ('yì', '勚'), ('yì', '埸'), ('yì', '悥'), ('yì', '掜'), ('yì', '殹'), ('yì', '異'), ('yì', '羛'),
            ('yì', '萟'), ('yì', '訲'), ('yì', '訳'), ('yì', '豙'), ('yì', '豛'), ('yì', '釴'), ('yì', '隿'), ('yì', '幆'),
            ('yì', '敡'), ('yì', '晹'), ('yì', '棭'), ('yì', '殔'), ('yì', '湙'), ('yì', '焬'), ('yì', '焲'), ('yì', '蛡'),
            ('yì', '詍'), ('yì', '跇'), ('yì', '軼'), ('yì', '鄓'), ('yì', '鈠'), ('yì', '骮'), ('yì', '亄'), ('yì', '兿'),
            ('yì', '嗌'), ('yì', '獈'), ('yì', '痬'), ('yì', '睪'), ('yì', '竩'), ('yì', '義'), ('yì', '裛'), ('yì', '詣'),
            ('yì', '勩'), ('yì', '嫕'), ('yì', '廙'), ('yì', '榏'), ('yì', '潩'), ('yì', '膉'), ('yì', '蓺'), ('yì', '駅'),
            ('yì', '億'), ('yì', '槸'), ('yì', '熤'), ('yì', '熼'), ('yì', '瘞'), ('yì', '篒'), ('yì', '誼'), ('yì', '鹝'),
            ('yì', '鹢'), ('yì', '黓'), ('yì', '儗'), ('yì', '劓'), ('yì', '圛'), ('yì', '墿'), ('yì', '嬑'), ('yì', '嶧'),
            ('yì', '憶'), ('yì', '懌'), ('yì', '曀'), ('yì', '殪'), ('yì', '澺'), ('yì', '瘱'), ('yì', '瞖'), ('yì', '穓'),
            ('yì', '縊'), ('yì', '艗'), ('yì', '螠'), ('yì', '褹'), ('yì', '寱'), ('yì', '懝'), ('yì', '斁'), ('yì', '曎'),
            ('yì', '檍'), ('yì', '歝'), ('yì', '燡'), ('yì', '燱'), ('yì', '貖'), ('yì', '鮨'), ('yì', '癔'), ('yì', '藙'),
            ('yì', '藝'), ('yì', '贀'), ('yì', '鎰'), ('yì', '镱'), ('yì', '繶'), ('yì', '繹'), ('yì', '豷'), ('yì', '霬'),
            ('yì', '鯣'), ('yì', '鶂'), ('yì', '鶃'), ('yì', '鶍'), ('yì', '瀷'), ('yì', '蘙'), ('yì', '譯'), ('yì', '議'),
            ('yì', '醳'), ('yì', '醷'), ('yì', '饐'), ('yì', '囈'), ('yì', '鐿'), ('yì', '鷁'), ('yì', '鷊'), ('yì', '襼'),
            ('yì', '驛'), ('yì', '鷧'), ('yì', '虉'), ('yì', '鷾'), ('yì', '鸃'), ('yì', '讛'), ('yì', '齸'), ('yì', '㲼'),
            ('yì', '㐹'), ('yì', '㔕'), ('yì', '㚤'), ('yì', '㣻'), ('yì', '䏌'), ('yì', '㑊'), ('yì', '㞾'), ('yì', '㣇'),
            ('yì', '㳑'), ('yì', '䄩'), ('yì', '䘝'), ('yì', '㑜'), ('yì', '㖂'), ('yì', '㡼'), ('yì', '㹭'), ('yì', '䄁'),
            ('yì', '䌻'), ('yì', '㑥'), ('yì', '㛕'), ('yì', '䓃'), ('yì', '䓈'), ('yì', '䖌'), ('yì', '䣧'), ('yì', '䯆'),
            ('yì', '㴁'), ('yì', '䄿'), ('yì', '䑛'), ('yì', '䝘'), ('yì', '㓷'), ('yì', '㛳'), ('yì', '㜒'), ('yì', '㝣'),
            ('yì', '㡫'), ('yì', '㴒'), ('yì', '㴔'), ('yì', '䇩'), ('yì', '䋚'), ('yì', '䎈'), ('yì', '䓹'), ('yì', '䝯'),
            ('yì', '䣱'), ('yì', '䬥'), ('yì', '㔴'), ('yì', '㜋'), ('yì', '㣂'), ('yì', '䁆'), ('yì', '䂽'), ('yì', '䇼'),
            ('yì', '䐙'), ('yì', '䘸'), ('yì', '䛖'), ('yì', '䵝'), ('yì', '㙠'), ('yì', '㥷'), ('yì', '㱲'), ('yì', '䔬'),
            ('yì', '䴬'), ('yì', '㙪'), ('yì', '㙯'), ('yì', '㦉'), ('yì', '㵩'), ('yì', '䋵'), ('yì', '䗑'), ('yì', '䢃'),
            ('yì', '䭂'), ('yì', '䭿'), ('yì', '㘁'), ('yì', '㦤'), ('yì', '㱅'), ('yì', '㵝'), ('yì', '㵫'), ('yì', '㹓'),
            ('yì', '䃞'), ('yì', '䕍'), ('yì', '䭇'), ('yì', '䱈'), ('yì', '㲲'), ('yì', '㸣'), ('yì', '䗟'), ('yì', '㔎'),
            ('yì', '㘊'), ('yì', '㽈'), ('yì', '䑄'), ('yì', '䱒'), ('yì', '䆿'), ('yì', '䗷'), ('yì', '㢞'), ('yì', '䳬'),
            ('yì', '䉨'), ('yì', '䦴'), ('yì', '䭞'), ('yì', '䰯'), ('yì', '䖁'), ('yì', '㶠')]
    yi_5 = [('yi', '弬')]
    yin_1 = [('yīn', '因'), ('yīn', '音'), ('yīn', '阴'), ('yīn', '殷'), ('yīn', '姻'), ('yīn', '茵'), ('yīn', '荫'),
             ('yīn', '氤'), ('yīn', '湮'), ('yīn', '喑'), ('yīn', '愔'), ('yīn', '囙'), ('yīn', '阥'), ('yīn', '侌'),
             ('yīn', '垔'), ('yīn', '洇'), ('yīn', '骃'), ('yīn', '栶'), ('yīn', '欭'), ('yīn', '陰'), ('yīn', '凐'),
             ('yīn', '秵'), ('yīn', '裀'), ('yīn', '铟'), ('yīn', '陻'), ('yīn', '隂'), ('yīn', '堙'), ('yīn', '婣'),
             ('yīn', '筃'), ('yīn', '絪'), ('yīn', '歅'), ('yīn', '溵'), ('yīn', '禋'), ('yīn', '蒑'), ('yīn', '蔭'),
             ('yīn', '慇'), ('yīn', '瘖'), ('yīn', '銦'), ('yīn', '磤'), ('yīn', '緸'), ('yīn', '鞇'), ('yīn', '諲'),
             ('yīn', '霒'), ('yīn', '駰'), ('yīn', '噾'), ('yīn', '濦'), ('yīn', '闉'), ('yīn', '霠'), ('yīn', '齗'),
             ('yīn', '韾'), ('yīn', '㧢')]
    yin_2 = [('yín', '银'), ('yín', '吟'), ('yín', '淫'), ('yín', '寅'), ('yín', '垠'), ('yín', '圻'), ('yín', '狺'),
             ('yín', '崟'), ('yín', '夤'), ('yín', '龈'), ('yín', '冘'), ('yín', '乑'), ('yín', '伒'), ('yín', '犾'),
             ('yín', '苂'), ('yín', '斦'), ('yín', '烎'), ('yín', '泿'), ('yín', '圁'), ('yín', '峾'), ('yín', '珢'),
             ('yín', '荶'), ('yín', '訔'), ('yín', '訚'), ('yín', '唫'), ('yín', '婬'), ('yín', '崯'), ('yín', '訡'),
             ('yín', '鈝'), ('yín', '龂'), ('yín', '滛'), ('yín', '碒'), ('yín', '鄞'), ('yín', '蔩'), ('yín', '銀'),
             ('yín', '噖'), ('yín', '殥'), ('yín', '璌'), ('yín', '誾'), ('yín', '嚚'), ('yín', '檭'), ('yín', '蟫'),
             ('yín', '霪'), ('yín', '齦'), ('yín', '鷣'), ('yín', '㞤'), ('yín', '㐺'), ('yín', '㕂'), ('yín', '䜣'),
             ('yín', '㹞'), ('yín', '㸒'), ('yín', '㹜'), ('yín', '㝖'), ('yín', '㖗'), ('yín', '㝙'), ('yín', '㸧'),
             ('yín', '䓄'), ('yín', '䖐'), ('yín', '䪩'), ('yín', '㥲'), ('yín', '㙬'), ('yín', '䨙'), ('yín', '䡨'),
             ('yín', '䤁'), ('yín', '䴛'), ('yín', '䴦'), ('yín', '䖜'), ('yín', '䕾')]
    yin_3 = [('yǐn', '引'), ('yǐn', '隐'), ('yǐn', '饮'), ('yǐn', '尹'), ('yǐn', '瘾'), ('yǐn', '蚓'), ('yǐn', '廴'),
             ('yǐn', '吲'), ('yǐn', '粌'), ('yǐn', '硍'), ('yǐn', '赺'), ('yǐn', '淾'), ('yǐn', '鈏'), ('yǐn', '飲'),
             ('yǐn', '隠'), ('yǐn', '靷'), ('yǐn', '飮'), ('yǐn', '朄'), ('yǐn', '輑'), ('yǐn', '趛'), ('yǐn', '檃'),
             ('yǐn', '隱'), ('yǐn', '嶾'), ('yǐn', '濥'), ('yǐn', '縯'), ('yǐn', '螾'), ('yǐn', '檼'), ('yǐn', '蘟'),
             ('yǐn', '櫽'), ('yǐn', '癮'), ('yǐn', '讔'), ('yǐn', '㐆'), ('yǐn', '㧈'), ('yǐn', '䒡'), ('yǐn', '䇙'),
             ('yǐn', '㾙'), ('yǐn', '䠴'), ('yǐn', '㥯'), ('yǐn', '㥼'), ('yǐn', '㱃'), ('yǐn', '䗞'), ('yǐn', '㡥'),
             ('yǐn', '䤺'), ('yǐn', '㦩'), ('yǐn', '䌥'), ('yǐn', '䨸')]
    yin_4 = [('yìn', '印'), ('yìn', '胤'), ('yìn', '茚'), ('yìn', '洕'), ('yìn', '垽'), ('yìn', '梀'), ('yìn', '堷'),
             ('yìn', '湚'), ('yìn', '猌'), ('yìn', '廕'), ('yìn', '窨'), ('yìn', '酳'), ('yìn', '慭'), ('yìn', '癊'),
             ('yìn', '憖'), ('yìn', '憗'), ('yìn', '鮣'), ('yìn', '懚'), ('yìn', '㼉'), ('yìn', '㣧'), ('yìn', '㴈'),
             ('yìn', '䚿'), ('yìn', '㗃'), ('yìn', '䲟'), ('yìn', '㴽'), ('yìn', '䡛'), ('yìn', '㪦'), ('yìn', '䕃'),
             ('yìn', '䤃'), ('yìn', '䌠')]
    ying_1 = [('yīng', '应'), ('yīng', '英'), ('yīng', '鹰'), ('yīng', '婴'), ('yīng', '樱'), ('yīng', '莺'), ('yīng', '瑛'),
              ('yīng', '鹦'), ('yīng', '缨'), ('yīng', '膺'), ('yīng', '嘤'), ('yīng', '璎'), ('yīng', '罂'), ('yīng', '応'),
              ('yīng', '旲'), ('yīng', '柍'), ('yīng', '偀'), ('yīng', '桜'), ('yīng', '珱'), ('yīng', '啨'), ('yīng', '媖'),
              ('yīng', '愥'), ('yīng', '渶'), ('yīng', '绬'), ('yīng', '朠'), ('yīng', '楧'), ('yīng', '焸'), ('yīng', '焽'),
              ('yīng', '煐'), ('yīng', '嫈'), ('yīng', '碤'), ('yīng', '锳'), ('yīng', '撄'), ('yīng', '甇'), ('yīng', '緓'),
              ('yīng', '蝧'), ('yīng', '賏'), ('yīng', '噟'), ('yīng', '罃'), ('yīng', '褮'), ('yīng', '霙'), ('yīng', '鴬'),
              ('yīng', '嬰'), ('yīng', '應'), ('yīng', '韺'), ('yīng', '甖'), ('yīng', '鶑'), ('yīng', '鶧'), ('yīng', '嚶'),
              ('yīng', '孆'), ('yīng', '孾'), ('yīng', '攖'), ('yīng', '瀴'), ('yīng', '罌'), ('yīng', '蘡'), ('yīng', '譍'),
              ('yīng', '櫻'), ('yīng', '瓔'), ('yīng', '礯'), ('yīng', '譻'), ('yīng', '鶯'), ('yīng', '鑍'), ('yīng', '纓'),
              ('yīng', '蠳'), ('yīng', '鷪'), ('yīng', '軈'), ('yīng', '鷹'), ('yīng', '鸎'), ('yīng', '鸚')]
    ying_2 = [('yíng', '营'), ('yíng', '迎'), ('yíng', '盈'), ('yíng', '赢'), ('yíng', '莹'), ('yíng', '蝇'), ('yíng', '萤'),
              ('yíng', '萦'), ('yíng', '荧'), ('yíng', '嬴'), ('yíng', '滢'), ('yíng', '瀛'), ('yíng', '楹'), ('yíng', '潆'),
              ('yíng', '茔'), ('yíng', '荥'), ('yíng', '夃'), ('yíng', '盁'), ('yíng', '耺'), ('yíng', '営'), ('yíng', '桯'),
              ('yíng', '蛍'), ('yíng', '溁'), ('yíng', '溋'), ('yíng', '萾'), ('yíng', '僌'), ('yíng', '塋'), ('yíng', '嵤'),
              ('yíng', '蓥'), ('yíng', '滎'), ('yíng', '熒'), ('yíng', '瑩'), ('yíng', '禜'), ('yíng', '蝿'), ('yíng', '營'),
              ('yíng', '縈'), ('yíng', '螢'), ('yíng', '濙'), ('yíng', '濚'), ('yíng', '濴'), ('yíng', '藀'), ('yíng', '覮'),
              ('yíng', '謍'), ('yíng', '瀅'), ('yíng', '爃'), ('yíng', '蠅'), ('yíng', '鎣'), ('yíng', '巆'), ('yíng', '攍'),
              ('yíng', '瀠'), ('yíng', '瀯'), ('yíng', '櫿'), ('yíng', '贏'), ('yíng', '灐'), ('yíng', '籝'), ('yíng', '灜'),
              ('yíng', '籯'), ('yíng', '㕲'), ('yíng', '㢍'), ('yíng', '㴄'), ('yíng', '㨕'), ('yíng', '䀰'), ('yíng', '䁝'),
              ('yíng', '䋼'), ('yíng', '䤰'), ('yíng', '㵬'), ('yíng', '㜲'), ('yíng', '㶈'), ('yíng', '㼆'), ('yíng', '䕦'),
              ('yíng', '䪯'), ('yíng', '䑉'), ('yíng', '㿘'), ('yíng', '䃷')]
    ying_3 = [('yǐng', '影'), ('yǐng', '景'), ('yǐng', '颖'), ('yǐng', '郢'), ('yǐng', '颍'), ('yǐng', '矨'), ('yǐng', '浧'),
              ('yǐng', '梬'), ('yǐng', '颕'), ('yǐng', '摬'), ('yǐng', '潁'), ('yǐng', '瘿'), ('yǐng', '穎'), ('yǐng', '頴'),
              ('yǐng', '巊'), ('yǐng', '廮'), ('yǐng', '鐛'), ('yǐng', '癭'), ('yǐng', '㲟'), ('yǐng', '䀴'), ('yǐng', '䨍'),
              ('yǐng', '㦹'), ('yǐng', '㬐'), ('yǐng', '䔔'), ('yǐng', '㯋'), ('yǐng', '䚆'), ('yǐng', '䭊'), ('yǐng', '䭗'),
              ('yǐng', '䭘'), ('yǐng', '䑍')]
    ying_4 = [('yìng', '硬'), ('yìng', '映'), ('yìng', '媵'), ('yìng', '眏'), ('yìng', '暎'), ('yìng', '膡'), ('yìng', '鞕'),
              ('yìng', '鱦'), ('yìng', '䒢'), ('yìng', '㑞'), ('yìng', '㚞'), ('yìng', '䤝'), ('yìng', '䁐'), ('yìng', '䵥'),
              ('yìng', '䙬')]
    yo_1 = [('yō', '哟'), ('yō', '唷'), ('yō', '喲')]
    yong_1 = [('yōng', '拥'), ('yōng', '庸'), ('yōng', '佣'), ('yōng', '雍'), ('yōng', '慵'), ('yōng', '邕'), ('yōng', '痈'),
              ('yōng', '墉'), ('yōng', '壅'), ('yōng', '镛'), ('yōng', '臃'), ('yōng', '饔'), ('yōng', '傭'), ('yōng', '嗈'),
              ('yōng', '鄘'), ('yōng', '嫞'), ('yōng', '滽'), ('yōng', '槦'), ('yōng', '牅'), ('yōng', '牗'), ('yōng', '銿'),
              ('yōng', '噰'), ('yōng', '擁'), ('yōng', '澭'), ('yōng', '郺'), ('yōng', '癕'), ('yōng', '雝'), ('yōng', '鏞'),
              ('yōng', '鳙'), ('yōng', '廱'), ('yōng', '灉'), ('yōng', '鱅'), ('yōng', '鷛'), ('yōng', '癰'), ('yōng', '㴩')]
    yong_2 = [('yóng', '喁'), ('yóng', '揘'), ('yóng', '颙'), ('yóng', '顒'), ('yóng', '鰫'), ('yóng', '㝘'), ('yóng', '䗤')]
    yong_3 = [('yǒng', '永'), ('yǒng', '勇'), ('yǒng', '涌'), ('yǒng', '咏'), ('yǒng', '泳'), ('yǒng', '踊'), ('yǒng', '甬'),
              ('yǒng', '恿'), ('yǒng', '俑'), ('yǒng', '詠'), ('yǒng', '蛹'), ('yǒng', '怺'), ('yǒng', '勈'), ('yǒng', '栐'),
              ('yǒng', '埇'), ('yǒng', '悀'), ('yǒng', '柡'), ('yǒng', '惥'), ('yǒng', '愑'), ('yǒng', '湧'), ('yǒng', '硧'),
              ('yǒng', '塎'), ('yǒng', '嵱'), ('yǒng', '彮'), ('yǒng', '愹'), ('yǒng', '慂'), ('yǒng', '鲬'), ('yǒng', '踴'),
              ('yǒng', '鯒'), ('yǒng', '㑙'), ('yǒng', '㣧'), ('yǒng', '㦷'), ('yǒng', '㷏'), ('yǒng', '㙲'), ('yǒng', '䞻'),
              ('yǒng', '㽫'), ('yǒng', '䮵')]
    yong_4 = [('yòng', '用'), ('yòng', '苚'), ('yòng', '砽'), ('yòng', '蒏'), ('yòng', '醟'), ('yòng', '㞲'), ('yòng', '㶲')]
    you_1 = [('yōu', '优'), ('yōu', '忧'), ('yōu', '幽'), ('yōu', '悠'), ('yōu', '攸'), ('yōu', '呦'), ('yōu', '妋'),
             ('yōu', '怮'), ('yōu', '泑'), ('yōu', '峳'), ('yōu', '浟'), ('yōu', '逌'), ('yōu', '羪'), ('yōu', '麀'),
             ('yōu', '滺'), ('yōu', '憂'), ('yōu', '優'), ('yōu', '鄾'), ('yōu', '嚘'), ('yōu', '懮'), ('yōu', '瀀'),
             ('yōu', '獶'), ('yōu', '櫌'), ('yōu', '纋'), ('yōu', '耰'), ('yōu', '獿'), ('yōu', '㤑')]
    you_2 = [('yóu', '由'), ('yóu', '游'), ('yóu', '油'), ('yóu', '尤'), ('yóu', '犹'), ('yóu', '邮'), ('yóu', '猷'),
             ('yóu', '繇'), ('yóu', '疣'), ('yóu', '铀'), ('yóu', '鱿'), ('yóu', '尢'), ('yóu', '冘'), ('yóu', '甴'),
             ('yóu', '汼'), ('yóu', '沋'), ('yóu', '怞'), ('yóu', '肬'), ('yóu', '怣'), ('yóu', '斿'), ('yóu', '庮'),
             ('yóu', '秞'), ('yóu', '莜'), ('yóu', '莤'), ('yóu', '莸'), ('yóu', '郵'), ('yóu', '偤'), ('yóu', '蚰'),
             ('yóu', '訧'), ('yóu', '逰'), ('yóu', '揂'), ('yóu', '猶'), ('yóu', '遊'), ('yóu', '楢'), ('yóu', '鈾'),
             ('yóu', '鲉'), ('yóu', '輏'), ('yóu', '駀'), ('yóu', '蕕'), ('yóu', '蝣'), ('yóu', '魷'), ('yóu', '輶'),
             ('yóu', '鮋'), ('yóu', '䒒'), ('yóu', '䢊'), ('yóu', '㕱'), ('yóu', '㚭'), ('yóu', '㽕'), ('yóu', '䂚'),
             ('yóu', '㛜'), ('yóu', '㻀'), ('yóu', '䍃'), ('yóu', '㳺'), ('yóu', '䢟'), ('yóu', '㑸'), ('yóu', '㫍'),
             ('yóu', '䖻'), ('yóu', '䚃'), ('yóu', '䑻'), ('yóu', '䌊'), ('yóu', '㒡'), ('yóu', '㘥')]
    you_3 = [('yǒu', '有'), ('yǒu', '友'), ('yǒu', '黝'), ('yǒu', '酉'), ('yǒu', '牖'), ('yǒu', '莠'), ('yǒu', '丣'),
             ('yǒu', '卣'), ('yǒu', '苃'), ('yǒu', '羑'), ('yǒu', '栯'), ('yǒu', '梄'), ('yǒu', '聈'), ('yǒu', '铕'),
             ('yǒu', '湵'), ('yǒu', '禉'), ('yǒu', '蜏'), ('yǒu', '銪'), ('yǒu', '槱'), ('yǒu', '牗'), ('yǒu', '㕛'),
             ('yǒu', '㔽'), ('yǒu', '㶭'), ('yǒu', '䒴'), ('yǒu', '㮋'), ('yǒu', '㰶'), ('yǒu', '㾞'), ('yǒu', '䅎'),
             ('yǒu', '䬀'), ('yǒu', '䱂'), ('yǒu', '䳑')]
    you_4 = [('yòu', '又'), ('yòu', '右'), ('yòu', '幼'), ('yòu', '诱'), ('yòu', '佑'), ('yòu', '宥'), ('yòu', '侑'),
             ('yòu', '囿'), ('yòu', '柚'), ('yòu', '釉'), ('yòu', '佦'), ('yòu', '孧'), ('yòu', '狖'), ('yòu', '哊'),
             ('yòu', '姷'), ('yòu', '峟'), ('yòu', '牰'), ('yòu', '祐'), ('yòu', '迶'), ('yòu', '唀'), ('yòu', '梎'),
             ('yòu', '痏'), ('yòu', '蚴'), ('yòu', '亴'), ('yòu', '貁'), ('yòu', '酭'), ('yòu', '誘'), ('yòu', '鼬'),
             ('yòu', '櫾'), ('yòu', '㓜'), ('yòu', '㐛'), ('yòu', '㹨'), ('yòu', '㕗'), ('yòu', '䀁'), ('yòu', '䆜'),
             ('yòu', '䞥'), ('yòu', '䛻'), ('yòu', '㺠')]
    yu_1 = [('yū', '迂'), ('yū', '淤'), ('yū', '瘀'), ('yū', '纡'), ('yū', '込'), ('yū', '扜'), ('yū', '扝'), ('yū', '迃'),
            ('yū', '穻'), ('yū', '陓'), ('yū', '紆'), ('yū', '唹'), ('yū', '盓'), ('yū', '箊'), ('yū', '㝼')]
    yu_2 = [('yú', '于'), ('yú', '余'), ('yú', '鱼'), ('yú', '邪'), ('yú', '予'), ('yú', '愚'), ('yú', '愉'), ('yú', '俞'),
            ('yú', '渔'), ('yú', '虞'), ('yú', '於'), ('yú', '瑜'), ('yú', '舆'), ('yú', '娱'), ('yú', '逾'), ('yú', '臾'),
            ('yú', '馀'), ('yú', '隅'), ('yú', '榆'), ('yú', '盂'), ('yú', '渝'), ('yú', '妤'), ('yú', '欤'), ('yú', '禺'),
            ('yú', '谀'), ('yú', '揄'), ('yú', '腴'), ('yú', '觎'), ('yú', '竽'), ('yú', '舁'), ('yú', '萸'), ('yú', '雩'),
            ('yú', '丂'), ('yú', '亐'), ('yú', '邘'), ('yú', '伃'), ('yú', '扵'), ('yú', '杅'), ('yú', '玗'), ('yú', '玙'),
            ('yú', '衧'), ('yú', '乻'), ('yú', '兪'), ('yú', '捓'), ('yú', '茰'), ('yú', '虶'), ('yú', '娛'), ('yú', '娪'),
            ('yú', '娯'), ('yú', '桙'), ('yú', '狳'), ('yú', '酑'), ('yú', '釪'), ('yú', '隃'), ('yú', '魚'), ('yú', '堣'),
            ('yú', '堬'), ('yú', '婾'), ('yú', '媮'), ('yú', '崳'), ('yú', '嵎'), ('yú', '嵛'), ('yú', '楰'), ('yú', '湡'),
            ('yú', '畬'), ('yú', '萮'), ('yú', '骬'), ('yú', '楡'), ('yú', '歈'), ('yú', '牏'), ('yú', '艅'), ('yú', '漁'),
            ('yú', '睮'), ('yú', '窬'), ('yú', '褕'), ('yú', '歶'), ('yú', '羭'), ('yú', '蕍'), ('yú', '蝓'), ('yú', '諛'),
            ('yú', '雓'), ('yú', '餘'), ('yú', '魣'), ('yú', '嬩'), ('yú', '澞'), ('yú', '覦'), ('yú', '踰'), ('yú', '歟'),
            ('yú', '璵'), ('yú', '螸'), ('yú', '輿'), ('yú', '鍝'), ('yú', '謣'), ('yú', '髃'), ('yú', '鮽'), ('yú', '旟'),
            ('yú', '籅'), ('yú', '騟'), ('yú', '鯲'), ('yú', '蘛'), ('yú', '轝'), ('yú', '鰅'), ('yú', '鷠'), ('yú', '鸆'),
            ('yú', '齵'), ('yú', '㚥'), ('yú', '㬰'), ('yú', '㪀'), ('yú', '㺮'), ('yú', '㧕'), ('yú', '㭌'), ('yú', '㽳'),
            ('yú', '䄨'), ('yú', '㤤'), ('yú', '䂛'), ('yú', '䍂'), ('yú', '䢓'), ('yú', '㻀'), ('yú', '䓊'), ('yú', '㥔'),
            ('yú', '㥚'), ('yú', '㪌'), ('yú', '㳛'), ('yú', '䄏'), ('yú', '䏸'), ('yú', '㥥'), ('yú', '㫹'), ('yú', '䩒'),
            ('yú', '㬂'), ('yú', '㷒'), ('yú', '㼶'), ('yú', '䃋'), ('yú', '䔡'), ('yú', '㒜'), ('yú', '䐳'), ('yú', '䰻'),
            ('yú', '㺞'), ('yú', '䁩'), ('yú', '䜽'), ('yú', '㦛'), ('yú', '䗨'), ('yú', '䬔'), ('yú', '䲣'), ('yú', '䱷'),
            ('yú', '䞕'), ('yú', '㶛'), ('yú', '䱾')]
    yu_3 = [('yǔ', '与'), ('yǔ', '语'), ('yǔ', '雨'), ('yǔ', '宇'), ('yǔ', '羽'), ('yǔ', '禹'), ('yǔ', '庾'), ('yǔ', '屿'),
            ('yǔ', '伛'), ('yǔ', '圄'), ('yǔ', '圉'), ('yǔ', '俁'), ('yǔ', '俣'), ('yǔ', '挧'), ('yǔ', '祤'), ('yǔ', '偊'),
            ('yǔ', '匬'), ('yǔ', '敔'), ('yǔ', '鄅'), ('yǔ', '斞'), ('yǔ', '萭'), ('yǔ', '傴'), ('yǔ', '寙'), ('yǔ', '楀'),
            ('yǔ', '瑀'), ('yǔ', '瘐'), ('yǔ', '與'), ('yǔ', '語'), ('yǔ', '窳'), ('yǔ', '頨'), ('yǔ', '龉'), ('yǔ', '噳'),
            ('yǔ', '嶼'), ('yǔ', '懙'), ('yǔ', '貐'), ('yǔ', '斔'), ('yǔ', '穥'), ('yǔ', '麌'), ('yǔ', '齬'), ('yǔ', '㡰'),
            ('yǔ', '㲾'), ('yǔ', '䣁'), ('yǔ', '㑨'), ('yǔ', '㔱'), ('yǔ', '㼌'), ('yǔ', '㙑'), ('yǔ', '㝢'), ('yǔ', '㺄'),
            ('yǔ', '㒁'), ('yǔ', '㣃'), ('yǔ', '㠘'), ('yǔ', '䙔'), ('yǔ', '䨞'), ('yǔ', '䥏'), ('yǔ', '兼')]
    yu_4 = [('yù', '玉'), ('yù', '育'), ('yù', '欲'), ('yù', '遇'), ('yù', '域'), ('yù', '预'), ('yù', '吾'), ('yù', '奥'),
            ('yù', '愈'), ('yù', '御'), ('yù', '狱'), ('yù', '尉'), ('yù', '誉'), ('yù', '郁'), ('yù', '豫'), ('yù', '寓'),
            ('yù', '吁'), ('yù', '浴'), ('yù', '裕'), ('yù', '喻'), ('yù', '粥'), ('yù', '谕'), ('yù', '阈'), ('yù', '驭'),
            ('yù', '钰'), ('yù', '妪'), ('yù', '昱'), ('yù', '毓'), ('yù', '聿'), ('yù', '煜'), ('yù', '芋'), ('yù', '汩'),
            ('yù', '熨'), ('yù', '峪'), ('yù', '鬻'), ('yù', '彧'), ('yù', '矞'), ('yù', '蜮'), ('yù', '燠'), ('yù', '肀'),
            ('yù', '圫'), ('yù', '芌'), ('yù', '忬'), ('yù', '灹'), ('yù', '饫'), ('yù', '欥'), ('yù', '秗'), ('yù', '茟'),
            ('yù', '俼'), ('yù', '叞'), ('yù', '栯'), ('yù', '砡'), ('yù', '堉'), ('yù', '悆'), ('yù', '惐'), ('yù', '捥'),
            ('yù', '淢'), ('yù', '淯'), ('yù', '痏'), ('yù', '粖'), ('yù', '翑'), ('yù', '袬'), ('yù', '逳'), ('yù', '喅'),
            ('yù', '喩'), ('yù', '媀'), ('yù', '庽'), ('yù', '棛'), ('yù', '棜'), ('yù', '棫'), ('yù', '焴'), ('yù', '琙'),
            ('yù', '琟'), ('yù', '硢'), ('yù', '硲'), ('yù', '飫'), ('yù', '馭'), ('yù', '鹆'), ('yù', '奧'), ('yù', '滪'),
            ('yù', '稢'), ('yù', '罭'), ('yù', '艈'), ('yù', '蒮'), ('yù', '蓣'), ('yù', '鈺'), ('yù', '預'), ('yù', '僪'),
            ('yù', '嫗'), ('yù', '嶎'), ('yù', '戫'), ('yù', '澚'), ('yù', '獄'), ('yù', '瘉'), ('yù', '緎'), ('yù', '蜟'),
            ('yù', '輍'), ('yù', '銉'), ('yù', '隩'), ('yù', '慾'), ('yù', '潏'), ('yù', '稶'), ('yù', '蓹'), ('yù', '薁'),
            ('yù', '遹'), ('yù', '鋊'), ('yù', '鳿'), ('yù', '澦'), ('yù', '燏'), ('yù', '蕷'), ('yù', '藇'), ('yù', '諭'),
            ('yù', '錥'), ('yù', '閾'), ('yù', '鴥'), ('yù', '鴧'), ('yù', '鴪'), ('yù', '儥'), ('yù', '礇'), ('yù', '禦'),
            ('yù', '魊'), ('yù', '鹬'), ('yù', '癒'), ('yù', '礖'), ('yù', '礜'), ('yù', '篽'), ('yù', '醧'), ('yù', '鵒'),
            ('yù', '櫲'), ('yù', '饇'), ('yù', '蘌'), ('yù', '譽'), ('yù', '鐭'), ('yù', '霱'), ('yù', '雤'), ('yù', '欎'),
            ('yù', '驈'), ('yù', '籞'), ('yù', '鱊'), ('yù', '鷸'), ('yù', '鸒'), ('yù', '欝'), ('yù', '軉'), ('yù', '鬰'),
            ('yù', '鬱'), ('yù', '灪'), ('yù', '籲'), ('yù', '爩'), ('yù', '㧒'), ('yù', '㤜'), ('yù', '㤢'), ('yù', '㳚'),
            ('yù', '䢖'), ('yù', '䧕'), ('yù', '㚜'), ('yù', '㹼'), ('yù', '㮋'), ('yù', '㰲'), ('yù', '㷉'), ('yù', '䋖'),
            ('yù', '䎉'), ('yù', '䛎'), ('yù', '䞝'), ('yù', '㽣'), ('yù', '䘱'), ('yù', '䘻'), ('yù', '䛕'), ('yù', '䫻'),
            ('yù', '㵄'), ('yù', '䁌'), ('yù', '䈅'), ('yù', '䋭'), ('yù', '䍞'), ('yù', '䢩'), ('yù', '䨒'), ('yù', '㻰'),
            ('yù', '䤋'), ('yù', '䬄'), ('yù', '䂊'), ('yù', '䘘'), ('yù', '䮇'), ('yù', '㦽'), ('yù', '䆷'), ('yù', '䨁'),
            ('yù', '䰥'), ('yù', '䳑'), ('yù', '㺠'), ('yù', '䉛'), ('yù', '䮙'), ('yù', '䵥'), ('yù', '䬛'), ('yù', '䵫'),
            ('yù', '䜡'), ('yù', '䴁'), ('yù', '㠨'), ('yù', '䖇')]
    yuan_1 = [('yuān', '冤'), ('yuān', '渊'), ('yuān', '宛'), ('yuān', '鸳'), ('yuān', '鸢'), ('yuān', '囦'), ('yuān', '肙'),
              ('yuān', '剈'), ('yuān', '弲'), ('yuān', '悁'), ('yuān', '眢'), ('yuān', '寃'), ('yuān', '涴'), ('yuān', '渁'),
              ('yuān', '渆'), ('yuān', '渕'), ('yuān', '惌'), ('yuān', '淵'), ('yuān', '葾'), ('yuān', '棩'), ('yuān', '蒬'),
              ('yuān', '蜎'), ('yuān', '裷'), ('yuān', '鹓'), ('yuān', '箢'), ('yuān', '鳶'), ('yuān', '蜵'), ('yuān', '駌'),
              ('yuān', '鴛'), ('yuān', '嬽'), ('yuān', '鵷'), ('yuān', '灁'), ('yuān', '鼘'), ('yuān', '鼝'), ('yuān', '䡝'),
              ('yuān', '䨊')]
    yuan_2 = [('yuán', '原'), ('yuán', '元'), ('yuán', '员'), ('yuán', '源'), ('yuán', '园'), ('yuán', '缘'), ('yuán', '圆'),
              ('yuán', '袁'), ('yuán', '援'), ('yuán', '猿'), ('yuán', '辕'), ('yuán', '沅'), ('yuán', '垣'), ('yuán', '爰'),
              ('yuán', '鼋'), ('yuán', '圜'), ('yuán', '円'), ('yuán', '贠'), ('yuán', '邧'), ('yuán', '妧'), ('yuán', '芫'),
              ('yuán', '杬'), ('yuán', '茒'), ('yuán', '貟'), ('yuán', '員'), ('yuán', '笎'), ('yuán', '蚖'), ('yuán', '厡'),
              ('yuán', '酛'), ('yuán', '喛'), ('yuán', '圎'), ('yuán', '湲'), ('yuán', '猨'), ('yuán', '鈨'), ('yuán', '園'),
              ('yuán', '圓'), ('yuán', '塬'), ('yuán', '媴'), ('yuán', '嫄'), ('yuán', '楥'), ('yuán', '溒'), ('yuán', '蒝'),
              ('yuán', '榞'), ('yuán', '榬'), ('yuán', '緣'), ('yuán', '縁'), ('yuán', '蝝'), ('yuán', '蝯'), ('yuán', '褤'),
              ('yuán', '魭'), ('yuán', '橼'), ('yuán', '羱'), ('yuán', '薗'), ('yuán', '螈'), ('yuán', '黿'), ('yuán', '謜'),
              ('yuán', '轅'), ('yuán', '鎱'), ('yuán', '櫞'), ('yuán', '邍'), ('yuán', '騵'), ('yuán', '鶢'), ('yuán', '鶰'),
              ('yuán', '厵'), ('yuán', '䖠'), ('yuán', '㘣'), ('yuán', '㛪'), ('yuán', '䖤'), ('yuán', '䟦'), ('yuán', '䬧'),
              ('yuán', '㟲'), ('yuán', '㟶'), ('yuán', '㥳'), ('yuán', '㹉'), ('yuán', '䲮'), ('yuán', '䲻'), ('yuán', '䳁'),
              ('yuán', '䝠'), ('yuán', '䳒'), ('yuán', '䳣')]
    yuan_3 = [('yuǎn', '远'), ('yuǎn', '盶'), ('yuǎn', '逺'), ('yuǎn', '遠'), ('yuǎn', '薳'), ('yuǎn', '鋺'), ('yuǎn', '䛇'),
              ('yuǎn', '䛄'), ('yuǎn', '㼂'), ('yuǎn', '䩩')]
    yuan_4 = [('yuàn', '院'), ('yuàn', '愿'), ('yuàn', '怨'), ('yuàn', '苑'), ('yuàn', '媛'), ('yuàn', '瑗'), ('yuàn', '垸'),
              ('yuàn', '掾'), ('yuàn', '夗'), ('yuàn', '妴'), ('yuàn', '衏'), ('yuàn', '傆'), ('yuàn', '禐'), ('yuàn', '裫'),
              ('yuàn', '褑'), ('yuàn', '噮'), ('yuàn', '願'), ('yuàn', '㐾'), ('yuàn', '䏍'), ('yuàn', '㭇'), ('yuàn', '㤪'),
              ('yuàn', '䅈'), ('yuàn', '䣰'), ('yuàn', '㥐'), ('yuàn', '䭴'), ('yuàn', '䝹'), ('yuàn', '䬼'), ('yuàn', '䬇')]
    yue_1 = [('yuē', '曰'), ('yuē', '约'), ('yuē', '曱'), ('yuē', '扚'), ('yuē', '約'), ('yuē', '啘'), ('yuē', '箹'),
             ('yuē', '矱')]
    yue_2 = [('yuě', '哕'), ('yuě', '噦')]
    yue_3 = [('yuè', '说'), ('yuè', '月'), ('yuè', '乐'), ('yuè', '越'), ('yuè', '跃'), ('yuè', '岳'), ('yuè', '悦'),
             ('yuè', '阅'), ('yuè', '钥'), ('yuè', '兑'), ('yuè', '粤'), ('yuè', '钺'), ('yuè', '樾'), ('yuè', '栎'),
             ('yuè', '戉'), ('yuè', '兊'), ('yuè', '刖'), ('yuè', '兌'), ('yuè', '妜'), ('yuè', '岄'), ('yuè', '抈'),
             ('yuè', '礿'), ('yuè', '枂'), ('yuè', '泧'), ('yuè', '玥'), ('yuè', '恱'), ('yuè', '哾'), ('yuè', '悅'),
             ('yuè', '蚎'), ('yuè', '蚏'), ('yuè', '軏'), ('yuè', '捳'), ('yuè', '跀'), ('yuè', '鈅'), ('yuè', '楽'),
             ('yuè', '粵'), ('yuè', '鉞'), ('yuè', '說'), ('yuè', '説'), ('yuè', '樂'), ('yuè', '閱'), ('yuè', '閲'),
             ('yuè', '嬳'), ('yuè', '篗'), ('yuè', '髺'), ('yuè', '嶽'), ('yuè', '臒'), ('yuè', '龠'), ('yuè', '擽'),
             ('yuè', '矆'), ('yuè', '櫟'), ('yuè', '籆'), ('yuè', '瀹'), ('yuè', '蘥'), ('yuè', '黦'), ('yuè', '爚'),
             ('yuè', '禴'), ('yuè', '趯'), ('yuè', '躍'), ('yuè', '籥'), ('yuè', '鑰'), ('yuè', '鸑'), ('yuè', '籰'),
             ('yuè', '鸙'), ('yuè', '㧒'), ('yuè', '䢁'), ('yuè', '䆕'), ('yuè', '䒸'), ('yuè', '䎳'), ('yuè', '䋐'),
             ('yuè', '䎀'), ('yuè', '䡇'), ('yuè', '㭾'), ('yuè', '䆢'), ('yuè', '䟠'), ('yuè', '䋤'), ('yuè', '㹊'),
             ('yuè', '䤦'), ('yuè', '䬂'), ('yuè', '㜧'), ('yuè', '㬦'), ('yuè', '㯞'), ('yuè', '㵸'), ('yuè', '㜰'),
             ('yuè', '䥃'), ('yuè', '䶳'), ('yuè', '㰛'), ('yuè', '䢲'), ('yuè', '䖃'), ('yuè', '䟑'), ('yuè', '䠯'),
             ('yuè', '补')]
    yun_1 = [('yūn', '氲'), ('yūn', '涒'), ('yūn', '蒀'), ('yūn', '煴'), ('yūn', '蒕'), ('yūn', '氳'), ('yūn', '煾'),
             ('yūn', '熅'), ('yūn', '奫'), ('yūn', '蝹'), ('yūn', '赟'), ('yūn', '馧'), ('yūn', '贇')]
    yun_2 = [('yún', '云'), ('yún', '员'), ('yún', '芸'), ('yún', '匀'), ('yún', '筠'), ('yún', '昀'), ('yún', '耘'),
             ('yún', '纭'), ('yún', '澐'), ('yún', '勻'), ('yún', '伝'), ('yún', '囩'), ('yún', '妘'), ('yún', '抣'),
             ('yún', '沄'), ('yún', '畇'), ('yún', '眃'), ('yún', '秐'), ('yún', '貟'), ('yún', '郧'), ('yún', '員'),
             ('yún', '涢'), ('yún', '紜'), ('yún', '耺'), ('yún', '鄖'), ('yún', '雲'), ('yún', '愪'), ('yún', '溳'),
             ('yún', '筼'), ('yún', '蒷'), ('yún', '熉'), ('yún', '蕓'), ('yún', '鋆'), ('yún', '橒'), ('yún', '篔'),
             ('yún', '縜'), ('yún', '䢵'), ('yún', '㛣'), ('yún', '㚃'), ('yún', '㜏'), ('yún', '䉙')]
    yun_3 = [('yǔn', '允'), ('yǔn', '陨'), ('yǔn', '殒'), ('yǔn', '阭'), ('yǔn', '夽'), ('yǔn', '抎'), ('yǔn', '狁'),
             ('yǔn', '玧'), ('yǔn', '荺'), ('yǔn', '喗'), ('yǔn', '鈗'), ('yǔn', '隕'), ('yǔn', '殞'), ('yǔn', '馻'),
             ('yǔn', '磒'), ('yǔn', '賱'), ('yǔn', '霣'), ('yǔn', '齫'), ('yǔn', '齳'), ('yǔn', '䇖'), ('yǔn', '䦾'),
             ('yǔn', '䤞'), ('yǔn', '䪳'), ('yǔn', '䞫'), ('yǔn', '㩈'), ('yǔn', '䆬'), ('yǔn', '䡝'), ('yǔn', '䨶')]
    yun_4 = [('yùn', '运'), ('yùn', '韵'), ('yùn', '晕'), ('yùn', '孕'), ('yùn', '蕴'), ('yùn', '酝'), ('yùn', '愠'),
             ('yùn', '韫'), ('yùn', '熨'), ('yùn', '郓'), ('yùn', '恽'), ('yùn', '贠'), ('yùn', '枟'), ('yùn', '菀'),
             ('yùn', '鄆'), ('yùn', '傊'), ('yùn', '惲'), ('yùn', '缊'), ('yùn', '運'), ('yùn', '慍'), ('yùn', '暈'),
             ('yùn', '榅'), ('yùn', '煇'), ('yùn', '腪'), ('yùn', '褞'), ('yùn', '緷'), ('yùn', '緼'), ('yùn', '蕰'),
             ('yùn', '縕'), ('yùn', '薀'), ('yùn', '醖'), ('yùn', '醞'), ('yùn', '餫'), ('yùn', '藴'), ('yùn', '鞰'),
             ('yùn', '韗'), ('yùn', '韞'), ('yùn', '蘊'), ('yùn', '韻'), ('yùn', '㞌'), ('yùn', '㚺'), ('yùn', '㚞'),
             ('yùn', '㟦'), ('yùn', '㷉'), ('yùn', '㾓'), ('yùn', '㒁'), ('yùn', '䲰'), ('yùn', '䚋'), ('yùn', '䩵'),
             ('yùn', '䵴')]
    za_1 = [('zā', '扎'), ('zā', '匝'), ('zā', '咂'), ('zā', '拶'), ('zā', '帀'), ('zā', '沞'), ('zā', '迊'), ('zā', '桚'),
            ('zā', '紥'), ('zā', '紮'), ('zā', '鉔'), ('zā', '噈'), ('zā', '魳'), ('zā', '臜'), ('zā', '臢')]
    za_2 = [('zá', '咱'), ('zá', '杂'), ('zá', '砸'), ('zá', '沯'), ('zá', '偺'), ('zá', '喒'), ('zá', '韴'), ('zá', '雑'),
            ('zá', '襍'), ('zá', '雜'), ('zá', '囃'), ('zá', '囋'), ('zá', '囐'), ('zá', '雥'), ('zá', '㳨'), ('zá', '䞙'),
            ('zá', '䦈'), ('zá', '䨿'), ('zá', '䪞'), ('zá', '䕹')]
    za_3 = [('zǎ', '咋')]
    zai_1 = [('zāi', '灾'), ('zāi', '哉'), ('zāi', '栽'), ('zāi', '菑'), ('zāi', '災'), ('zāi', '甾'), ('zāi', '烖'),
             ('zāi', '畠'), ('zāi', '渽'), ('zāi', '溨'), ('zāi', '睵'), ('zāi', '賳'), ('zāi', '㦲')]
    zai_2 = [('zǎi', '载'), ('zǎi', '仔'), ('zǎi', '宰'), ('zǎi', '崽'), ('zǎi', '㞨'), ('zǎi', '䣬'), ('zǎi', '㴓'),
             ('zǎi', '㱰'), ('zǎi', '䏁'), ('zǎi', '䮨')]
    zai_3 = [('zài', '在'), ('zài', '再'), ('zài', '扗'), ('zài', '抂'), ('zài', '洅'), ('zài', '傤'), ('zài', '載'),
             ('zài', '酨'), ('zài', '儎'), ('zài', '縡'), ('zài', '䵧')]
    zan_1 = [('zān', '簪'), ('zān', '兂'), ('zān', '糌'), ('zān', '橵'), ('zān', '篸'), ('zān', '簮'), ('zān', '鵤'),
             ('zān', '鐕'), ('zān', '鐟')]
    zan_2 = [('zán', '咱'), ('zán', '偺'), ('zán', '喒')]
    zan_3 = [('zǎn', '攒'), ('zǎn', '拶'), ('zǎn', '昝'), ('zǎn', '趱'), ('zǎn', '桚'), ('zǎn', '寁'), ('zǎn', '揝'),
             ('zǎn', '噆'), ('zǎn', '撍'), ('zǎn', '儧'), ('zǎn', '攅'), ('zǎn', '儹'), ('zǎn', '攢'), ('zǎn', '趲'),
             ('zǎn', '㳨'), ('zǎn', '㤰'), ('zǎn', '䍝'), ('zǎn', '䙉'), ('zǎn', '䥄'), ('zǎn', '䭕')]
    zan_4 = [('zàn', '赞'), ('zàn', '暂'), ('zàn', '錾'), ('zàn', '瓒'), ('zàn', '暫'), ('zàn', '賛'), ('zàn', '鄼'),
             ('zàn', '濽'), ('zàn', '蹔'), ('zàn', '酂'), ('zàn', '瓉'), ('zàn', '贊'), ('zàn', '鏨'), ('zàn', '鏩'),
             ('zàn', '酇'), ('zàn', '囋'), ('zàn', '灒'), ('zàn', '讃'), ('zàn', '瓚'), ('zàn', '禶'), ('zàn', '穳'),
             ('zàn', '襸'), ('zàn', '讚'), ('zàn', '饡'), ('zàn', '㟛'), ('zàn', '䬤'), ('zàn', '㔆'), ('zàn', '㣅'),
             ('zàn', '㨻'), ('zàn', '䗞'), ('zàn', '㙻'), ('zàn', '䟃'), ('zàn', '䟅'), ('zàn', '㜺')]
    zang_1 = [('zāng', '赃'), ('zāng', '臧'), ('zāng', '匨'), ('zāng', '牂'), ('zāng', '羘'), ('zāng', '賍'), ('zāng', '賘'),
              ('zāng', '贓'), ('zāng', '髒'), ('zāng', '贜')]
    zang_2 = [('zǎng', '驵'), ('zǎng', '駔')]
    zang_3 = [('zàng', '藏'), ('zàng', '脏'), ('zàng', '葬'), ('zàng', '奘'), ('zàng', '弉'), ('zàng', '塟'), ('zàng', '蔵'),
              ('zàng', '銺'), ('zàng', '臓'), ('zàng', '臟'), ('zàng', '㘸')]
    zao_1 = [('zāo', '遭'), ('zāo', '糟'), ('zāo', '傮'), ('zāo', '蹧'), ('zāo', '醩'), ('zāo', '㷮'), ('zāo', '㯥'),
             ('zāo', '䜊')]
    zao_2 = [('záo', '凿'), ('záo', '鑿'), ('záo', '䥣')]
    zao_3 = [('zǎo', '早'), ('zǎo', '澡'), ('zǎo', '枣'), ('zǎo', '藻'), ('zǎo', '蚤'), ('zǎo', '栆'), ('zǎo', '棗'),
             ('zǎo', '璅'), ('zǎo', '璪'), ('zǎo', '薻'), ('zǎo', '䖣'), ('zǎo', '䗢'), ('zǎo', '䲃')]
    zao_4 = [('zào', '造'), ('zào', '躁'), ('zào', '噪'), ('zào', '皂'), ('zào', '燥'), ('zào', '灶'), ('zào', '皁'),
             ('zào', '唕'), ('zào', '唣'), ('zào', '梍'), ('zào', '喿'), ('zào', '慥'), ('zào', '煰'), ('zào', '艁'),
             ('zào', '簉'), ('zào', '竃'), ('zào', '竈'), ('zào', '譟'), ('zào', '趮'), ('zào', '㲧'), ('zào', '䒃')]
    ze_1 = [('zé', '则'), ('zé', '责'), ('zé', '择'), ('zé', '泽'), ('zé', '啧'), ('zé', '咋'), ('zé', '帻'), ('zé', '択'),
            ('zé', '沢'), ('zé', '泎'), ('zé', '迮'), ('zé', '則'), ('zé', '唶'), ('zé', '笮'), ('zé', '舴'), ('zé', '責'),
            ('zé', '溭'), ('zé', '滜'), ('zé', '睪'), ('zé', '矠'), ('zé', '飵'), ('zé', '嘖'), ('zé', '嫧'), ('zé', '幘'),
            ('zé', '箦'), ('zé', '蔶'), ('zé', '樍'), ('zé', '歵'), ('zé', '諎'), ('zé', '赜'), ('zé', '擇'), ('zé', '澤'),
            ('zé', '皟'), ('zé', '瞔'), ('zé', '簀'), ('zé', '耫'), ('zé', '礋'), ('zé', '襗'), ('zé', '謮'), ('zé', '賾'),
            ('zé', '蠌'), ('zé', '灂'), ('zé', '齚'), ('zé', '齰'), ('zé', '鸅'), ('zé', '䂝'), ('zé', '㟙'), ('zé', '㳻'),
            ('zé', '䇥'), ('zé', '㖽'), ('zé', '㢎'), ('zé', '㮣'), ('zé', '䅚'), ('zé', '㣱'), ('zé', '㥽'), ('zé', '㻭'),
            ('zé', '䯔'), ('zé', '䰹'), ('zé', '䕉'), ('zé', '䕪'), ('zé', '䶡'), ('zé', '䶦')]
    ze_2 = [('zè', '侧'), ('zè', '仄'), ('zè', '庂'), ('zè', '汄'), ('zè', '昃'), ('zè', '昗'), ('zè', '捑'), ('zè', '側'),
            ('zè', '崱'), ('zè', '稄'), ('zè', '㳁'), ('zè', '䔾')]
    zei_1 = [('zéi', '贼'), ('zéi', '戝'), ('zéi', '賊'), ('zéi', '鲗'), ('zéi', '蠈'), ('zéi', '鰂'), ('zéi', '鱡'),
             ('zéi', '㖽')]
    zen_1 = [('zēn', '撍'), ('zēn', '㻸')]
    zen_2 = [('zěn', '怎')]
    zen_3 = [('zèn', '谮'), ('zèn', '譖'), ('zèn', '䫈')]
    zeng_1 = [('zēng', '曾'), ('zēng', '增'), ('zēng', '憎'), ('zēng', '缯'), ('zēng', '曽'), ('zēng', '増'), ('zēng', '鄫'),
              ('zēng', '橧'), ('zēng', '璔'), ('zēng', '縡'), ('zēng', '矰'), ('zēng', '磳'), ('zēng', '竲'), ('zēng', '罾'),
              ('zēng', '繒'), ('zēng', '譄'), ('zēng', '鱛')]
    zeng_2 = [('zěng', '㽪')]
    zeng_3 = [('zèng', '综'), ('zèng', '赠'), ('zèng', '锃'), ('zèng', '甑'), ('zèng', '綜'), ('zèng', '鋥'), ('zèng', '熷'),
              ('zèng', '鬵'), ('zèng', '贈'), ('zèng', '囎'), ('zèng', '䇸'), ('zèng', '䙢'), ('zèng', '䰝'), ('zèng', '䵴')]
    zha_1 = [('zhā', '查'), ('zhā', '扎'), ('zhā', '喳'), ('zhā', '渣'), ('zhā', '咋'), ('zhā', '楂'), ('zhā', '抯'),
             ('zhā', '挓'), ('zhā', '柤'), ('zhā', '査'), ('zhā', '哳'), ('zhā', '紥'), ('zhā', '偧'), ('zhā', '紮'),
             ('zhā', '揸'), ('zhā', '飵'), ('zhā', '劄'), ('zhā', '摣'), ('zhā', '潳'), ('zhā', '皶'), ('zhā', '樝'),
             ('zhā', '觰'), ('zhā', '皻'), ('zhā', '譇'), ('zhā', '齄'), ('zhā', '齇'), ('zhā', '㗬'), ('zhā', '㪥'),
             ('zhā', '䶥')]
    zha_2 = [('zhá', '札'), ('zhá', '闸'), ('zhá', '喋'), ('zhá', '铡'), ('zhá', '甴'), ('zhá', '軋'), ('zhá', '剳'),
             ('zhá', '蚻'), ('zhá', '煠'), ('zhá', '牐'), ('zhá', '閘'), ('zhá', '箚'), ('zhá', '霅'), ('zhá', '耫'),
             ('zhá', '鍘'), ('zhá', '譗'), ('zhá', '㱜'), ('zhá', '㳐'), ('zhá', '䄰'), ('zhá', '㴙'), ('zhá', '㔍'),
             ('zhá', '㩹'), ('zhá', '䮜'), ('zhá', '䥷'), ('zhá', '䵵')]
    zha_3 = [('zhǎ', '眨'), ('zhǎ', '厏'), ('zhǎ', '拃'), ('zhǎ', '苲'), ('zhǎ', '砟'), ('zhǎ', '鲊'), ('zhǎ', '鲝'),
             ('zhǎ', '諎'), ('zhǎ', '鮓'), ('zhǎ', '鮺'), ('zhǎ', '㡸'), ('zhǎ', '㑵'), ('zhǎ', '㞚'), ('zhǎ', '㒀'),
             ('zhǎ', '㷢'), ('zhǎ', '䃎'), ('zhǎ', '䙄'), ('zhǎ', '䋾'), ('zhǎ', '䛽'), ('zhǎ', '㽪'), ('zhǎ', '䕢'),
             ('zhǎ', '䱹'), ('zhǎ', '䵙')]
    zha_4 = [('zhà', '炸'), ('zhà', '诈'), ('zhà', '乍'), ('zhà', '栅'), ('zhà', '吒'), ('zhà', '榨'), ('zhà', '咤'),
             ('zhà', '怍'), ('zhà', '蚱'), ('zhà', '灹'), ('zhà', '奓'), ('zhà', '柞'), ('zhà', '宱'), ('zhà', '痄'),
             ('zhà', '喥'), ('zhà', '溠'), ('zhà', '詐'), ('zhà', '搾'), ('zhà', '醡'), ('zhà', '㚫'), ('zhà', '䆛'),
             ('zhà', '㓃'), ('zhà', '䄍'), ('zhà', '䖳'), ('zhà', '䞢'), ('zhà', '䢱')]
    zhai_1 = [('zhāi', '齐'), ('zhāi', '侧'), ('zhāi', '摘'), ('zhāi', '斋'), ('zhāi', '亝'), ('zhāi', '哜'), ('zhāi', '夈'),
              ('zhāi', '粂'), ('zhāi', '捚'), ('zhāi', '側'), ('zhāi', '斎'), ('zhāi', '榸'), ('zhāi', '齊'), ('zhāi', '嚌'),
              ('zhāi', '擿'), ('zhāi', '齋')]
    zhai_2 = [('zhái', '择'), ('zhái', '宅'), ('zhái', '翟'), ('zhái', '厇'), ('zhái', '擇'), ('zhái', '檡'), ('zhái', '㡯'),
              ('zhái', '㟙'), ('zhái', '㢎'), ('zhái', '䑲')]
    zhai_3 = [('zhǎi', '窄'), ('zhǎi', '厏'), ('zhǎi', '抧'), ('zhǎi', '鉙'), ('zhǎi', '䍉')]
    zhai_4 = [('zhài', '责'), ('zhài', '祭'), ('zhài', '债'), ('zhài', '寨'), ('zhài', '砦'), ('zhài', '責'), ('zhài', '債'),
              ('zhài', '瘵'), ('zhài', '䓱'), ('zhài', '㩟')]
    zhan_1 = [('zhān', '占'), ('zhān', '沾'), ('zhān', '粘'), ('zhān', '詹'), ('zhān', '瞻'), ('zhān', '毡'), ('zhān', '旃'),
              ('zhān', '谵'), ('zhān', '岾'), ('zhān', '怗'), ('zhān', '枬'), ('zhān', '栴'), ('zhān', '蛅'), ('zhān', '飦'),
              ('zhān', '惉'), ('zhān', '詀'), ('zhān', '趈'), ('zhān', '閚'), ('zhān', '鳽'), ('zhān', '噡'), ('zhān', '嶦'),
              ('zhān', '薝'), ('zhān', '邅'), ('zhān', '霑'), ('zhān', '氈'), ('zhān', '氊'), ('zhān', '鹯'), ('zhān', '旜'),
              ('zhān', '譫'), ('zhān', '饘'), ('zhān', '鳣'), ('zhān', '驙'), ('zhān', '魙'), ('zhān', '鱣'), ('zhān', '鸇'),
              ('zhān', '㣶'), ('zhān', '补')]
    zhan_2 = [('zhán', '讝')]
    zhan_3 = [('zhǎn', '展'), ('zhǎn', '斩'), ('zhǎn', '盏'), ('zhǎn', '崭'), ('zhǎn', '辗'), ('zhǎn', '飐'), ('zhǎn', '斬'),
              ('zhǎn', '琖'), ('zhǎn', '搌'), ('zhǎn', '盞'), ('zhǎn', '嶃'), ('zhǎn', '嶄'), ('zhǎn', '榐'), ('zhǎn', '颭'),
              ('zhǎn', '嫸'), ('zhǎn', '醆'), ('zhǎn', '橏'), ('zhǎn', '輾'), ('zhǎn', '皽'), ('zhǎn', '黵'), ('zhǎn', '㠭'),
              ('zhǎn', '㜊'), ('zhǎn', '䎒'), ('zhǎn', '䩅'), ('zhǎn', '䩆'), ('zhǎn', '䁪'), ('zhǎn', '䈴'), ('zhǎn', '䦅'),
              ('zhǎn', '䵣'), ('zhǎn', '䁴'), ('zhǎn', '㞡'), ('zhǎn', '䟋'), ('zhǎn', '䡀'), ('zhǎn', '䱼')]
    zhan_4 = [('zhàn', '战'), ('zhàn', '站'), ('zhàn', '颤'), ('zhàn', '栈'), ('zhàn', '绽'), ('zhàn', '湛'), ('zhàn', '蘸'),
              ('zhàn', '佔'), ('zhàn', '桟'), ('zhàn', '偡'), ('zhàn', '菚'), ('zhàn', '嵁'), ('zhàn', '棧'), ('zhàn', '戦'),
              ('zhàn', '碊'), ('zhàn', '僝'), ('zhàn', '綻'), ('zhàn', '嶘'), ('zhàn', '戰'), ('zhàn', '虥'), ('zhàn', '虦'),
              ('zhàn', '覱'), ('zhàn', '轏'), ('zhàn', '譧'), ('zhàn', '欃'), ('zhàn', '驏'), ('zhàn', '㟞'), ('zhàn', '䋎'),
              ('zhàn', '䐤'), ('zhàn', '䘺'), ('zhàn', '䗃'), ('zhàn', '㺘'), ('zhàn', '㙴'), ('zhàn', '㻵'), ('zhàn', '䗞'),
              ('zhàn', '䧯'), ('zhàn', '䱠'), ('zhàn', '䳻'), ('zhàn', '䪌')]
    zhang_1 = [('zhāng', '张'), ('zhāng', '章'), ('zhāng', '彰'), ('zhāng', '璋'), ('zhāng', '漳'), ('zhāng', '獐'),
               ('zhāng', '樟'), ('zhāng', '蟑'), ('zhāng', '弡'), ('zhāng', '張'), ('zhāng', '傽'), ('zhāng', '鄣'),
               ('zhāng', '嫜'), ('zhāng', '慞'), ('zhāng', '粻'), ('zhāng', '蔁'), ('zhāng', '遧'), ('zhāng', '暲'),
               ('zhāng', '餦'), ('zhāng', '鏱'), ('zhāng', '騿'), ('zhāng', '鱆'), ('zhāng', '麞')]
    zhang_2 = [('zhǎng', '长'), ('zhǎng', '掌'), ('zhǎng', '涨'), ('zhǎng', '仉'), ('zhǎng', '仧'), ('zhǎng', '兏'),
               ('zhǎng', '長'), ('zhǎng', '漲'), ('zhǎng', '幥'), ('zhǎng', '礃'), ('zhǎng', '鞝')]
    zhang_3 = [('zhàng', '丈'), ('zhàng', '帐'), ('zhàng', '障'), ('zhàng', '仗'), ('zhàng', '杖'), ('zhàng', '账'),
               ('zhàng', '胀'), ('zhàng', '瘴'), ('zhàng', '嶂'), ('zhàng', '幛'), ('zhàng', '扙'), ('zhàng', '粀'),
               ('zhàng', '帳'), ('zhàng', '涱'), ('zhàng', '脹'), ('zhàng', '痮'), ('zhàng', '墇'), ('zhàng', '賬'),
               ('zhàng', '瘬'), ('zhàng', '瞕'), ('zhàng', '㕩'), ('zhàng', '㽴'), ('zhàng', '㙊'), ('zhàng', '㙣'),
               ('zhàng', '㢓')]
    zhao_1 = [('zhāo', '朝'), ('zhāo', '招'), ('zhāo', '昭'), ('zhāo', '嘲'), ('zhāo', '钊'), ('zhāo', '啁'), ('zhāo', '佋'),
              ('zhāo', '妱'), ('zhāo', '巶'), ('zhāo', '釗'), ('zhāo', '釽'), ('zhāo', '鉊'), ('zhāo', '鳭'), ('zhāo', '駋'),
              ('zhāo', '鍣'), ('zhāo', '皽')]
    zhao_2 = [('zháo', '着')]
    zhao_3 = [('zhǎo', '找'), ('zhǎo', '爪'), ('zhǎo', '沼'), ('zhǎo', '爫'), ('zhǎo', '菬'), ('zhǎo', '瑵'), ('zhǎo', '㕚'),
              ('zhǎo', '㐍'), ('zhǎo', '䝖'), ('zhǎo', '㺐'), ('zhǎo', '䈃')]
    zhao_4 = [('zhào', '照'), ('zhào', '赵'), ('zhào', '召'), ('zhào', '罩'), ('zhào', '兆'), ('zhào', '诏'), ('zhào', '肇'),
              ('zhào', '棹'), ('zhào', '濯'), ('zhào', '枛'), ('zhào', '垗'), ('zhào', '炤'), ('zhào', '狣'), ('zhào', '笊'),
              ('zhào', '肁'), ('zhào', '啅'), ('zhào', '旐'), ('zhào', '罀'), ('zhào', '詔'), ('zhào', '箌'), ('zhào', '肈'),
              ('zhào', '趙'), ('zhào', '曌'), ('zhào', '燳'), ('zhào', '鮡'), ('zhào', '櫂'), ('zhào', '瞾'), ('zhào', '羄'),
              ('zhào', '㐒'), ('zhào', '䧂'), ('zhào', '㡽'), ('zhào', '㫤'), ('zhào', '㨄'), ('zhào', '㹿'), ('zhào', '䄻'),
              ('zhào', '䍮'), ('zhào', '㑿'), ('zhào', '㷖'), ('zhào', '䍜'), ('zhào', '䖺'), ('zhào', '䃍'), ('zhào', '䈇'),
              ('zhào', '䑲'), ('zhào', '䮓')]
    zhe_1 = [('zhē', '折'), ('zhē', '遮'), ('zhē', '螫'), ('zhē', '嗻'), ('zhē', '嫬')]
    zhe_2 = [('zhé', '哲'), ('zhé', '辄'), ('zhé', '辙'), ('zhé', '蛰'), ('zhé', '谪'), ('zhé', '摺'), ('zhé', '磔'),
             ('zhé', '乇'), ('zhé', '厇'), ('zhé', '扸'), ('zhé', '杔'), ('zhé', '歽'), ('zhé', '矺'), ('zhé', '砓'),
             ('zhé', '籷'), ('zhé', '虴'), ('zhé', '埑'), ('zhé', '粍'), ('zhé', '袩'), ('zhé', '啠'), ('zhé', '悊'),
             ('zhé', '晢'), ('zhé', '晣'), ('zhé', '喆'), ('zhé', '棏'), ('zhé', '聑'), ('zhé', '詟'), ('zhé', '搩'),
             ('zhé', '蜇'), ('zhé', '馲'), ('zhé', '輒'), ('zhé', '慹'), ('zhé', '輙'), ('zhé', '銸'), ('zhé', '蟄'),
             ('zhé', '嚞'), ('zhé', '謫'), ('zhé', '謺'), ('zhé', '鮿'), ('zhé', '轍'), ('zhé', '讁'), ('zhé', '讋'),
             ('zhé', '㞏'), ('zhé', '㡳'), ('zhé', '䎲'), ('zhé', '㞼'), ('zhé', '㡇'), ('zhé', '䂝'), ('zhé', '㪿'),
             ('zhé', '㭙'), ('zhé', '䓆'), ('zhé', '䙷'), ('zhé', '㭯'), ('zhé', '䆛'), ('zhé', '㢎'), ('zhé', '㫼'),
             ('zhé', '䀅'), ('zhé', '䐑'), ('zhé', '㦻'), ('zhé', '㵊'), ('zhé', '䐲'), ('zhé', '䧪'), ('zhé', '㯰'),
             ('zhé', '䊞'), ('zhé', '䜆'), ('zhé', '䊮'), ('zhé', '䝃'), ('zhé', '䮰'), ('zhé', '䝕')]
    zhe_3 = [('zhě', '者'), ('zhě', '褶'), ('zhě', '赭'), ('zhě', '乽'), ('zhě', '啫'), ('zhě', '锗'), ('zhě', '踷'),
             ('zhě', '鍺'), ('zhě', '襵')]
    zhe_4 = [('zhè', '这'), ('zhè', '浙'), ('zhè', '蔗'), ('zhè', '鹧'), ('zhè', '柘'), ('zhè', '這'), ('zhè', '淛'),
             ('zhè', '樜'), ('zhè', '蟅'), ('zhè', '鷓'), ('zhè', '䂞'), ('zhè', '䏳'), ('zhè', '䋲'), ('zhè', '䗪'),
             ('zhè', '䠦'), ('zhè', '䩾'), ('zhè', '䵭')]
    zhe_5 = [('zhe', '着'), ('zhe', '著')]
    zhei_1 = [('zhèi', '这')]
    zhen_1 = [('zhēn', '真'), ('zhēn', '针'), ('zhēn', '珍'), ('zhēn', '贞'), ('zhēn', '帧'), ('zhēn', '侦'), ('zhēn', '斟'),
              ('zhēn', '桢'), ('zhēn', '甄'), ('zhēn', '臻'), ('zhēn', '祯'), ('zhēn', '榛'), ('zhēn', '箴'), ('zhēn', '砧'),
              ('zhēn', '蓁'), ('zhēn', '枮'), ('zhēn', '浈'), ('zhēn', '珎'), ('zhēn', '胗'), ('zhēn', '貞'), ('zhēn', '帪'),
              ('zhēn', '眞'), ('zhēn', '針'), ('zhēn', '偵'), ('zhēn', '酙'), ('zhēn', '寊'), ('zhēn', '幀'), ('zhēn', '湞'),
              ('zhēn', '葴'), ('zhēn', '遉'), ('zhēn', '嫃'), ('zhēn', '搸'), ('zhēn', '椹'), ('zhēn', '楨'), ('zhēn', '溱'),
              ('zhēn', '獉'), ('zhēn', '禎'), ('zhēn', '蒖'), ('zhēn', '鉁'), ('zhēn', '殝'), ('zhēn', '瑧'), ('zhēn', '碪'),
              ('zhēn', '禛'), ('zhēn', '潧'), ('zhēn', '樼'), ('zhēn', '澵'), ('zhēn', '薽'), ('zhēn', '錱'), ('zhēn', '轃'),
              ('zhēn', '鍼'), ('zhēn', '籈'), ('zhēn', '鱵')]
    zhen_2 = []
    zhen_3 = [('zhěn', '枕'), ('zhěn', '诊'), ('zhěn', '轸'), ('zhěn', '疹'), ('zhěn', '缜'), ('zhěn', '稹'), ('zhěn', '抮'),
              ('zhěn', '姫'), ('zhěn', '弫'), ('zhěn', '昣'), ('zhěn', '屒'), ('zhěn', '畛'), ('zhěn', '眕'), ('zhěn', '袗'),
              ('zhěn', '紾'), ('zhěn', '聄'), ('zhěn', '萙'), ('zhěn', '竧'), ('zhěn', '裖'), ('zhěn', '覙'), ('zhěn', '診'),
              ('zhěn', '軫'), ('zhěn', '槙'), ('zhěn', '駗'), ('zhěn', '縝'), ('zhěn', '縥'), ('zhěn', '辴'), ('zhěn', '鬒'),
              ('zhěn', '黰'), ('zhěn', '㐱'), ('zhěn', '㱽'), ('zhěn', '䂦'), ('zhěn', '䂧'), ('zhěn', '䑐'), ('zhěn', '䀼'),
              ('zhěn', '䠴'), ('zhěn', '㪛'), ('zhěn', '䪴'), ('zhěn', '䪾'), ('zhěn', '䡩'), ('zhěn', '䴾'), ('zhěn', '䫬')]
    zhen_4 = [('zhèn', '阵'), ('zhèn', '镇'), ('zhèn', '震'), ('zhèn', '振'), ('zhèn', '填'), ('zhèn', '朕'), ('zhèn', '圳'),
              ('zhèn', '赈'), ('zhèn', '鸩'), ('zhèn', '纼'), ('zhèn', '甽'), ('zhèn', '侲'), ('zhèn', '挋'), ('zhèn', '陣'),
              ('zhèn', '栚'), ('zhèn', '紖'), ('zhèn', '桭'), ('zhèn', '眹'), ('zhèn', '塦'), ('zhèn', '揕'), ('zhèn', '絼'),
              ('zhèn', '榐'), ('zhèn', '瑱'), ('zhèn', '誫'), ('zhèn', '賑'), ('zhèn', '鋴'), ('zhèn', '鴆'), ('zhèn', '鎭'),
              ('zhèn', '鎮'), ('zhèn', '䏖'), ('zhèn', '㼉'), ('zhèn', '䀕'), ('zhèn', '䊶'), ('zhèn', '䚯'), ('zhèn', '㛛'),
              ('zhèn', '䡅'), ('zhèn', '㨋'), ('zhèn', '㭫'), ('zhèn', '䝩'), ('zhèn', '䧵'), ('zhèn', '㣀'), ('zhèn', '㴨'),
              ('zhèn', '㮳'), ('zhèn', '䟴'), ('zhèn', '㓄'), ('zhèn', '䲴'), ('zhèn', '㯢'), ('zhèn', '䨯'), ('zhèn', '䳲')]
    zheng_1 = [('zhēng', '争'), ('zhēng', '征'), ('zhēng', '睁'), ('zhēng', '丁'), ('zhēng', '怔'), ('zhēng', '蒸'),
               ('zhēng', '筝'), ('zhēng', '铮'), ('zhēng', '狰'), ('zhēng', '徵'), ('zhēng', '峥'), ('zhēng', '钲'),
               ('zhēng', '凧'), ('zhēng', '佂'), ('zhēng', '姃'), ('zhēng', '爭'), ('zhēng', '糽'), ('zhēng', '埩'),
               ('zhēng', '炡'), ('zhēng', '烝'), ('zhēng', '眐'), ('zhēng', '脀'), ('zhēng', '埥'), ('zhēng', '崝'),
               ('zhēng', '崢'), ('zhēng', '掙'), ('zhēng', '猙'), ('zhēng', '聇'), ('zhēng', '媜'), ('zhēng', '揁'),
               ('zhēng', '徰'), ('zhēng', '睜'), ('zhēng', '踭'), ('zhēng', '鉦'), ('zhēng', '徴'), ('zhēng', '箏'),
               ('zhēng', '綪'), ('zhēng', '錚'), ('zhēng', '篜'), ('zhēng', '鬇'), ('zhēng', '癥'), ('zhēng', '鏳'),
               ('zhēng', '䋊'), ('zhēng', '䋫')]
    zheng_2 = [('zhěng', '整'), ('zhěng', '拯'), ('zhěng', '氶'), ('zhěng', '抍'), ('zhěng', '掟'), ('zhěng', '晸'),
               ('zhěng', '愸'), ('zhěng', '撜'), ('zhěng', '㐼'), ('zhěng', '䡕')]
    zheng_3 = [('zhèng', '正'), ('zhèng', '政'), ('zhèng', '证'), ('zhèng', '郑'), ('zhèng', '挣'), ('zhèng', '症'),
               ('zhèng', '诤'), ('zhèng', '徎'), ('zhèng', '幁'), ('zhèng', '証'), ('zhèng', '塣'), ('zhèng', '諍'),
               ('zhèng', '靕'), ('zhèng', '鄭'), ('zhèng', '憕'), ('zhèng', '鴊'), ('zhèng', '證'), ('zhèng', '㱏'),
               ('zhèng', '䦶'), ('zhèng', '䂻'), ('zhèng', '䦛'), ('zhèng', '㡠'), ('zhèng', '䈣'), ('zhèng', '䛫'),
               ('zhèng', '䫆'), ('zhèng', '㽀'), ('zhèng', '䥌'), ('zhèng', '㡧'), ('zhèng', '䥭')]
    zhi_1 = [('zhī', '之'), ('zhī', '只'), ('zhī', '知'), ('zhī', '支'), ('zhī', '氏'), ('zhī', '织'), ('zhī', '枝'),
             ('zhī', '芝'), ('zhī', '脂'), ('zhī', '肢'), ('zhī', '汁'), ('zhī', '吱'), ('zhī', '蜘'), ('zhī', '祗'),
             ('zhī', '卮'), ('zhī', '栀'), ('zhī', '巵'), ('zhī', '汥'), ('zhī', '呮'), ('zhī', '泜'), ('zhī', '秓'),
             ('zhī', '胑'), ('zhī', '胝'), ('zhī', '衼'), ('zhī', '倁'), ('zhī', '栺'), ('zhī', '疷'), ('zhī', '祬'),
             ('zhī', '隻'), ('zhī', '梔'), ('zhī', '菭'), ('zhī', '椥'), ('zhī', '臸'), ('zhī', '搘'), ('zhī', '稙'),
             ('zhī', '綕'), ('zhī', '榰'), ('zhī', '馶'), ('zhī', '憄'), ('zhī', '鳷'), ('zhī', '鴲'), ('zhī', '織'),
             ('zhī', '鼅'), ('zhī', '蘵'), ('zhī', '㩼'), ('zhī', '䓜'), ('zhī', '䓡'), ('zhī', '䧴'), ('zhī', '䵹')]
    zhi_2 = [('zhí', '直'), ('zhí', '值'), ('zhí', '执'), ('zhí', '职'), ('zhí', '植'), ('zhí', '拓'), ('zhí', '侄'),
             ('zhí', '殖'), ('zhí', '摭'), ('zhí', '郦'), ('zhí', '埴'), ('zhí', '絷'), ('zhí', '跖'), ('zhí', '踯'),
             ('zhí', '妷'), ('zhí', '秇'), ('zhí', '姪'), ('zhí', '値'), ('zhí', '聀'), ('zhí', '釞'), ('zhí', '執'),
             ('zhí', '淔'), ('zhí', '戠'), ('zhí', '犆'), ('zhí', '禃'), ('zhí', '臷'), ('zhí', '瓡'), ('zhí', '摕'),
             ('zhí', '馽'), ('zhí', '嬂'), ('zhí', '慹'), ('zhí', '漐'), ('zhí', '潪'), ('zhí', '樴'), ('zhí', '膱'),
             ('zhí', '縶'), ('zhí', '職'), ('zhí', '蟙'), ('zhí', '蹠'), ('zhí', '軄'), ('zhí', '躑'), ('zhí', '㨁'),
             ('zhí', '㥁'), ('zhí', '䐈'), ('zhí', '㜼'), ('zhí', '㙷'), ('zhí', '㯰'), ('zhí', '䟈'), ('zhí', '䵂')]
    zhi_3 = [('zhǐ', '指'), ('zhǐ', '止'), ('zhǐ', '纸'), ('zhǐ', '址'), ('zhǐ', '旨'), ('zhǐ', '芷'), ('zhǐ', '趾'),
             ('zhǐ', '咫'), ('zhǐ', '徵'), ('zhǐ', '夂'), ('zhǐ', '凪'), ('zhǐ', '劧'), ('zhǐ', '阯'), ('zhǐ', '坁'),
             ('zhǐ', '帋'), ('zhǐ', '扺'), ('zhǐ', '汦'), ('zhǐ', '沚'), ('zhǐ', '坧'), ('zhǐ', '抧'), ('zhǐ', '杫'),
             ('zhǐ', '祇'), ('zhǐ', '祉'), ('zhǐ', '茋'), ('zhǐ', '恉'), ('zhǐ', '枳'), ('zhǐ', '洔'), ('zhǐ', '砋'),
             ('zhǐ', '秖'), ('zhǐ', '衹'), ('zhǐ', '轵'), ('zhǐ', '淽'), ('zhǐ', '疻'), ('zhǐ', '紙'), ('zhǐ', '蚔'),
             ('zhǐ', '訨'), ('zhǐ', '軹'), ('zhǐ', '黹'), ('zhǐ', '禔'), ('zhǐ', '絺'), ('zhǐ', '酯'), ('zhǐ', '墌'),
             ('zhǐ', '徴'), ('zhǐ', '槯'), ('zhǐ', '藢'), ('zhǐ', '襧'), ('zhǐ', '㫑'), ('zhǐ', '㡳'), ('zhǐ', '㫖'),
             ('zhǐ', '㡶'), ('zhǐ', '㧗'), ('zhǐ', '䂡'), ('zhǐ', '䇛'), ('zhǐ', '㧻'), ('zhǐ', '㲛'), ('zhǐ', '䤠'),
             ('zhǐ', '䛗'), ('zhǐ', '㮹'), ('zhǐ', '䅩'), ('zhǐ', '䎺'), ('zhǐ', '䳅'), ('zhǐ', '䌤')]
    zhi_4 = [('zhì', '制'), ('zhì', '至'), ('zhì', '识'), ('zhì', '治'), ('zhì', '志'), ('zhì', '致'), ('zhì', '质'),
             ('zhì', '置'), ('zhì', '智'), ('zhì', '掷'), ('zhì', '秩'), ('zhì', '滞'), ('zhì', '稚'), ('zhì', '挚'),
             ('zhì', '帜'), ('zhì', '炙'), ('zhì', '窒'), ('zhì', '峙'), ('zhì', '雉'), ('zhì', '栉'), ('zhì', '陟'),
             ('zhì', '桎'), ('zhì', '贽'), ('zhì', '鸷'), ('zhì', '痣'), ('zhì', '觯'), ('zhì', '豸'), ('zhì', '帙'),
             ('zhì', '郅'), ('zhì', '轾'), ('zhì', '畤'), ('zhì', '痔'), ('zhì', '彘'), ('zhì', '骘'), ('zhì', '芖'),
             ('zhì', '忮'), ('zhì', '扻'), ('zhì', '厔'), ('zhì', '垁'), ('zhì', '斦'), ('zhì', '迣'), ('zhì', '俧'),
             ('zhì', '庢'), ('zhì', '庤'), ('zhì', '挃'), ('zhì', '柣'), ('zhì', '洷'), ('zhì', '祑'), ('zhì', '娡'),
             ('zhì', '徏'), ('zhì', '捗'), ('zhì', '晊'), ('zhì', '歭'), ('zhì', '狾'), ('zhì', '袟'), ('zhì', '乿'),
             ('zhì', '偫'), ('zhì', '剬'), ('zhì', '徝'), ('zhì', '梽'), ('zhì', '楖'), ('zhì', '猘'), ('zhì', '痓'),
             ('zhì', '眰'), ('zhì', '秲'), ('zhì', '秷'), ('zhì', '紩'), ('zhì', '翐'), ('zhì', '袠'), ('zhì', '觗'),
             ('zhì', '貭'), ('zhì', '铚'), ('zhì', '傂'), ('zhì', '崻'), ('zhì', '蛭'), ('zhì', '寘'), ('zhì', '廌'),
             ('zhì', '搱'), ('zhì', '滍'), ('zhì', '筫'), ('zhì', '跱'), ('zhì', '輊'), ('zhì', '锧'), ('zhì', '墆'),
             ('zhì', '滯'), ('zhì', '潌'), ('zhì', '疐'), ('zhì', '瘈'), ('zhì', '聜'), ('zhì', '製'), ('zhì', '覟'),
             ('zhì', '誌'), ('zhì', '銍'), ('zhì', '幟'), ('zhì', '摨'), ('zhì', '摯'), ('zhì', '熫'), ('zhì', '稺'),
             ('zhì', '膣'), ('zhì', '質'), ('zhì', '踬'), ('zhì', '銴'), ('zhì', '鋕'), ('zhì', '擳'), ('zhì', '旘'),
             ('zhì', '瀄'), ('zhì', '璏'), ('zhì', '緻'), ('zhì', '隲'), ('zhì', '駤'), ('zhì', '鴙'), ('zhì', '儨'),
             ('zhì', '劕'), ('zhì', '懥'), ('zhì', '擲'), ('zhì', '擿'), ('zhì', '櫛'), ('zhì', '穉'), ('zhì', '螲'),
             ('zhì', '懫'), ('zhì', '贄'), ('zhì', '櫍'), ('zhì', '瓆'), ('zhì', '觶'), ('zhì', '騭'), ('zhì', '鯯'),
             ('zhì', '礩'), ('zhì', '豑'), ('zhì', '鶨'), ('zhì', '騺'), ('zhì', '驇'), ('zhì', '躓'), ('zhì', '鷙'),
             ('zhì', '鑕'), ('zhì', '豒'), ('zhì', '㕄'), ('zhì', '㝂'), ('zhì', '䏑'), ('zhì', '䓌'), ('zhì', '㣥'),
             ('zhì', '䄺'), ('zhì', '䏯'), ('zhì', '䘭'), ('zhì', '䚳'), ('zhì', '㗌'), ('zhì', '㛿'), ('zhì', '㫼'),
             ('zhì', '䀸'), ('zhì', '䑭'), ('zhì', '䧝'), ('zhì', '㨖'), ('zhì', '㴛'), ('zhì', '䇽'), ('zhì', '䝰'),
             ('zhì', '㗧'), ('zhì', '䦛'), ('zhì', '䪒'), ('zhì', '䬹'), ('zhì', '䰴'), ('zhì', '䐭'), ('zhì', '䝷'),
             ('zhì', '㘉'), ('zhì', '㿃'), ('zhì', '䕌'), ('zhì', '䚇'), ('zhì', '䩢'), ('zhì', '䭁'), ('zhì', '䱃'),
             ('zhì', '䉅'), ('zhì', '䏄'), ('zhì', '䚦'), ('zhì', '䞃'), ('zhì', '㜱'), ('zhì', '㬪'), ('zhì', '䞇'),
             ('zhì', '䦯'), ('zhì', '䫕'), ('zhì', '䉜'), ('zhì', '䑇'), ('zhì', '䠦'), ('zhì', '䥍'), ('zhì', '䱥'),
             ('zhì', '䱨'), ('zhì', '䆈'), ('zhì', '䜠'), ('zhì', '䡹'), ('zhì', '䲀'), ('zhì', '䶡')]
    zhong_1 = [('zhōng', '中'), ('zhōng', '终'), ('zhōng', '钟'), ('zhōng', '忠'), ('zhōng', '衷'), ('zhōng', '锺'),
               ('zhōng', '盅'), ('zhōng', '蚣'), ('zhōng', '忪'), ('zhōng', '夂'), ('zhōng', '伀'), ('zhōng', '汷'),
               ('zhōng', '刣'), ('zhōng', '妐'), ('zhōng', '彸'), ('zhōng', '泈'), ('zhōng', '炂'), ('zhōng', '柊'),
               ('zhōng', '衳'), ('zhōng', '舯'), ('zhōng', '終'), ('zhōng', '鈡'), ('zhōng', '幒'), ('zhōng', '蔠'),
               ('zhōng', '蜙'), ('zhōng', '銿'), ('zhōng', '螤'), ('zhōng', '鴤'), ('zhōng', '螽'), ('zhōng', '鍾'),
               ('zhōng', '斔'), ('zhōng', '鼨'), ('zhōng', '蹱'), ('zhōng', '鐘'), ('zhōng', '籦'), ('zhōng', '㹣')]
    zhong_2 = [('zhǒng', '种'), ('zhǒng', '肿'), ('zhǒng', '冢'), ('zhǒng', '踵'), ('zhǒng', '喠'), ('zhǒng', '尰'),
               ('zhǒng', '塚'), ('zhǒng', '歱'), ('zhǒng', '煄'), ('zhǒng', '腫'), ('zhǒng', '瘇'), ('zhǒng', '種'),
               ('zhǒng', '徸'), ('zhǒng', '穜'), ('zhǒng', '㣫')]
    zhong_3 = [('zhòng', '重'), ('zhòng', '众'), ('zhòng', '仲'), ('zhòng', '妕'), ('zhòng', '狆'), ('zhòng', '祌'),
               ('zhòng', '茽'), ('zhòng', '衶'), ('zhòng', '蚛'), ('zhòng', '偅'), ('zhòng', '眾'), ('zhòng', '堹'),
               ('zhòng', '媑'), ('zhòng', '筗'), ('zhòng', '衆'), ('zhòng', '緟'), ('zhòng', '諥'), ('zhòng', '㐺'),
               ('zhòng', '㲴'), ('zhòng', '䳋'), ('zhòng', '䱰')]
    zhou_1 = [('zhōu', '调'), ('zhōu', '周'), ('zhōu', '州'), ('zhōu', '洲'), ('zhōu', '舟'), ('zhōu', '粥'), ('zhōu', '诌'),
              ('zhōu', '啁'), ('zhōu', '侜'), ('zhōu', '炿'), ('zhōu', '诪'), ('zhōu', '烐'), ('zhōu', '珘'), ('zhōu', '辀'),
              ('zhōu', '郮'), ('zhōu', '婤'), ('zhōu', '徟'), ('zhōu', '掫'), ('zhōu', '淍'), ('zhōu', '矪'), ('zhōu', '週'),
              ('zhōu', '鸼'), ('zhōu', '喌'), ('zhōu', '赒'), ('zhōu', '輈'), ('zhōu', '翢'), ('zhōu', '銂'), ('zhōu', '賙'),
              ('zhōu', '輖'), ('zhōu', '霌'), ('zhōu', '駲'), ('zhōu', '嚋'), ('zhōu', '盩'), ('zhōu', '謅'), ('zhōu', '鵃'),
              ('zhōu', '騆'), ('zhōu', '譸'), ('zhōu', '㗙')]
    zhou_2 = [('zhóu', '轴'), ('zhóu', '妯'), ('zhóu', '軸'), ('zhóu', '碡'), ('zhóu', '㛩')]
    zhou_3 = [('zhǒu', '肘'), ('zhǒu', '帚'), ('zhǒu', '疛'), ('zhǒu', '胕'), ('zhǒu', '菷'), ('zhǒu', '晭'), ('zhǒu', '睭'),
              ('zhǒu', '箒'), ('zhǒu', '鯞'), ('zhǒu', '䖞'), ('zhǒu', '㫶'), ('zhǒu', '㨶'), ('zhǒu', '䎻'), ('zhǒu', '䔭')]
    zhou_4 = [('zhòu', '皱'), ('zhòu', '骤'), ('zhòu', '咒'), ('zhòu', '昼'), ('zhòu', '宙'), ('zhòu', '纣'), ('zhòu', '胄'),
              ('zhòu', '绉'), ('zhòu', '繇'), ('zhòu', '伷'), ('zhòu', '籀'), ('zhòu', '呪'), ('zhòu', '冑'), ('zhòu', '咮'),
              ('zhòu', '紂'), ('zhòu', '荮'), ('zhòu', '酎'), ('zhòu', '晝'), ('zhòu', '粙'), ('zhòu', '椆'), ('zhòu', '葤'),
              ('zhòu', '詋'), ('zhòu', '甃'), ('zhòu', '僽'), ('zhòu', '皺'), ('zhòu', '駎'), ('zhòu', '噣'), ('zhòu', '縐'),
              ('zhòu', '薵'), ('zhòu', '籕'), ('zhòu', '籒'), ('zhòu', '驟'), ('zhòu', '㝌'), ('zhòu', '㑇'), ('zhòu', '㼙'),
              ('zhòu', '㤘'), ('zhòu', '㲴'), ('zhòu', '䇠'), ('zhòu', '䋓'), ('zhòu', '㑳'), ('zhòu', '㥁'), ('zhòu', '䐌'),
              ('zhòu', '䛆'), ('zhòu', '㥮'), ('zhòu', '䐍'), ('zhòu', '㾭'), ('zhòu', '䩜'), ('zhòu', '㹐'), ('zhòu', '䈙'),
              ('zhòu', '㔌'), ('zhòu', '䭥'), ('zhòu', '䶇')]
    zhu_1 = [('zhū', '朱'), ('zhū', '珠'), ('zhū', '诸'), ('zhū', '猪'), ('zhū', '株'), ('zhū', '诛'), ('zhū', '蛛'),
             ('zhū', '茱'), ('zhū', '侏'), ('zhū', '铢'), ('zhū', '邾'), ('zhū', '洙'), ('zhū', '硃'), ('zhū', '秼'),
             ('zhū', '袾'), ('zhū', '絑'), ('zhū', '誅'), ('zhū', '跦'), ('zhū', '槠'), ('zhū', '潴'), ('zhū', '蕏'),
             ('zhū', '蝫'), ('zhū', '銖'), ('zhū', '橥'), ('zhū', '諸'), ('zhū', '豬'), ('zhū', '駯'), ('zhū', '鮢'),
             ('zhū', '鴸'), ('zhū', '瀦'), ('zhū', '藸'), ('zhū', '鼄'), ('zhū', '櫧'), ('zhū', '櫫'), ('zhū', '鯺'),
             ('zhū', '蠩'), ('zhū', '䇬'), ('zhū', '㶆')]
    zhu_2 = [('zhú', '术'), ('zhú', '逐'), ('zhú', '竹'), ('zhú', '烛'), ('zhú', '竺'), ('zhú', '躅'), ('zhú', '朮'),
             ('zhú', '炢'), ('zhú', '笁'), ('zhú', '茿'), ('zhú', '窋'), ('zhú', '笜'), ('zhú', '舳'), ('zhú', '逫'),
             ('zhú', '瘃'), ('zhú', '蓫'), ('zhú', '敱'), ('zhú', '磩'), ('zhú', '篴'), ('zhú', '斀'), ('zhú', '燭'),
             ('zhú', '蠋'), ('zhú', '鱁'), ('zhú', '劚'), ('zhú', '孎'), ('zhú', '灟'), ('zhú', '斸'), ('zhú', '曯'),
             ('zhú', '欘'), ('zhú', '爥'), ('zhú', '蠾'), ('zhú', '钃'), ('zhú', '㔉'), ('zhú', '䠼'), ('zhú', '䟉'),
             ('zhú', '䮱'), ('zhú', '䕽'), ('zhú', '䥮'), ('zhú', '䌵'), ('zhú', '䠱')]
    zhu_3 = [('zhǔ', '主'), ('zhǔ', '属'), ('zhǔ', '嘱'), ('zhǔ', '煮'), ('zhǔ', '褚'), ('zhǔ', '瞩'), ('zhǔ', '拄'),
             ('zhǔ', '渚'), ('zhǔ', '麈'), ('zhǔ', '丶'), ('zhǔ', '劯'), ('zhǔ', '宔'), ('zhǔ', '罜'), ('zhǔ', '陼'),
             ('zhǔ', '帾'), ('zhǔ', '煑'), ('zhǔ', '詝'), ('zhǔ', '濐'), ('zhǔ', '燝'), ('zhǔ', '屬'), ('zhǔ', '囑'),
             ('zhǔ', '鸀'), ('zhǔ', '矚'), ('zhǔ', '䘢'), ('zhǔ', '㵭'), ('zhǔ', '䰞')]
    zhu_4 = [('zhù', '住'), ('zhù', '注'), ('zhù', '助'), ('zhù', '著'), ('zhù', '宁'), ('zhù', '祝'), ('zhù', '筑'),
             ('zhù', '驻'), ('zhù', '柱'), ('zhù', '铸'), ('zhù', '贮'), ('zhù', '伫'), ('zhù', '箸'), ('zhù', '蛀'),
             ('zhù', '苎'), ('zhù', '杼'), ('zhù', '炷'), ('zhù', '翥'), ('zhù', '佇'), ('zhù', '纻'), ('zhù', '芧'),
             ('zhù', '坾'), ('zhù', '拀'), ('zhù', '苧'), ('zhù', '迬'), ('zhù', '乼'), ('zhù', '壴'), ('zhù', '柷'),
             ('zhù', '殶'), ('zhù', '疰'), ('zhù', '眝'), ('zhù', '砫'), ('zhù', '祩'), ('zhù', '竚'), ('zhù', '莇'),
             ('zhù', '紵'), ('zhù', '紸'), ('zhù', '羜'), ('zhù', '尌'), ('zhù', '嵀'), ('zhù', '註'), ('zhù', '貯'),
             ('zhù', '跓'), ('zhù', '軴'), ('zhù', '筯'), ('zhù', '鉒'), ('zhù', '飳'), ('zhù', '馵'), ('zhù', '嗻'),
             ('zhù', '墸'), ('zhù', '樦'), ('zhù', '澍'), ('zhù', '鋳'), ('zhù', '駐'), ('zhù', '築'), ('zhù', '篫'),
             ('zhù', '麆'), ('zhù', '簗'), ('zhù', '櫡'), ('zhù', '鑄'), ('zhù', '㝉'), ('zhù', '㑏'), ('zhù', '㤖'),
             ('zhù', '㹥'), ('zhù', '㧣'), ('zhù', '㿾'), ('zhù', '䇠'), ('zhù', '䇡'), ('zhù', '䍆'), ('zhù', '䇧'),
             ('zhù', '䎝'), ('zhù', '䎷'), ('zhù', '䝬'), ('zhù', '㾻'), ('zhù', '䐢'), ('zhù', '䪒'), ('zhù', '㫂'),
             ('zhù', '㺛'), ('zhù', '䬡'), ('zhù', '䫖'), ('zhù', '䭖'), ('zhù', '䳠'), ('zhù', '䘄'), ('zhù', '䝒')]
    zhua_1 = [('zhuā', '抓'), ('zhuā', '挝'), ('zhuā', '撾'), ('zhuā', '檛'), ('zhuā', '膼'), ('zhuā', '簻'), ('zhuā', '髽')]
    zhua_2 = [('zhuǎ', '爪'), ('zhuǎ', '爫')]
    zhuai_1 = [('zhuǎi', '转'), ('zhuǎi', '跩')]
    zhuai_2 = [('zhuài', '拽'), ('zhuài', '睉')]
    zhuan_1 = [('zhuān', '专'), ('zhuān', '砖'), ('zhuān', '颛'), ('zhuān', '叀'), ('zhuān', '専'), ('zhuān', '恮'),
               ('zhuān', '耑'), ('zhuān', '專'), ('zhuān', '剸'), ('zhuān', '鄟'), ('zhuān', '塼'), ('zhuān', '嫥'),
               ('zhuān', '漙'), ('zhuān', '瑼'), ('zhuān', '甎'), ('zhuān', '磗'), ('zhuān', '膞'), ('zhuān', '磚'),
               ('zhuān', '諯'), ('zhuān', '篿'), ('zhuān', '蟤'), ('zhuān', '顓'), ('zhuān', '鱄')]
    zhuan_2 = [('zhuǎn', '转'), ('zhuǎn', '孨'), ('zhuǎn', '竱'), ('zhuǎn', '轉'), ('zhuǎn', '䏝'), ('zhuǎn', '䡱')]
    zhuan_3 = [('zhuàn', '传'), ('zhuàn', '赚'), ('zhuàn', '撰'), ('zhuàn', '篆'), ('zhuàn', '馔'), ('zhuàn', '啭'),
               ('zhuàn', '灷'), ('zhuàn', '転'), ('zhuàn', '堟'), ('zhuàn', '蒃'), ('zhuàn', '傳'), ('zhuàn', '瑑'),
               ('zhuàn', '腞'), ('zhuàn', '僎'), ('zhuàn', '僝'), ('zhuàn', '篹'), ('zhuàn', '縳'), ('zhuàn', '襈'),
               ('zhuàn', '賺'), ('zhuàn', '簨'), ('zhuàn', '贃'), ('zhuàn', '譔'), ('zhuàn', '饌'), ('zhuàn', '囀'),
               ('zhuàn', '籑'), ('zhuàn', '䧘'), ('zhuàn', '䚈'), ('zhuàn', '䤄'), ('zhuàn', '䉵')]
    zhuang_1 = [('zhuāng', '装'), ('zhuāng', '庄'), ('zhuāng', '妆'), ('zhuāng', '桩'), ('zhuāng', '妝'), ('zhuāng', '庒'),
                ('zhuāng', '荘'), ('zhuāng', '娤'), ('zhuāng', '莊'), ('zhuāng', '梉'), ('zhuāng', '湷'), ('zhuāng', '粧'),
                ('zhuāng', '裝'), ('zhuāng', '樁'), ('zhuāng', '糚')]
    zhuang_2 = [('zhuǎng', '奘')]
    zhuang_3 = [('zhuàng', '状'), ('zhuàng', '壮'), ('zhuàng', '撞'), ('zhuàng', '幢'), ('zhuàng', '僮'), ('zhuàng', '戆'),
                ('zhuàng', '壯'), ('zhuàng', '狀'), ('zhuàng', '壵'), ('zhuàng', '焋'), ('zhuàng', '漴'), ('zhuàng', '戅'),
                ('zhuàng', '戇'), ('zhuàng', '䚒')]
    zhui_1 = [('zhuī', '追'), ('zhuī', '揣'), ('zhuī', '锥'), ('zhuī', '椎'), ('zhuī', '骓'), ('zhuī', '隹'), ('zhuī', '錐'),
              ('zhuī', '騅'), ('zhuī', '鵻')]
    zhui_2 = [('zhuǐ', '沝'), ('zhuǐ', '㝽')]
    zhui_3 = [('zhuì', '坠'), ('zhuì', '缀'), ('zhuì', '赘'), ('zhuì', '惴'), ('zhuì', '缒'), ('zhuì', '笍'), ('zhuì', '奞'),
              ('zhuì', '娷'), ('zhuì', '隊'), ('zhuì', '甀'), ('zhuì', '腏'), ('zhuì', '畷'), ('zhuì', '硾'), ('zhuì', '膇'),
              ('zhuì', '墜'), ('zhuì', '綴'), ('zhuì', '縋'), ('zhuì', '諈'), ('zhuì', '醊'), ('zhuì', '錣'), ('zhuì', '礈'),
              ('zhuì', '贅'), ('zhuì', '鑆'), ('zhuì', '䄌'), ('zhuì', '䋘'), ('zhuì', '㿢'), ('zhuì', '㾽'), ('zhuì', '䃍')]
    zhun_1 = [('zhūn', '淳'), ('zhūn', '屯'), ('zhūn', '谆'), ('zhūn', '圫'), ('zhūn', '宒'), ('zhūn', '忳'), ('zhūn', '迍'),
              ('zhūn', '肫'), ('zhūn', '窀'), ('zhūn', '啍'), ('zhūn', '諄'), ('zhūn', '衠'), ('zhūn', '㡒')]
    zhun_2 = [('zhǔn', '准'), ('zhǔn', '埻'), ('zhǔn', '凖'), ('zhǔn', '準'), ('zhǔn', '綧')]
    zhun_3 = [('zhùn', '旽'), ('zhùn', '訰'), ('zhùn', '稕')]
    zhuo_1 = [('zhuō', '桌'), ('zhuō', '捉'), ('zhuō', '拙'), ('zhuō', '棹'), ('zhuō', '涿'), ('zhuō', '淖'), ('zhuō', '焯'),
              ('zhuō', '炪'), ('zhuō', '倬'), ('zhuō', '梲'), ('zhuō', '棁'), ('zhuō', '棳'), ('zhuō', '窧'), ('zhuō', '槕'),
              ('zhuō', '穛'), ('zhuō', '鐯'), ('zhuō', '穱'), ('zhuō', '䖦'), ('zhuō', '䪼')]
    zhuo_2 = [('zhuó', '着'), ('zhuó', '著'), ('zhuó', '卓'), ('zhuó', '灼'), ('zhuó', '缴'), ('zhuó', '酌'), ('zhuó', '浊'),
              ('zhuó', '琢'), ('zhuó', '镯'), ('zhuó', '啄'), ('zhuó', '斫'), ('zhuó', '濯'), ('zhuó', '茁'), ('zhuó', '擢'),
              ('zhuó', '圴'), ('zhuó', '彴'), ('zhuó', '汋'), ('zhuó', '犳'), ('zhuó', '叕'), ('zhuó', '妰'), ('zhuó', '丵'),
              ('zhuó', '剢'), ('zhuó', '捔'), ('zhuó', '浞'), ('zhuó', '烵'), ('zhuó', '诼'), ('zhuó', '啅'), ('zhuó', '娺'),
              ('zhuó', '聉'), ('zhuó', '斮'), ('zhuó', '斱'), ('zhuó', '晫'), ('zhuó', '椓'), ('zhuó', '琸'), ('zhuó', '硺'),
              ('zhuó', '窡'), ('zhuó', '罬'), ('zhuó', '蓔'), ('zhuó', '墌'), ('zhuó', '撯'), ('zhuó', '擆'), ('zhuó', '斲'),
              ('zhuó', '禚'), ('zhuó', '劅'), ('zhuó', '諁'), ('zhuó', '諑'), ('zhuó', '趠'), ('zhuó', '鋜'), ('zhuó', '噣'),
              ('zhuó', '濁'), ('zhuó', '燋'), ('zhuó', '篧'), ('zhuó', '斀'), ('zhuó', '斵'), ('zhuó', '藋'), ('zhuó', '櫡'),
              ('zhuó', '謶'), ('zhuó', '繳'), ('zhuó', '鵫'), ('zhuó', '灂'), ('zhuó', '蠗'), ('zhuó', '鐲'), ('zhuó', '籗'),
              ('zhuó', '鷟'), ('zhuó', '蠿'), ('zhuó', '籱'), ('zhuó', '㣿'), ('zhuó', '㲋'), ('zhuó', '㧻'), ('zhuó', '㭬'),
              ('zhuó', '㹿'), ('zhuó', '䐁'), ('zhuó', '㓸'), ('zhuó', '㒂'), ('zhuó', '䅵'), ('zhuó', '䔲'), ('zhuó', '䟾'),
              ('zhuó', '䆯'), ('zhuó', '䶂'), ('zhuó', '㠚'), ('zhuó', '㺟'), ('zhuó', '䴵'), ('zhuó', '㪬'), ('zhuó', '䕴'),
              ('zhuó', '䙯'), ('zhuó', '䵵'), ('zhuó', '补')]
    zhuo_3 = [('zhuò', '䏐'), ('zhuò', '㧳')]
    zi_1 = [('zī', '资'), ('zī', '齐'), ('zī', '仔'), ('zī', '姿'), ('zī', '滋'), ('zī', '兹'), ('zī', '咨'), ('zī', '吱'),
            ('zī', '孜'), ('zī', '淄'), ('zī', '缁'), ('zī', '髭'), ('zī', '赀'), ('zī', '菑'), ('zī', '孳'), ('zī', '辎'),
            ('zī', '訾'), ('zī', '龇'), ('zī', '孖'), ('zī', '甾'), ('zī', '茊'), ('zī', '呲'), ('zī', '姕'), ('zī', '茲'),
            ('zī', '栥'), ('zī', '玆'), ('zī', '畠'), ('zī', '紎'), ('zī', '崰'), ('zī', '秶'), ('zī', '谘'), ('zī', '赼'),
            ('zī', '嗞'), ('zī', '嵫'), ('zī', '椔'), ('zī', '湽'), ('zī', '粢'), ('zī', '葘'), ('zī', '鄑'), ('zī', '孶'),
            ('zī', '禌'), ('zī', '觜'), ('zī', '貲'), ('zī', '資'), ('zī', '趑'), ('zī', '锱'), ('zī', '稵'), ('zī', '緇'),
            ('zī', '緕'), ('zī', '鈭'), ('zī', '镃'), ('zī', '輜'), ('zī', '鼒'), ('zī', '澬'), ('zī', '薋'), ('zī', '諮'),
            ('zī', '趦'), ('zī', '輺'), ('zī', '錙'), ('zī', '鲻'), ('zī', '鍿'), ('zī', '鎡'), ('zī', '璾'), ('zī', '頾'),
            ('zī', '頿'), ('zī', '鯔'), ('zī', '鶅'), ('zī', '齍'), ('zī', '纃'), ('zī', '鰦'), ('zī', '齜'), ('zī', '䆅')]
    zi_2 = [('zí', '蓻'), ('zí', '㑵')]
    zi_3 = [('zǐ', '子'), ('zǐ', '紫'), ('zǐ', '姊'), ('zǐ', '梓'), ('zǐ', '籽'), ('zǐ', '滓'), ('zǐ', '吇'), ('zǐ', '姉'),
            ('zǐ', '杍'), ('zǐ', '沝'), ('zǐ', '矷'), ('zǐ', '秄'), ('zǐ', '胏'), ('zǐ', '呰'), ('zǐ', '秭'), ('zǐ', '耔'),
            ('zǐ', '茈'), ('zǐ', '虸'), ('zǐ', '笫'), ('zǐ', '釨'), ('zǐ', '啙'), ('zǐ', '訿'), ('zǐ', '榟'), ('zǐ', '橴'),
            ('zǐ', '䦻'), ('zǐ', '㜽'), ('zǐ', '㞨'), ('zǐ', '㺭'), ('zǐ', '㧗'), ('zǐ', '㾅'), ('zǐ', '䘣'), ('zǐ', '䔂'),
            ('zǐ', '䴾')]
    zi_4 = [('zì', '自'), ('zì', '字'), ('zì', '恣'), ('zì', '渍'), ('zì', '眦'), ('zì', '芓'), ('zì', '洓'), ('zì', '茡'),
            ('zì', '荢'), ('zì', '倳'), ('zì', '剚'), ('zì', '牸'), ('zì', '眥'), ('zì', '胔'), ('zì', '胾'), ('zì', '漬'),
            ('zì', '㢀'), ('zì', '㧘'), ('zì', '㰣'), ('zì', '㰷'), ('zì', '䅆'), ('zì', '䐉'), ('zì', '㱴')]
    zi_5 = [('zi', '嗭')]
    zong_1 = [('zōng', '宗'), ('zōng', '踪'), ('zōng', '综'), ('zōng', '棕'), ('zōng', '鬃'), ('zōng', '枞'), ('zōng', '倧'),
              ('zōng', '骔'), ('zōng', '堫'), ('zōng', '嵏'), ('zōng', '嵕'), ('zōng', '惾'), ('zōng', '猣'), ('zōng', '腙'),
              ('zōng', '葼'), ('zōng', '朡'), ('zōng', '椶'), ('zōng', '潈'), ('zōng', '稯'), ('zōng', '綜'), ('zōng', '緃'),
              ('zōng', '樅'), ('zōng', '熧'), ('zōng', '緵'), ('zōng', '翪'), ('zōng', '蝬'), ('zōng', '踨'), ('zōng', '磫'),
              ('zōng', '繌'), ('zōng', '鍐'), ('zōng', '豵'), ('zōng', '蹤'), ('zōng', '騌'), ('zōng', '騣'), ('zōng', '鬉'),
              ('zōng', '鬷'), ('zōng', '鯮'), ('zōng', '鯼'), ('zōng', '鑁'), ('zōng', '㚇'), ('zōng', '㯶'), ('zōng', '䗥')]
    zong_2 = [('zǒng', '总'), ('zǒng', '倊'), ('zǒng', '偬'), ('zǒng', '捴'), ('zǒng', '惣'), ('zǒng', '揔'), ('zǒng', '搃'),
              ('zǒng', '焧'), ('zǒng', '傯'), ('zǒng', '蓗'), ('zǒng', '嵸'), ('zǒng', '摠'), ('zǒng', '潀'), ('zǒng', '総'),
              ('zǒng', '熜'), ('zǒng', '緫'), ('zǒng', '縂'), ('zǒng', '燪'), ('zǒng', '總'), ('zǒng', '㷓'), ('zǒng', '㹅'),
              ('zǒng', '㢔'), ('zǒng', '䁓'), ('zǒng', '䎫'), ('zǒng', '䙕'), ('zǒng', '䡯'), ('zǒng', '䰌')]
    zong_3 = [('zòng', '从'), ('zòng', '纵'), ('zòng', '粽'), ('zòng', '昮'), ('zòng', '疭'), ('zòng', '從'), ('zòng', '猔'),
              ('zòng', '碂'), ('zòng', '潨'), ('zòng', '糉'), ('zòng', '瘲'), ('zòng', '縦'), ('zòng', '縱'), ('zòng', '糭'),
              ('zòng', '䍟'), ('zòng', '䝋')]
    zou_1 = [('zōu', '邹'), ('zōu', '驺'), ('zōu', '陬'), ('zōu', '诹'), ('zōu', '郰'), ('zōu', '掫'), ('zōu', '菆'),
             ('zōu', '棷'), ('zōu', '棸'), ('zōu', '鄒'), ('zōu', '箃'), ('zōu', '緅'), ('zōu', '諏'), ('zōu', '鄹'),
             ('zōu', '鲰'), ('zōu', '鯫'), ('zōu', '黀'), ('zōu', '騶'), ('zōu', '齱'), ('zōu', '齺')]
    zou_2 = [('zǒu', '走'), ('zǒu', '赱'), ('zǒu', '搊'), ('zǒu', '鯐'), ('zǒu', '㞫'), ('zǒu', '补')]
    zou_3 = [('zòu', '奏'), ('zòu', '揍'), ('zòu', '媰'), ('zòu', '楱'), ('zòu', '㔿'), ('zòu', '㵵'), ('zòu', '䠫'),
             ('zòu', '䲀')]
    zu_1 = [('zū', '租'), ('zū', '菹'), ('zū', '怚'), ('zū', '葅'), ('zū', '蒩')]
    zu_2 = [('zú', '足'), ('zú', '族'), ('zú', '卒'), ('zú', '镞'), ('zú', '卆'), ('zú', '倅'), ('zú', '哫'), ('zú', '崒'),
            ('zú', '崪'), ('zú', '椊'), ('zú', '稡'), ('zú', '箤'), ('zú', '踤'), ('zú', '鎐'), ('zú', '鏃'), ('zú', '㞺'),
            ('zú', '䘚'), ('zú', '㲋'), ('zú', '㧻'), ('zú', '㰵'), ('zú', '㲞'), ('zú', '䬨'), ('zú', '㵀'), ('zú', '䅸'),
            ('zú', '䚝'), ('zú', '䙘'), ('zú', '䯿'), ('zú', '䱣')]
    zu_3 = [('zǔ', '组'), ('zǔ', '祖'), ('zǔ', '阻'), ('zǔ', '诅'), ('zǔ', '俎'), ('zǔ', '柤'), ('zǔ', '爼'), ('zǔ', '珇'),
            ('zǔ', '唨'), ('zǔ', '組'), ('zǔ', '詛'), ('zǔ', '靻'), ('zǔ', '鎺'), ('zǔ', '䔃'), ('zǔ', '䖕')]
    zu_4 = []
    zuan_1 = [('zuān', '钻'), ('zuān', '鉆'), ('zuān', '劗'), ('zuān', '躜'), ('zuān', '鑚'), ('zuān', '躦'), ('zuān', '鑽')]
    zuan_2 = [('zuǎn', '纂'), ('zuǎn', '繤'), ('zuǎn', '缵'), ('zuǎn', '纉'), ('zuǎn', '籫'), ('zuǎn', '纘'), ('zuǎn', '䡅'),
              ('zuǎn', '㷪'), ('zuǎn', '䌣'), ('zuǎn', '䂎')]
    zuan_3 = [('zuàn', '攥'), ('zuàn', '揝'), ('zuàn', '篹'), ('zuàn', '賺'), ('zuàn', '䤸')]
    zui_1 = [('zuī', '厜'), ('zuī', '朘'), ('zuī', '嗺'), ('zuī', '樶'), ('zuī', '蟕'), ('zuī', '纗'), ('zuī', '䘒')]
    zui_2 = []
    zui_3 = [('zuǐ', '嘴'), ('zuǐ', '咀'), ('zuǐ', '觜'), ('zuǐ', '嶊'), ('zuǐ', '噿'), ('zuǐ', '濢'), ('zuǐ', '璻'),
             ('zuǐ', '㭰'), ('zuǐ', '䮔')]
    zui_4 = [('zuì', '最'), ('zuì', '罪'), ('zuì', '醉'), ('zuì', '冣'), ('zuì', '栬'), ('zuì', '絊'), ('zuì', '酔'),
             ('zuì', '晬'), ('zuì', '祽'), ('zuì', '睟'), ('zuì', '稡'), ('zuì', '辠'), ('zuì', '槜'), ('zuì', '酻'),
             ('zuì', '蕞'), ('zuì', '嶵'), ('zuì', '檇'), ('zuì', '鋷'), ('zuì', '錊'), ('zuì', '檌'), ('zuì', '欈'),
             ('zuì', '㝡'), ('zuì', '䘹'), ('zuì', '㠑'), ('zuì', '㰎')]
    zun_1 = [('zūn', '尊'), ('zūn', '遵'), ('zūn', '樽'), ('zūn', '噂'), ('zūn', '墫'), ('zūn', '嶟'), ('zūn', '繜'),
             ('zūn', '罇'), ('zūn', '鶎'), ('zūn', '鐏'), ('zūn', '鳟'), ('zūn', '鱒'), ('zūn', '鷷')]
    zun_2 = [('zǔn', '僔'), ('zǔn', '撙'), ('zǔn', '譐'), ('zǔn', '䔿')]
    zun_3 = [('zùn', '拵'), ('zùn', '捘'), ('zùn', '栫'), ('zùn', '袸'), ('zùn', '銌'), ('zùn', '瀳')]
    zuo_1 = [('zuō', '嘬'), ('zuō', '穝')]
    zuo_2 = [('zuó', '昨'), ('zuó', '琢'), ('zuó', '捽'), ('zuó', '苲'), ('zuó', '柮'), ('zuó', '秨'), ('zuó', '莋'),
             ('zuó', '笮'), ('zuó', '稓'), ('zuó', '筰'), ('zuó', '鈼'), ('zuó', '㶡'), ('zuó', '㸲'), ('zuó', '䇥'),
             ('zuó', '䝫'), ('zuó', '䞢'), ('zuó', '䞰'), ('zuó', '䎰'), ('zuó', '䟄'), ('zuó', '䯿')]
    zuo_3 = [('zuǒ', '左'), ('zuǒ', '佐'), ('zuǒ', '撮'), ('zuǒ', '繓'), ('zuǒ', '㝾'), ('zuǒ', '䦈')]
    zuo_4 = [('zuò', '作'), ('zuò', '做'), ('zuò', '坐'), ('zuò', '座'), ('zuò', '祚'), ('zuò', '阼'), ('zuò', '怍'),
             ('zuò', '胙'), ('zuò', '酢'), ('zuò', '岝'), ('zuò', '岞'), ('zuò', '侳'), ('zuò', '柞'), ('zuò', '唑'),
             ('zuò', '袏'), ('zuò', '葃'), ('zuò', '葄'), ('zuò', '蓙'), ('zuò', '飵'), ('zuò', '諎'), ('zuò', '糳'),
             ('zuò', '㑅'), ('zuò', '㘴'), ('zuò', '㛗'), ('zuò', '㤰'), ('zuò', '㭮'), ('zuò', '䋏'), ('zuò', '䬤'),
             ('zuò', '㣱'), ('zuò', '䔘'), ('zuò', '䟶'), ('zuò', '㘀'), ('zuò', '䩦')]
    zuo_5 = [('zuo', '咗')]

    @classmethod
    def random_py(cls):
        json = cls.to_py_json()
        py = random.sample(list(json), 1)
        return {py[0]: json[py[0]]}

    @classmethod
    def random_word(cls):
        json = cls.to_word_json()
        py = random.sample(list(json), 1)
        return {py[0]: json[py[0]]}

    @classmethod
    def to_py_json(cls):
        lis = [k.value for k in WordDict.__members__.values()]
        json = {}
        for i, vl in enumerate(lis):
            for j, v in enumerate(vl):
                json[v[0]] = (json[v[0]] if v[0] in json.keys() else []) + [v[1]]
        return json

    @classmethod
    def to_word_json(cls):
        lis = [k.value for k in WordDict.__members__.values()]
        json = {}
        for i, vl in enumerate(lis):
            for j, v in enumerate(vl):
                json[v[1]] = (json[v[1]] if v[1] in json.keys() else []) + [v[0]]
        return json


if __name__ == '__main__':
    a = WordDict.random_word(3)
    print(a)
    pass
